{"title":"Avast Pro Antivirus 2013 v8.0.1482 + License -CaptainCharles.rar","uid":8425722,"size":135533708,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:00cb439739030b5c1879881b23f22171a4f34826&amp;dn=Avast+Pro+Antivirus+2013+v8.0.1482+%2B+License+-CaptainCharles.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"CaptainCharles","files":-1,"time":1367340610,"description":"Avast 8, comparable with the 2013 version of competing suites, includes several new features that directly affect your security. Changes to existing Avast features include increasing the number of virus definition file updates per day, from 20 or so in the previous version to more than 70 per day in version 8. When running on battery on laptops, Avast will automatically disable scans until the device is plugged in, and the suite now offers full IPv6 support.\nLike both the paid and free competition, Avast has a file reputation system for evaluating downloads. The browser add-on WebRep for on-the-fly site evaluation that also checks for fake site certificates is lighter on your browser than competitors' heavyweight toolbars.\nThe free version of Avast is arguably the most comprehensive set of freely available security features on the market. There's a reason these guys have more than 170 million active users (at the time this review was written). The antivirus, antispyware, and heuristics engines form a security core that also includes multiple real-time shields. Along with the new features, it's got Sandbox for automatically walling off suspicious programs; a full complement of shields that guard against scripts, P2P networks, instant messaging, and potentially dangerous program behavior; a silent/gaming mode; on-demand boot scanning; and a healthy output of statistics for the data nerds.\nAvast's Sandbox, by the way, automatically places programs in a virtualized state when it suspects them of being threats. It walls off suspicious programs, preventing them from potentially damaging your system while allowing them to run. As the program runs, the Sandbox keeps track of which files are opened, created, or renamed, and what it reads and writes from the registry. Permanent changes are virtualized, so when the process terminates itself, the system changes it made will evaporate.\n\n\nRead more: Avast Free Antivirus - CNEThttp://download.cnet.com/Avast-Free-Antivirus/3000-2239_4-10019223.html#ixzz2RxSVhUdV","torrent":{"xt":"urn:btih:00cb439739030b5c1879881b23f22171a4f34826","amp;dn":"Avast+Pro+Antivirus+2013+v8.0.1482+%2B+License+-CaptainCharles.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00cb439739030b5c1879881b23f22171a4f34826","infoHashBuffer":{"type":"Buffer","data":[0,203,67,151,57,3,11,92,24,121,136,27,35,242,33,113,164,243,72,38]},"announce":[],"urlList":[]}}