{"title":"Wagner - The Ring,  Janowski (Dresden)","uid":9917467,"size":3404120442,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:05d8694acee4ae59d15ff531e9559d5c3e7cd45b&amp;dn=Wagner+-+The+Ring%2C++Janowski+%28Dresden%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"magneez","files":49,"time":1396918117,"description":"Flac + Cue\n\nrandom review from amazon:\n\n\nYou'll never hear a perfect RING. There are just too many variables, options, and difficulties, plus it's an organic entity that takes 15+ hours to stage. So the law of averages automatically kicks in: when you've got more things that can go wrong, more will.\n\nAnd so it is with its multitudinous recordings. Among the live versions, the earlier ones (Furtwaengler, Krauss, Knappertsbusch) suffer from murky sound, while even those in decent stereo (Keilberth, Boehm, Sawallisch, Barenboim) feature thuds, clunks, and assorted live-performance anomalies that grow less endearing with each listening. As for the studio recordings, they're variously undermined by continuity problems (Solti, Karajan), subpar singing (Swarowsky), or deficiencies in tension and energy (Levine, Haitink).\n\nWhich brings us to this Marek Janowski set. I first reviewed it for Amazon in February 2005, and I'm now updating that review. One of the great unheralded achievements of the waning LP era, Janowski's was the first all-digital RING, recorded in just 2Â½ efficient years during the early 80s. Later the same decade it was the first version to debut on CD, at the top of the 90s a mid-price edition emerged, then a dirt-cheap reissue marked its first appearance in the 21st century ... and finally here it is again, pricewise an even more astonishing bargain. ...","torrent":{"xt":"urn:btih:05d8694acee4ae59d15ff531e9559d5c3e7cd45b","amp;dn":"Wagner+-+The+Ring%2C++Janowski+%28Dresden%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d8694acee4ae59d15ff531e9559d5c3e7cd45b","infoHashBuffer":{"type":"Buffer","data":[5,216,105,74,206,228,174,89,209,95,245,49,233,85,157,92,62,124,212,91]},"announce":[],"urlList":[]}}