{"title":"Antithesis Reborn","uid":9854526,"size":118319345,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0b4693feb153235600b7fb009b23262b80deb67e&amp;dn=Antithesis+Reborn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RocknRide","files":10,"time":1396208313,"description":"Antithesis Reborn (1999-2003) from Kitchener-Waterloo Canada, started as a 2 piece experimental jam session that turned into a regular thing, actively playing gigs with just Drums (Shawn Primmer), &amp; Guitar (Ken Garbett).\nOver the course of time, Antethises added new members and began to change the style as new material was immediately written. Antithesis had a total of 13 songs, only 6 of which were able to make it on the album Dark Theatre, due to technical problems while recording and a lack of time. The members of the band had different directions in our lives at the time, and decided it was best to move on. We agreed to record what we could be parting ways.\nWe had very little resources for gear, the shittiest drum kit ever (used a folding chair for a snare stand, etc), not enough amps &amp; cabs, lack of proper PA. The recording was done by plugging an instrument into a preamp to, the basic mixer, to the computer, and had to use the only working amp for the monitor due to the headphones being garbage and causing a click sound on the tracks.\nI learned how to engineer a recording on the fly, while doing it (on a shit pc with a 6&quot; black &amp; white monitor).\nIt was nothing short of a miracle that this album ever came into existence. Even though the sound quality is garbage, and it wasn't our best performance, we're still proud of the music we wrote and performed.\n\nAntithesis Reborn:\nVocals: Jason (Xinner) Vanbeek\nGuitar: Ken (Pallbearer) Garbett\nGuitar: Sean (23) Trottier\nDrums: Shawn (Primmdog) Primmer\n\n*there was no bass player until the last week before we broke up (Sean Penlington)\nbass tracks were performed on Dark Theatre by Ken Garbett.\n","torrent":{"xt":"urn:btih:0b4693feb153235600b7fb009b23262b80deb67e","amp;dn":"Antithesis+Reborn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b4693feb153235600b7fb009b23262b80deb67e","infoHashBuffer":{"type":"Buffer","data":[11,70,147,254,177,83,35,86,0,183,251,0,155,35,38,43,128,222,182,126]},"announce":[],"urlList":[]}}