{"title":"Various Artists - Music From Hollywood (Live) (1963) [Remastered","uid":9823533,"size":400982358,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0c613b115e340b918289fe004141f1d81a2f576d&amp;dn=Various+Artists+-+Music+From+Hollywood+%28Live%29+%281963%29+%5BRemastered&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alekow1","files":-1,"time":1395731642,"description":"\n&quot;A boon for all film music fans everywhere, this rare live recording features many legendary screen composers (Alfred Newman, Miklos Rozsa, Bernard Herrman, Dimitri Tiomkin, et al.), conducting the themes from their most famous scores, including How The West Was Won, Ben Hur, North By Northwest, High Noon and many more! This CD version contains six previously unreleased tracks.&quot;\n\n\n\n\nIn its original form, this 1964 release by Columbia Records represents an artifact from another world - one that anyone much under the age of 50 in 2005 would be hard put to remember. \nBack in the early '60s, Columbia Records didn't need to have any serious rock &amp; roll acts on its roster. Not only was it the opinion of A&amp;R chief Mitch Miller and almost everyone else at the label that rock &amp; roll was a passing fad that the label could afford to pass up, but the fact was that it could afford to pass it up in those days. They had My Fair Lady, they had The King and I, they had The Sound of Music, cast albums that were among the top-selling LPs of the previous decade, and to top it off, they had soundtracks such as The Bridge on the River Kwai, which was icing on the cake as a perennially popular soundtrack since the movie's release in 1957; and they had Tony Bennett, Johnny Mathis, and Doris Day as top artists in their pop divisions, and a country division spearheaded by Johnny Cash and Marty Robbins; and a jazz roster that included Miles Davis, Duke Ellington, and Dave Brubeck; and in folk music they had an upbeat pop-oriented outfit called the New Christy Minstrels, and an upstart folkie with some potential named Bob Dylan had been signed in 1962; and that isn't even mentioning their classical roster, the largest in the world. \nIn other words, they were making records for grownups (and teenagers who anticipated becoming grownups) to enjoy; and Music from Hollywood -- which resulted from a tie-in to a live CBS Television broadcast of the concert at the Hollywood Bowl, at a time when the network and the label had the same ownership -- sort of fit into this framework, as the kind of serious pop venture that record companies pursued in those days, the same way they obligingly released Christmas albums of their top pop and classical artists. \nAs it came from a live performance, the only real &quot;costs&quot; involved were a live microphone setup and a few hours of an engineer's time, all in conjunction with the network's broadcast activities, and then whatever went into the mixing and the cover design and distribution. Columbia was a little light on soundtrack music and this was an array of some of the best of it, and it had its obvious potential and appeal.\n\nIn those days, the business side of the business mattered, but so did building a catalog, and a commitment to musical excellence that (as had been proved time and again in Columbia's case) paid off in the long-term if not immediately. Today's bean-counters, operating in an environment where record companies operate for the profit they generate now -- and exist only to build up their stats to show that their current owners were brilliant for buying them in the first place or to get huge offers from potential purchasers (but not to build something permanent and make a contribution to the good of music or the arts while making a profit) -- where every expenditure has to pay off 200 percent profits (or better) within three months, would have pegged Music from Hollywood as a guaranteed red-ink entry. And they'd have been right, as it turned out in 1964 -- too few people took movies, much less movie music, seriously enough in those days to appreciate the importance of what was on the record, and as great as some of the music was, it all seemed a little too gauche for serious listeners, or even Broadway enthusiasts, and a little too highbrow for the average moviegoer. But three decades or more on, what's here now seems not only serious enough as listening material (film music having declined considerably since 1963) but damned important and even precious on a cultural level. \nThe recording isn't ideal, some of the microphone placement having emphasized the percussion section at the expense of the strings and winds, though modern remixing has largely corrected that problem; and there probably wasn't as much rehearsal time as an orchestra working under more than a half-dozen composer/conductors in a live setting might have needed to get everything note-perfect. On the other hand, most of these conductors were movie soundstage veterans as were the players on the stage that night, accustomed to doing first-rate work with minimal preparation, and the live setting seems to have energized the players, especially the brass section, making up for some ragged sonic moments, so on balance this is a more-than-worthy effort, and a unique release.\n\nThe content ranges from the relentlessly popular, including Disney tunes and one then-recent chart hit (&quot;Theme from 'A Summer Place'&quot;), to concert instrumental adaptations of works such as David Raksin's &quot;Laura&quot; and Franz Waxman's suite from A Place in the Sun. Miklos Rozsa conducts two selections from his then most recent triumph, Ben-Hur, and Dimitri Tiomkin is represented by High Noon, while Bernard Herrmann does the title track from North by Northwest and &quot;The Memory Waltz&quot; from The Snows of Kilimanjaro. \nJohn Green conducts the &quot;Film Theme Fantasy&quot; of pop hits -- interspersed with Hugo Friedhofer's title theme from The Best Years of Our Lives -- and his own &quot;Raintree County,&quot; and Alex North is represented by two selections from the most recent of all the films quoted, Cleopatra. \nThe original LP, which ran approximately 45 minutes, contained only part of the live performance -- it languished in record store bins during 1964 and was deleted by mid-decade, and by the 1980s had become a high-priced collector's item. But in 1991 the original tapes were retrieved from the vault and it was discovered that the entire live performance had been recorded and was intact. \nThe current CD (issued in 1995) runs over 70 minutes, and contains numerous highlights that were overlooked on the original LP, including &quot;North by Northwest.&quot; (AMG)\n\n\n\n\nThis disc assembles some of the greatest film music of all time in a grand &quot;live&quot; concert setting. \nRecorded at the Hollywood Bowl in Sept. 1963, originally aired on CBS tv this cd features great film composers conducting some of their most memorable scores in an open air setting. \nThe digital remastering is top notch complementing the artistic merit of the performances. \nPlaying this will transport you back to 1963, you will feel the enthusiasm from selection to selection. Executive dir./composer John Green had put together a program that I'm not sure has been attempted since. This &quot;slice and dice&quot; collection of movie gems is far more entertaining than expected. \nThe historic value alone is worth the modest price! (Customer from Amazon)\n\n\n[IMG]http://i.imgur.com/qVK10a3.jpg[/IMG]\n\n\n01. Alfred Newman - How The West Was Won    [3:12]\n02. David Raksin - Laura    [5:45]\n03. Alex North - Caesar's Assassination* / Cleopatra's Entrance Into Rome    [6:38]\n04. Franz Waxman - Suite From A Place In The Sun    [8:19]\n05. Johnny Green - Raintree Country    [6:42]\n06. Johnny Green - Film Theme Fantasy*    [8:18]\n    a) When You Wish Upon A Star\n    b) The Best Years Of Our Lives\n    c) Picnic\n    d) Exodus\n    e) Around The World In Eighty Days\n    f) Hi-Lili, Hi-Lo\n07. Percy Faith - Theme From A Summer Place    [2:41]\n08. Bernard Herrmann - The Memory Waltz    [4:38]\n09. Bernard Herrmann - North By Northwest*    [3:22]\n10. Dimitri Tiomkin - The Green Leaves Of Summer (Sung By Mahalia Jackson)    [4:16]\n11. Dimitri Tiomkin - High Noon*    [5:37]\n12. Miklos Rozsa - Prelude From Ben-Hur    [4:01]\n13. Miklos Rozsa - Parade Of The Charioteers*    [3:28]\n14. Alfred Newman - Conquest*    [3:56]\n\n\n\n*Previously unreleased\n\n\nPerformed by The Hollywood Bowl Symphony Orchestra\n\nRecorded September 25, 1963 at the Hollywood Bowl, Hollywood, CA \nOriginal issue: CS 8913, released: 12/16/63\n\nMixed and digitally mastered by Chris Herles, Sony Music Studios, new York\n\n\nReissue Producer, Liner Notes: Didier C. Deutsch\n\n\n\nLabel: Columbia / Legacy / Sony\nReleased: 1995\n\n\n\n\n\n\nCodec: Flac\nCompression Level: 6\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (600dpi)\n\n\n\n\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:0c613b115e340b918289fe004141f1d81a2f576d","amp;dn":"Various+Artists+-+Music+From+Hollywood+%28Live%29+%281963%29+%5BRemastered","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c613b115e340b918289fe004141f1d81a2f576d","infoHashBuffer":{"type":"Buffer","data":[12,97,59,17,94,52,11,145,130,137,254,0,65,65,241,216,26,47,87,109]},"announce":[],"urlList":[]}}