{"title":"Suicide - Same (1977) MP3@320","uid":10092612,"size":106073836,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e5d9ef4dbaa6e005e4789cc9c0592ea6c1a0a62&amp;dn=Suicide+-+Same+%281977%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":null,"files":15,"time":1399230598,"description":"Suicide is an American electronic protopunk musical duo, intermittently active since 1970 and composed of vocalist Alan Vega and Martin Rev on synthesizers and drum machines. They are an early synthesizer/vocal musical duo.\n\nNever widely popular amongst the general public, Suicide are highly influential: critic Wilson Neate argues that Suicide &quot;would prove as influential as The Clash. The synthpop, techno, and industrial dance sounds of the '80s and '90s, and now the new New Wave of electroclash, all gesture back to that foundational album.&quot;\n\nIn a November 1970 flyer the band was the first ever to use the phrase &quot;punk music&quot; to advertise a concert.\n\nSuicide took their name from the title of a Ghost Rider comic book titled Satan Suicide, a favorite of Alan Vega. Rev's simple keyboard riffs, (initially played on a battered Farfisa organ combined with effects units, before changing to a synthesizer), were accompanied by primitive drum machines, providing a pulsing, minimalistic, electronic backdrop for Vega's murmuring and nervy vocals. They were the first band to use the term punk to describe themselves, which they had adopted from an article by Lester Bangs. Some of their earliest posters use the terms &quot;punk music&quot; and &quot;punk music mass&quot;.\n\nSuicide emerged alongside the early glam punk scene in New York, with a reputation for their confrontational live shows. Many of their early shows were at the Mercer Arts Center, alongside bands like the New York Dolls and Eric Emerson and the Magic Tramps. David Johansen once played harmonica with Suicide in an early show there. Vega and Rev both dressed like arty street thugs, and Vega was notorious for brandishing a length of motorcycle drive chain onstage. Vega once stated &quot;We started getting booed as soon as we came onstage. Just from the way we looked they started giving us hell already.&quot; [5] This sort of audience confrontation was inspired by Vega's witnessing of an Iggy and the Stooges concert at the New York State Pavilion in August 1969, which he later described as &quot;great art&quot;. After the collapse of the Mercer Arts Center in 1973, Suicide played at Max's Kansas City and CBGB, often sharing the bill with emerging punk bands. Their first album was reissued with bonus material, including &quot;23 Minutes Over Brussels&quot;, a recording of a Suicide concert that deteriorated into a riot.\n\n","torrent":{"xt":"urn:btih:0e5d9ef4dbaa6e005e4789cc9c0592ea6c1a0a62","amp;dn":"Suicide+-+Same+%281977%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e5d9ef4dbaa6e005e4789cc9c0592ea6c1a0a62","infoHashBuffer":{"type":"Buffer","data":[14,93,158,244,219,170,110,0,94,71,137,204,156,5,146,234,108,26,10,98]},"announce":[],"urlList":[]}}