{"title":"Amazing Spider-Man 01-25 + Ann (1963-1965|Digital|Cyph+TLK-Emp)","uid":9787348,"size":476415220,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0ec9ab0985d8e5dc3b1aae66e582e4ae8cbf3936&amp;dn=Amazing+Spider-Man+01-25+%2B+Ann+%281963-1965%7CDigital%7CCyph%2BTLK-Emp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1395190311,"description":"Right out of the gate, Spider-Man was a huge success - a teen saddled with enormous grief which he took personally and felt somewhat responsible for, with a meager means of income and all the traditional problems of being a socially awkward geek in school. And, oh yeah - incredible super-powers and a ton of new baddies to deal with! These iconic first two years of Amazing Spider-Man showcase all of these qualities in abundance, with the spectacular duo of Stan Lee and Steve Ditko creating a legend in the process. We see his relationships forming with central characters in the drama, such as his Aunt May, J. Jonah Jameson, Gwen Stacey and Flash Thompson to name a few. There are the famous, tortured thought balloons as he swings high above the Manhattan rooftops. Then of course there are the villains in abundance - long-time nemesis' such as The Vulture, Electro, Sandman, Dr. Octopus, the Green Goblin, and more are first created and revealed within these pages. Also, Spidey has some allies in the form of the Fantastic Four and specifically his unique relationship with the Human Torch. With big fight scenes, tight emotional stories and a great understanding of character, these are all-time classics that should be in every library.\n\nAll of these issues are Digital; the main run is all due to the great work of Tyrant Lizard King (TLK)-Empire and the Annual (which features the first battle with the Sinister Six) is high-res courtesy of Cypher-Empire. As always, hats off to those groups for their efforts and please enjoy - The Amazing Spider-Man! :-)","torrent":{"xt":"urn:btih:0ec9ab0985d8e5dc3b1aae66e582e4ae8cbf3936","amp;dn":"Amazing+Spider-Man+01-25+%2B+Ann+%281963-1965%7CDigital%7CCyph%2BTLK-Emp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec9ab0985d8e5dc3b1aae66e582e4ae8cbf3936","infoHashBuffer":{"type":"Buffer","data":[14,201,171,9,133,216,229,220,59,26,174,102,229,130,228,174,140,191,57,54]},"announce":[],"urlList":[]}}