{"title":"Britney Spears - Oops!...I Did It Again (Special UK Edition) by","uid":9686891,"size":135301909,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1065dda5012b5a7ff06b2ba9fb100bcbb39fb8d2&amp;dn=Britney+Spears+-+Oops%21...I+Did+It+Again+%28Special+UK+Edition%29+by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MusicFanatic98","files":-1,"time":1393785338,"description":"Oops!...I Did It Again is the second studio album by American recording artist Britney Spears. It was released on May 16, 2000 by Jive Records. Its music incorporates pop, dance-pop, and teen pop styles, much in the vein of her debut album ...Baby One More Time (1999).[1] Contributions to the album's production came from a wide range of producers, including Max Martin, Rami Yacoub, Per Magnusson, David Kreuger, Kristian Lundin, Jake Schulze, Darkchild, and Robert John &quot;Mutt&quot; Lange. Upon its release, Oops!...I Did It Again received generally favorable reviews from music critics. It debuted at the top the U.S. Billboard 200, with first-week sales of 1,319,000 copies, breaking the previous SoundScan record for the highest debut-week album sales by a solo artist.[3] The album also reached number one in thirteen other countries while peaking inside the top five positions in Australia, Finland, Japan, New Zealand and the United Kingdom. It was her second album to receive a diamond certification from the Recording Industry Association of America (RIAA).[4] The album has sold 20 million copies to date, making it one of the highest selling albums of all time and Spears' second best selling album after ...Baby One More Time. Four singles were released from the album. Its title track became an international hit reaching number one in Australia, Canada, United Kingdom and nine other countries while peaking in the top five positions in six other countries. Its second single &quot;Lucky&quot; reached number one in five countries while its third single &quot;Stronger&quot; became the highest-selling single of the album in the United States. &quot;Stronger&quot; received a Gold certification in the United States and three other countries.","torrent":{"xt":"urn:btih:1065dda5012b5a7ff06b2ba9fb100bcbb39fb8d2","amp;dn":"Britney+Spears+-+Oops%21...I+Did+It+Again+%28Special+UK+Edition%29+by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1065dda5012b5a7ff06b2ba9fb100bcbb39fb8d2","infoHashBuffer":{"type":"Buffer","data":[16,101,221,165,1,43,90,127,240,107,43,169,251,16,11,203,179,159,184,210]},"announce":[],"urlList":[]}}