{"title":"Spider: Secret of Bryce Manor v1.7","uid":8505183,"size":104557139,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:15e5c3e8f6374208660f1bbc2c85c009c2a84dd7&amp;dn=Spider%3A+Secret+of+Bryce+Manor+v1.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":-1,"time":1369403426,"description":"\nYou are a spider. One afternoon, you discover an abandoned mansion. Where is the family who lived here? What happened, and why did they leave? Search for clues as you adventure from room to room on the hunt for your next meal. Build webs of your own design: in the corners, under the furniture, and in the forgotten places too small for humans. Are you a shrewd enough sleuth to decode the mystery and uncover the Bryce family secret?\n\n* DRAW WEBS WITH YOUR FINGER\n\n- Touch to walk, swipe to jump, and build webs by drawing shapes in the environment.\n- Powerful, intuitive controls; easy to pick up, challenging to master.\n\n* SEE THE WORLD THROUGH THE EYES OF A SPIDER\n\n- 38 beautifully hand-illustrated levels to explore, optimized for the retina display.\n- Hunt your insect prey, leaving Bryce Manor covered in cobwebs!\n- Search for family secrets in the shadowy basement, beneath the floorboards, and in the darkest corners.\n\n* CONQUER UNIQUE ACTION-PUZZLE CHALLENGES\n\n- Use instinct and guile to track down an assortment of tasty insects.\n- Tackle hornets, herd mosquitoes, stun dragonflies, attract moths with light, and more!\n- Plan your meals wisely! Run out of silk and risk your demise.\n\n* HOURS OF CAPTIVATING GAMEPLAY\n\n- 4 game modes offer limitless depth: race against time in Feeding Frenzy, solve the puzzles of Precision, and survive the intensity of Hunger Mode.\n- Earn 48 challenging Achievements including Linebacker, Gaping Maw, and One Fell Stroke.\n- Compete with the world on the Spider global leaderboards. Spin together massive combos to get the highest score!\n\n* CONNECT WITH YOUR FRIENDS ON\n\n- UseConnect to share stories and compare high scores with your friends!\n\n* ORIGINAL SOUNDTRACK &amp; iPOD SUPPORT\n\n- Enjoy the delicious Spider soundtrack, or listen from your own music library.\n\nWhat's in this version:\nSpider has arrived on Android! In version 1.7, we fixed an issue where the game would crash after the &quot;Under the Stairs&quot; level. Thanks for playing and for the feedback!\n\n\nInstructions:\n\n1.Copy 'com.tigerstylegames.spider' folder to 'sdcard/Android/obb'\n2.Install APK\n3.Launch the game\n","torrent":{"xt":"urn:btih:15e5c3e8f6374208660f1bbc2c85c009c2a84dd7","amp;dn":"Spider%3A+Secret+of+Bryce+Manor+v1.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15e5c3e8f6374208660f1bbc2c85c009c2a84dd7","infoHashBuffer":{"type":"Buffer","data":[21,229,195,232,246,55,66,8,102,15,27,188,44,133,192,9,194,168,77,215]},"announce":[],"urlList":[]}}