{"title":"Tokyo Police Club - Forcefield 2014 (preview)","uid":9684391,"size":11595120,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:162800b9004fc5638a9b1fe1414ecb88b18a992c&amp;dn=Tokyo+Police+Club+-+Forcefield+2014+%28preview%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bark_Meow","files":2,"time":1393735023,"description":"Tokyo Police Club formed in 2005 while playing for fun in a basement after the four had disbanded from a previous group called Suburbia. The band started to gain attention and played some small shows throughout the Toronto area. Tokyo Police Club were asked to play in the Pop Montreal festival,[6] and soon after they signed with Toronto label Paper Bag Records; Monks and Alsop dropped out of college to become professional musicians.[7]\n\nSince their formation the band has appeared in numerous festivals. In 2006 they appeared at Edgefest and the inaugural Osheaga Festival; however, could not play that year due to other conflicts. In 2007, they performed at Coachella, Lollapalooza, Bumbershoot, the Glastonbury Festival, and the Reading and Leeds Festival. In 2008 the band played the Roskilde Festival, the Rock am Ring-Festival, and Street Scene. In 2010, the band played the Bonnaroo Music Festival. They also played at San Francisco's 2010 Outside Lands Music and Arts Festival.\n\nIn the fall of 2008, the band played on the last 6 weeks of Weezer's Troublemaker Tour along with Angels and Airwaves. In the same year, they released their first album, Elephant Shell.\n\nTheir second full-length album, Champ, was released on June 8, 2010. produced by Rob Schnapf ( Saves The Day, The Vines, Sweet Thing)[8]\n\nOn June 18, 2011, the video for &quot;Wait Up (Boots of Danger)&quot; was nominated as best indie video of the year by MuchMusic. The video was directed by Mike Juneau and Kyle McCreight, and produced by Jesse Ewles and Chris Cunningham. In 2011 the band also released 10 Days. 10 Covers. 10 Years., a project in which they recorded and releases a new cover song from one of the last 10 years, going in order from 2001 to 2010.\n\nIn 2012, the band joined Foster the People on the North American portion of their Torches tour along with Kimbra.\n\nIn addition to his work with the band, Wright also currently hosts programming on CBC Radio 3.\n\nOn December 8, 2011, the band revealed an unreleased song &quot;Beaches&quot; at a live show. On December 11, 2013, the band debuted a nine-minute lyric video for &quot;Argentina (Pts. I, II, and III)&quot; on YouTube.[9] Both tracks are on their new album &quot;Forcefield&quot; which will be released in Early 2014.","torrent":{"xt":"urn:btih:162800b9004fc5638a9b1fe1414ecb88b18a992c","amp;dn":"Tokyo+Police+Club+-+Forcefield+2014+%28preview%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"162800b9004fc5638a9b1fe1414ecb88b18a992c","infoHashBuffer":{"type":"Buffer","data":[22,40,0,185,0,79,197,99,138,155,31,225,65,78,203,136,177,138,153,44]},"announce":[],"urlList":[]}}