{"title":"Gene scott","uid":10091939,"size":21585649241,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1cefc9547272702105c0db0a0b4cce201bf557aa&amp;dn=Gene+scott&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1399216380,"description":"This is a collection of Gene Scott preachings - NOT MY ORIGINAL TORRENT!!!\n\n\nGene Scott was born in Buhl, Idaho. He earned his Ph.D. in Philosophies of Education at Stanford University in 1957 and subsequently served as an ordained minister for almost 50 years. During his career, Scott served as a traveling Teacher for the Pentecostal Assemblies of God, the president of the Full Gospel Fellowship of Churches and Ministers International for nine years and, for a combined total of 35 years, as the pastor for the Protestant Wescott Christian Center and Faith Center. For the last fifteen years of his ministry Scott held weekly Sunday Bible teaching services at the Los Angeles University Cathedral in Los Angeles, California.[1]\n\nIn 1975, Scott was elected pastor of Faith Center, a 45-year-old church of congregational polity in Glendale, California. Faith Broadcasting Network was the first Christian television station and the first to provide 24-hour Christian programming. Scott added a nightly live television broadcast to the network called the Festival of Faith.\n\nIn 1983, the University Network began broadcasting the first 24-hour-a-day religious television network via satellite to North America and much of Mexico and the Caribbean. Affiliate television and radio stations broadcast Scott's services and nightly teachings.","torrent":{"xt":"urn:btih:1cefc9547272702105c0db0a0b4cce201bf557aa","amp;dn":"Gene+scott","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cefc9547272702105c0db0a0b4cce201bf557aa","infoHashBuffer":{"type":"Buffer","data":[28,239,201,84,114,114,112,33,5,192,219,10,11,76,206,32,27,245,87,170]},"announce":[],"urlList":[]}}