{"title":"Age.of.Wonders.III-RELOADED","uid":9861186,"size":4164762480,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1fdccd4e88f1b1f34699b4be73e726c3e87400e0&amp;dn=Age.of.Wonders.III-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Taker009","files":2,"time":1396300967,"description":"nERv\n\nAge of Wonders III Deluxe Edition (c) Triumph Studios\n\n03/2014: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: RPG, Strategy\n\nAge of Wonders III is the long anticipated sequel to the award-winning\nstrategy series. Delivering a unique mix of Empire Building, Role Playing and\nWarfare, Age of Wonders III offers the ultimate in turn-based fantasy\nstrategy for veterans of the series and new players alike!\n\nCreate an Empire in your own Image\n\n* Rule as one of 6 RPG style leader classes: Sorcerer, Theocrat, Rogue\nWarlord, Archdruid, or the tech-focused Dreadnought\n* Research powerful skills unique to your class to develop your empire and\narsenal\n* Choose your allies from among the six main races - Humans, High Elves\nDwarves, Orcs, Goblins and Draconians - and fantastical monster dwellings\nExplore and Exploit a Living Fantasy World\n\n* Explore a rich fantasy world that is more detailed and alive than ever with\nover 50 location types to raid for treasure\n* Expand your domain by building new settlements, forge pacts with monstrous\nallies and capture valuable resources\n* Wield earth shattering magic and terra-form the lands for your needs\nFight In-depth Tactical Battles\n\n* Recruit legendary heroes, equip them with magical weapons, and let them\nlead your armies into battle\n* Crush your enemies using the detailed 3D turn-based Tactical Combat System\n* Become a master tactician. Crush city defenses. Learn to use flanking and\nmaster your army's hundreds of abilities\nMaster Age of Wonders III's many Modes!\n\n* Immerse yourself in a rich single player story campaign, playable from two\nsides of an epic conflict\n* Create endless scenarios using the random map generator\n* Compete in multiplayer wars with up to 8 players online\nPlease note that:\n\n* Level Editing Tools are provided as a courtesy to fans. They might have\ndifferent system specifications from the Age of Wonders III game, are not\ntech supported and have an English only interface\n* Coop: Random maps and stand-alone scenarios can be played using player\nalliances versus computer opponents\n* Local Coop: Random maps and stand-alone scenarios can be played using Hot\nSeat mode on the same computer using player alliances versus computer\nopponents\n\nThis release is the Deluxe edition which includes:\n\nElven Resurgence standalone scenario\n\nReturn to the roots of the Age of Wonders with this unique\nPre-Purchase gift for our loyal fans. Once a sanctuary of the Elven Court\nHeartwood Forest is now a defiled battleground with savage clans\nwarring over its natural treasures. Following The Mending of the Wood\nElves and the Dark Elves, the newly formed High Elves vow to retake\nHeartwood Forest and restore it to its ancient glory. You can play\nthis Stand Alone Scenario featuring sylvan wars and underground clashes\nversus AI opponents or in multiplayer with up to 6 players\n\nDragon's Throne Scenario\n\nAn extra large Stand-Alone Scenario. Legend tells of dragons who ruled\nthe fabled Sea of Flames at the dawn of time. However nobody has seen\na True Dragon in living memory. The isles are still loaded with treasure\nand have become popular with adventures, merchants, scoundrels and\nsightseers. Now eight rival lords have found a mysterious dragon.s\negg, and each sees it as proof of their claim to the Dragon.s Throne. The\nsages warn they risk unleashing the wrath of the Dragons, but the\nLords pay no heed as they prepare for war. You can play the Dragon's\nThrone versus AI opponents or in multiplayer with up to 8 players\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game, play as guest/offline if prompted\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:1fdccd4e88f1b1f34699b4be73e726c3e87400e0","amp;dn":"Age.of.Wonders.III-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fdccd4e88f1b1f34699b4be73e726c3e87400e0","infoHashBuffer":{"type":"Buffer","data":[31,220,205,78,136,241,177,243,70,153,180,190,115,231,38,195,232,116,0,224]},"announce":[],"urlList":[]}}