{"title":"Mp3 Audio Editor 8.0.1 With License Key - KurdTM","uid":8492927,"size":21681688,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24b0e749be62339a04536e03e11e4b8a16bc42f6&amp;dn=Mp3+Audio+Editor+8.0.1+With+License+Key+-+KurdTM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KurdTM","files":-1,"time":1369010967,"description":"Mp3 Audio Editor is a multi-award winning mp3 editing software tool. The Mp3 Audio Editor software includes a powerful MP3 editor feature that can edit MP3 as well as WMA, WAV, and OGG files with ease Edit Mp3 files visually (Cut, Copy, Delete Selection, Delete Silence, Paste, Paste From File, Mix, Mix From File); Record audio from a microphone or any other available input device and save directly to WAV, MP3, WMA, OGG, etc. files; Apply various effects (Amplify, Compressor, Delay, Equalize, Fade In and Fade Out, Flanger, Invert, Normalize, Phaser, Reverb, Reverse, Silence, Shrink, Stretch, Vibrato, etc.); Burn audio CDs from MP3, WMA, WAV, and OGG. The audio CD burner feature is very powerful, yet easy to use.\n\n\nWith Mp3 Audio Editor you can\nlay, record, edit, mix, and analyze mp3 / audio files\nMake perfect digital copies of audio CD tracks using the CD Reader tool and save them in wav, wma, mp3, or ogg files\nRecord audio from cassettes, vinyl records, radio, etc. through your computer's line-in\nRecord dictation through a microphone or from DVD Player, WinAMP, RealPlayer, Windows Media Player and more\nMp3 / audio editing functions include cut, copy, paste, delete, insert, silence, trim, mix and more.\nApply various effects (Amplify, Compressor, Delay, Equalize, Fade In and Fade Out, Flanger, Invert, Normalize, Phaser, Reverb, Reverse, Silence, Shrink, Stretch, Vibrato, etc.);\nBatch processing supports up to 32000 files allowing you to apply effects and/or convert your files as a single function.\nReal-time effect preview is supported\nPowerful noise reduction tool\nEasy to use bookmark and region manager\nEasy to use interface will get you started editing in just minutes.\nSupports a number of file formats including wav (multiple codecs), mp3, wma, ogg and many more","torrent":{"xt":"urn:btih:24b0e749be62339a04536e03e11e4b8a16bc42f6","amp;dn":"Mp3+Audio+Editor+8.0.1+With+License+Key+-+KurdTM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24b0e749be62339a04536e03e11e4b8a16bc42f6","infoHashBuffer":{"type":"Buffer","data":[36,176,231,73,190,98,51,154,4,83,110,3,225,30,75,138,22,188,66,246]},"announce":[],"urlList":[]}}