{"title":"Kathy Mattea - Right Out Of Nowhere [2005][EAC,log,cue. FLAC]","uid":8427681,"size":319633904,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:285c9a2ecd413b2f5de42197e3a95057b4ed66cd&amp;dn=Kathy+Mattea+-+Right+Out+Of+Nowhere+%5B2005%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":16,"time":1367396290,"description":"Artist: Kathy Mattea\nRelease: Right Out Of Nowhere\nDiscogs: 4373531\nReleased: 2005\nLabel: Narada\nCatalog#: 72438-75736-2-8\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Folk, World, &amp; Country, Country\n\nTracklisting:\n\n01. Right Out Of Nowhere (4:08)\n02. Gimme Shelter (4:13)\n03. Hurt Some (4:23)\n04. Love's Not Trough With Me Yet (4:37)\n05. Loving You, Letting Go (3:27)\n06. Live It (4:09)\n07. I Hope You're Happy Now (4:39)\n08. Down On The Corner (3:33)\n09. Only Heaven Knows (4:18)\n10. Give It Away (4:21)\n11. Wade In The Water (5:53)\n\nCredits: Show\n\nVeteran country singer Kathy Mattea returns with her third album on Narada, and it's easily her most consistent since she joined the label. Self-produced, Mattea once more layers in all her favorite touches like Bill Cooley's bouzouki and Randy Leago playing both accordion and sitar on the title cut, which opens the set. This track underscores a running theme in Mattea's work: transformation and change. This is a song, like so many others in her vast catalog, where the protagonist is torn about leaving one place in pursuit of an unknown future, but there is acceptance and resignation in her voice when she sings &quot;Right out of nowhere/You open your heart/And let go of everything/You're going somewhere/And all you need to know/Is you're free to go.&quot; Two surprises here are in covers of the Rolling Stones' &quot;Gimme Shelter&quot; and John Fogerty's &quot;Down on the Corner.&quot; That they appear on the same album is rather startling, giving the listener a gauge that this is no ordinary country record. The former tune is a largely acoustic read, with an organ and a Wurlitzer being the only electric instruments. Its layered guitars, mandolin, and bass flute offer all the urgency of the original, but in her delivery, Mattea makes the tune a gospel song, one that pleads for deliverance and is anchored in awareness. The latter is steeped in blues with harmonica and a steel-string ushering in her voice as it struts, as if from a back-porch singalong. The chorus of backing vocals underscores this and gives the tune its gritty country-funk feel. But of course, it's in the ballads where Mattea really shines, such as on &quot;Hurt Some,&quot; the Celtic-flavored &quot;Love's Not Through With Me Yet,&quot; and the streamlined country of &quot;Loving You, Letting You Go,&quot; easily the most heart-wrenching cut on the disc. But it doesn't end there with brokenness, as &quot;Live It,&quot; &quot;Give It Away,&quot; and &quot;Only Heaven Knows&quot; reveal where hurt becomes self-determination and freedom. The album closes with a fine and utterly new arrangement of the old gospel tune &quot;Wade in the Water.&quot; It's gritty, funky, and greasy. Wurlitzer and organ fuel the backdrop and the Settles Connection provide the backing chorus, keeping it firmly in the gospel tradition. Mattea is one of those singers who can do anything she likes; her emotive phrasing and willingness to stretch herself are commendable, and Right Out of Nowhere is one of her most ambitious outings yet.","torrent":{"xt":"urn:btih:285c9a2ecd413b2f5de42197e3a95057b4ed66cd","amp;dn":"Kathy+Mattea+-+Right+Out+Of+Nowhere+%5B2005%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"285c9a2ecd413b2f5de42197e3a95057b4ed66cd","infoHashBuffer":{"type":"Buffer","data":[40,92,154,46,205,65,59,47,93,228,33,151,227,169,80,87,180,237,102,205]},"announce":[],"urlList":[]}}