{"title":"3.10 to Yuma (2007, 720p, NL subs)","uid":9798760,"size":7022019665,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:286894a7abb4baf5a26e8171b8bb2b7357ef56d5&amp;dn=3.10+to+Yuma+%282007%2C+720p%2C+NL+subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1395354473,"description":"[Dutch]\nVerenigde Staten\nWestern / Actie\n122 minuten\n\ngeregisseerd door James Mangold\nmet Russell Crowe, Christian Bale en Logan Lerman\n\nRemake van de gelijknamige film uit 1957. De door droogte geteisterde arme rancher Dan Evans is samen met zijn beide zoons getuige van een zeer gewelddadige overval op een postkoets met de salarissen voor het personeel van de Southern Pacific Railroads door de beruchte outlaw Ben Wade en zijn bende. Wade wordt echter gearresteerd. Dan Evans begeleidt vervolgens tegen een beloning van $200 Wade van Bisbee naar Contention, van waar hij Wade met de trein van tien over drie naar de gevangenis in Yuma moet brengen. Vanaf het vertrek uit Bisbee blijkt de reis niet zonder gevaren te zijn en een psychologische kat en muis spel tussen Evans en Wade begint.\n\n[English]\nRancher Dan Evans heads into Bisbee to clear up issues concerning the sale of his land when he witnesses the closing events of a stagecoach robbery led by famed outlaw Ben Wade. Shortly thereafter, Wade is captured by the law in Bisbee and Evans finds himself one of the escorts who will take Wade to the 3:10 to Yuma train in Contention for the reward of $200. Evans's effort to take Wade to the station is in part an effort to save his land but also part of an inner battle to determine whether he can be more than just a naive rancher in the eyes of his impetuous and gunslinging son William Evans. The transport to Contention is hazardous and filled with ambushes by Indians, pursuits by Wade's vengeful gang and Wade's own conniving and surreptitious demeanor that makes the ride all the more intense.","torrent":{"xt":"urn:btih:286894a7abb4baf5a26e8171b8bb2b7357ef56d5","amp;dn":"3.10+to+Yuma+%282007%2C+720p%2C+NL+subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"286894a7abb4baf5a26e8171b8bb2b7357ef56d5","infoHashBuffer":{"type":"Buffer","data":[40,104,148,167,171,180,186,245,162,110,129,113,184,187,43,115,87,239,86,213]},"announce":[],"urlList":[]}}