{"title":"The Purple Zombie Archives COMPLETE! Golden Age","uid":8420808,"size":51261325,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2b6e25296960572cea7ecf6acf085f69b69c1756&amp;dn=The+Purple+Zombie+Archives+COMPLETE%21+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367185543,"description":"Before she would become known for her Miss Fury strip Tarpe worked for several companies including Eastern Color.\nFor the first 12 issues of Reg'lar Fellers Heroic Comics Mills produced two features each month.\nThis collection features her unique style and quite strange stories about the Purple Zombie and his adventures in Time!\n\nCreated by Doctors Malinsky and Hale, the Purple Zombie was intended by Dr. Hale to be used to prolong life, not to revive the dead. However, the evil Dr. Malinsky wanted to create zombie armies and become &quot;ruler of the living and the dead.&quot; Malinsky shoots Hale but is then strangled to death by the zombie, who, in his own words, is &quot;without a conscience...but not without a brain.&quot; The Purple Zombie then destroys Malinsky's allies\n\nThe rampaging zombie was then captured by the police and sentenced to death. But when he was taken to the electric chair (&quot;This'll be the first time I ever saw a guy die twice!&quot;)it would not die because its skin does not conduct electricity. Luckily, Hale turned out not to dead after all and the Purple Zombie, who Hale called &quot;Zoro,&quot; was still obedient to him. The court released the zombie into his custody. But notorious gangleader Joe Coroza saw the zombie as a potential asset and kidnapped him. Hale fought the gangsters and the Mechanized Skeleton to recover him.\n\nIn later adventures they traveled back in time together. On one trip, they battled Saracens and met King Richard, The Lionheart. On another trip, they travelled to Rome during the reign of Nero, where they narrowly escaped the Great Fire. ","torrent":{"xt":"urn:btih:2b6e25296960572cea7ecf6acf085f69b69c1756","amp;dn":"The+Purple+Zombie+Archives+COMPLETE%21+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b6e25296960572cea7ecf6acf085f69b69c1756","infoHashBuffer":{"type":"Buffer","data":[43,110,37,41,105,96,87,44,234,126,207,106,207,8,95,105,182,156,23,86]},"announce":[],"urlList":[]}}