{"title":"2014 - The Year In Christian Music (Bundle 12)","uid":9881025,"size":2167626456,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b999b5c6177c15f4195ffa0d667d8e939d785eb&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+12%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"TorrentTracts","files":254,"time":1396550003,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nEvery now and again, someone will come along and try to discourage my efforts here.  Sometimes it's not so much what they say, but rather the atmosphere they create with their presence.  And by now, many of you have gotten to know me well enough to know I tend to pull back from that sort of stuff.  I really have no desire to deal with it.\n\nI can take it from an Agnostic, or an Atheist.  But it astonishes me most when I learn these people also claim they are God-following and God-serving Christians.  Yet they discourage me for serving Him?  I can't remember ever standing outside of a food bank, or walking through Church one Sunday morning trying to discourage my fellow brethren.  I can't remember ever telling my Pastor to zip it.  I can't remember ever interrupting grace before dinner, to tell the children they should just skip the head bowing nonsense, and begin eating.  So it blows my mind that any Christian would come here and essentially stomp on the efforts we have all have created in His honor.\n\nFor those who haven't read it in the last thread, we had someone who had lots to say, and in doing so, made it difficult for me to find a reason to stick around.  I tried, yet failed miserably at asking him to tone it down.  That caused a Holy War of near epic proportions.  I left for a length of time, as he proceeded to throw around scripture and tell anyone who questioned his motifs how unchristian they were and how... well it doesn't matter anymore.\n\nSince then, I have asked God to lead me He wanted me to serve.  I could (1) continue to serve here, and somehow find the strength to deal with this drama from time to time, or (2) I could serve elsewhere online where there was no drama.  My ministry continues whether I am doing it here or elsewhere.\n\nIt was then that I was reminded of a sermon I heard in the early 1990's.  The speaker essentially told us we can gauge how close we are to the Lord, how effective we are for Him, based upon the amount of adversity and tears we shed.  That sermon spoke to my heart that day, and stayed with me all these years.  We all know there's enough pompous and holier than thou Christians out there who don't have a clue what it means to serve.  Sure grace is a gift we can't repay, but I'll be damned if I'm going to just sit around with a glorious self-serving smile on my face and think my part is done.\n\nHe went on to give the analogy of war.  In a battle line, those furthest away from the leaders tend to be less wounded.  Tend to be less of a target.  Tend to be safer.  Yet those standing right next to the leaders suffer the greatest injury.  In a similar way, those standing closest to Jesus are often the first ones prosecuted.\n\nA Christian life on my feet is not a life I want to live.  A Christian life on my knees is where I belong.  Amen?  Sure I'd rather have my brothers and sisters in Christ support me, but if they feel they must discourage me, then I'll simply drop to my knees once again.  And pray that every one of you take some personal level of ownership in the situation.  Because this is, after all, not just my ministry or my battle to fight.  This ministry belongs to all of us.\n\nOur friend lategrad, and let's be truthful here, once told us how effortless it was for me to gather together this music for everyone.  At the time, I wasn't a big lategrad fan.  But once I calmed down, I asked God to encourage lategrad to stick around.  Just this morning, he posted a message of encouragement that in part included, &quot;I always told myself that you could tell if someone was doing kingdom work by the amount of persecution directed at those individuals.&quot;  Precisely on point!\n\nSo I am dedicating this torrent today to lategrad, and all of you who had the courage to pipe up for the greater good of this ministry, during my absence. \n\nCONTEMPORARY: About A Mile, Brandon Heath, Dara Maclean, Michael Boggs, Rend Collective Experiment, Rhett Walker Band, River Valley Youth, Selah, Shawn McDonald, Tenth Avenue North.  HIP-HOP/RAP: Andy Mineo, Applejaxx, Asaint, Cruz, Davis Absolute, Divenomous, Lecrae, The New Cool, Scribbling Idiots, ShonLock, Ty The Berean, Witness.  ROCK: Barren Cross, Big Daddy Weave, Building 429, Fight The Fade, Finding Favour, For King And Country, Jars of Clay, Rush Of Fools, Unspoken.  HARDCORE/METAL: Being As An Ocean, Hundredth, Meadows.  INDIE: Blake Flattley.  R&amp;B: Coko.  ALTERNATIVE: Eric B Dixon, Future Of Forestry, Needtobreathe, Paramore.  GOSPEL: Ethan Kent.  PRAISE &amp; WORSHIP: Faith And Family Church, Mark Schultz, Michael W Smith, One Church, Paul Baloche, Sarah Reeves, Various.  POP: Kaleidoscope, Kari Jobe, Lights Of Day.  SINGER-SONGWRITER: Nate Gomes, Stephen Hample.  CLASSICAL: The Piano Guys.  JAZZ: Sam Fred.\n\nThere are 61 titles being shared today, including...\n\n * About A Mile - 2014 - Satisfied - Single\n * Andy Mineo - 2014 - Death Of Me - DJ Official - Single\n * Applejaxx - 2014 - Never Bored - Single\n * Asaint - 2014 - Been Good - Single\n * Barren Cross - 2014 - Birth Pangs\n * Being As An Ocean - 2014 - Death's Great Black Wing Scrapes The Air - Single\n * Big Daddy Weave - 2014 - Love Come To Life - The Redeemed Edition\n * Blake Flattley - 2014 - My Song Is Love Unknown - Single\n * Brandon Heath - 2014 - Jesus Son Of God - Single\n * Building 429 - 2014 - White Flag - Single\n * Coko - 2014 - At Your Feet - Single\n * Cruz - 2014 - Destination\n * Dara Maclean - 2014 - Stronger - Single\n * Davis Absolute - 2014 - Slow Down - Single\n * Divenomous - 2014 - The Message - Single\n * Eric B Dixon - 2014 - We Are Your People - Single\n * Ethan Kent - 2014 - Work In Progress\n * Faith And Family Church - 2014 - Live Is Life EP\n * Fight The Fade - 2014 - Second Horizon - Single\n * Finding Favour - 2014 - Say Amen - Single\n * For King And Country - 2014 - From The Inside Out - Single\n * Future Of Forestry - 2014 - The Piano And Strings Sessions\n * Hundredth - 2014 - Resist EP\n * Jars of Clay - 2014 - Jars 20 StageIt Acoustic EP\n * Kaleidoscope - 2014 - Love Like You - Single\n * Kari Jobe - 2014 - Majestic\n * Lecrae - 2014 - Tell The World - Matthew Parker Remix - Single\n * Lights Of Day - 2014 - Shine Like The Morning - Single\n * Mark Schultz - 2014 - Hymns\n * Meadows - 2014 - These Days - Single\n * Michael Boggs - 2014 - More Like A Lion\n * Michael W Smith - 2014 - Hymns\n * Nate Gomes - 2014 - For The Glory Of It All - Single\n * Nate Gomes - 2014 - One Life - Single\n * Nate Gomes - 2014 - Press On - Single\n * Nate Gomes - 2014 - Press On Instrumental - Single\n * Needtobreathe - 2014 - Wasteland - Single\n * New Cool, The - 2014 - Worship And Rhyme, Vol 1\n * One Church - 2014 - You Made Me Whole - Single\n * Paramore - 2014 - Waves - Single\n * Paul Baloche - 2014 - He Is Risen - Single\n * Paul Baloche - 2014 - Live\n * Piano Guys, The - 2014 - The Mission - How Great Thou Art - Single\n * Rend Collective Experiment - 2014 - The Art Of Celebration\n * Rhett Walker Band - 2014 - Always - Single\n * Rhett Walker Band - 2014 - Broken Man - Single\n * River Valley Youth - 2014 - Wreckage - Single\n * Rush Of Fools - 2014 - Lay Me Down - Single\n * Sam Fred - 2014 - Expressions Of Love\n * Sarah Reeves - 2014 - Faithful - Single\n * Scribbling Idiots - 2014 - Invitation Only\n * Selah - 2014 - You Amaze Us - Single\n * Shawn McDonald - 2014 - End Of The Day - Single\n * ShonLock - 2014 - A Night To Remember\n * Stephen Hample - 2014 - He Shall Be Seen - Single\n * Stephen Hample - 2014 - I Love The Way - Single\n * Tenth Avenue North - 2014 - Christ Is Risen - Single\n * Ty The Berean - 2014 - Won't Back Down - Single\n * Unspoken - 2014 - Start A Fire - Single\n * Various - 2014 - Vital Worship - Songs For The Living King\n * Witness - 2014 - King Without A Crown - Single\n\nFor Him,\nTorrentTracts, April 2014","torrent":{"xt":"urn:btih:2b999b5c6177c15f4195ffa0d667d8e939d785eb","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+12%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b999b5c6177c15f4195ffa0d667d8e939d785eb","infoHashBuffer":{"type":"Buffer","data":[43,153,155,92,97,119,193,95,65,149,255,160,214,103,216,233,57,215,133,235]},"announce":[],"urlList":[]}}