{"title":"Wondershare DreamStream 1.1.5.1 Premium + patch-MPT","uid":10083695,"size":42977588,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2c13ab43f44a5f1ac9c9fa6a902147c507e7d1b4&amp;dn=Wondershare+DreamStream+1.1.5.1+Premium+%2B+patch-MPT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flau_bert","files":-1,"time":1399056104,"description":"================\n[INFO:]\n================\n\nWondershare DreamStream 1.1.5.1 Premium + patch-MPT | 40.9 MB\n\n\nWireless Enjoyment of full HD Movies and Music without a Smart TV\n\nStream all of your media from your Windows PC and tablet, directly to your TV, via your Google Chromecast. Watch your favourite shows, movies and playlists, directly from the program interface with no need to launch an internet browser. DreamStream makes enjoying your media collection as simple as the click of a button.\n\nStream your Favourite Movies, Music &amp; TV Series\n\nStream your entire collection in High Definition, without transferring your videos, music &amp; more to an external hard drive, USB or HDMI. Enjoy a single solution that allows you to stream, manage and enjoy your content without the use of an internet browser.\n\nSupport for 20+ Media Formats\n\nDreamstream supports a huge variety of file formats eliminating the need to convert your entire collection due to file type limitations. DreamStream Supported Files - Video: MP4, MOV, MKV, AVI, MPG, WMV, MTS, FLV, M2TS, 3G2, 3GP, DIVX, RM, RMVB, VOB, ASF, TS, DV, F4V, OGV, TOD, TP, TRP, WEBM. Audio: MP3, AAC, WMA, APE, FLAC, OGG, M4A, WAV, AC3, MP2.\n\nAutomatic Media Management &amp; Built-in Player\n\nAutomatically manage your collection with auto-indexing; DreamStream finds and sorts your media files saved on your hard drive and populates them into the Dreamstream library. Manage your entire collection and even enjoy your content on the go, with your Windows laptop or tablet, by utilizing the built-in media player.\n\n\nPlatform : Windows XP/Vista/Windows 7/Windows 8/Windows 8.1\nLanguage : English\n\n\n================\n[CHANGELOG:]\n================\n\nWhat's New in Version 1.1.5\n\n1. Fixed the connect error issue to Chromecast;\n2. Fixed the playback issue while connecting to Chromecast.\n\n\n================\n[INSTALL NOTES:]\n================\n\n1. Install program and donÂ´t start it\n2. Copy the patcher to the default program dir.\n3. Apply it with Admin rights. Finally choose &quot;WUL.Core.dll&quot;\n4. It's always recommended to block the program with a firewall option!\n\nNOTE: Keygens, patches, Activators, Cracks, Loaders etc. are always scanned with\n     Kaspersky Internet Security 2014 Latest Version to Avoid Virus\n     issues.","torrent":{"xt":"urn:btih:2c13ab43f44a5f1ac9c9fa6a902147c507e7d1b4","amp;dn":"Wondershare+DreamStream+1.1.5.1+Premium+%2B+patch-MPT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c13ab43f44a5f1ac9c9fa6a902147c507e7d1b4","infoHashBuffer":{"type":"Buffer","data":[44,19,171,67,244,74,95,26,201,201,250,106,144,33,71,197,7,231,209,180]},"announce":[],"urlList":[]}}