{"title":"MYTH - The worst movie ever made","uid":8429350,"size":1213633078,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2dc4fc23e7e60e8b69de84b19601be3bbe4fee92&amp;dn=MYTH+-+The+worst+movie+ever+made&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SGH2","files":1,"time":1367443401,"description":"I received a copy of this at some convention from a very strange man with golden long hair. A few days later I popped it in the dvd player and low and behold the worst movie I had ever seen... A horrible tale of Dragons and Faggotry. I think the world needs to see this and use it as a template of what to avoid when making a film.\n\nA film by Aeyron Moore.\n\n----------------------------------------------\nFrom the rear cover: \n\nA Mythical Tale of Dragons and Kings.  In a land of old, Mythendel had suffered the loss of a great king.  Fearing the fall of this great Kingdom, Morok (Bill Morehead) sends the aid of Five Dragoon Knights led by Kane (Danial Blake) to help protect and rebuild the war devistated (sic) kingdom.  The old king, Sungandag of Mythendel, However had adopted a son.  Ganus (George Moore) Now sits upon the throne and plans to use the might of the Dragoon forces to make all kingdoms who betrayed mythendel payÎ“Ã‡Âª By Death.  He learns of how to change the essense (sic) of the Dragoon Spirits in order to create one of his own.  Azule (Aeyron Moore) once the heart of the Forest, now the heart of Fire, runs rampant through Mythendel on a war path.  Can Kane save his friend and salvage Mythendel before it is to (sic) late? Or will the great and powerful Mythendel fall to ashes due to Ganus's sick Humor\t","torrent":{"xt":"urn:btih:2dc4fc23e7e60e8b69de84b19601be3bbe4fee92","amp;dn":"MYTH+-+The+worst+movie+ever+made","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dc4fc23e7e60e8b69de84b19601be3bbe4fee92","infoHashBuffer":{"type":"Buffer","data":[45,196,252,35,231,230,14,139,105,222,132,177,150,1,190,59,190,79,238,146]},"announce":[],"urlList":[]}}