{"title":"Cameringo - Effects Camera v1.9.5 [Paid] [APK]","uid":10062998,"size":3418063,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2ed31593b0cd6b800d44a59ef62d2ffb3bae2957&amp;dn=Cameringo+-+Effects+Camera+v1.9.5+%5BPaid%5D+%5BAPK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AtomTPB","files":4,"time":1398761254,"description":"Description:\nA camera to give you back the pleasure of shooting beautiful photos.\nWith a simple yet stylishly powerful interface, this photographic camera app includes a large variety of live photo filters in lightning-fast real-time, such as several Lomo and Lo-Fi effects, artistic painting, cartoon and paper styles, vintage, retro, analog, several deformations types, including even fish-eye, wide angle camera filters, and many more... in total over 100 camera photo effects, and more than 20 Borders/Frames.\nLomography, Analogic and Hipster photography lovers will be pleased with the emulated effects of some classic cameras such as Holga, Zenit, Lomo LC-A, and even an awesome Super-8 style.\nRecord easily GIF animations with all the available effects..You can also change the GIF recording speed to produce funny GIF animations.\nWith the unique Cameringo viewfinder, now you can keep shooting while in photo review mode, allowing comparison of the last photo taken against the live image. Plus, the horizon level indicator gives you now better control over the angle of the photo.\nGet now mad-face shots with the unique Virtual Flash for Front-Facing Cameras. The idea is very simple, in complete darkness the screen will light up enough to give you the chance to snap your grin. Not all effects are suitable for this, so try it first with &quot;original&quot;.\nOther included features are a clever image stabilizer, silent camera mode, histogram, Geo Tagging (GPS Location), guidelines, tap to shoot, macro-focus, and even the option to shoot perfectly squared photos making it easier to upload into Instagram.\nA new effects photo-camera app for everyone's taste at your fingertips.\n\n\n\nWhat's New:\n-Moved 'Silent Mode' setting to the configuration panel.\n-New live histogram (touch to swap Luminance / RGB modes)\n-New effects pack &quot;FAUX&quot;, with 7 new effects.\n-Also new effects in existing packs:\nMONO: hdr-pro, sharp\nPOP: retro-pop\nSPKTRO: disco\nMORFO: goblin\nMASH: colacut\n\n\nRequired Android O/S : 2.2+\n\n","torrent":{"xt":"urn:btih:2ed31593b0cd6b800d44a59ef62d2ffb3bae2957","amp;dn":"Cameringo+-+Effects+Camera+v1.9.5+%5BPaid%5D+%5BAPK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ed31593b0cd6b800d44a59ef62d2ffb3bae2957","infoHashBuffer":{"type":"Buffer","data":[46,211,21,147,176,205,107,128,13,68,165,158,246,45,47,251,59,174,41,87]},"announce":[],"urlList":[]}}