{"title":"Night of the Demon 1957 BrRip Mp4 Lee1001","uid":9828591,"size":671207964,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2fbbffd64196ccf8165de3cefdf0de00285a4811&amp;dn=Night+of+the+Demon+1957+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xultfoad","files":1,"time":1395807823,"description":"Night of the Demon 1957 BrRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050766/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050766/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Night_of_the_Demon&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Night_of_the_Demon&lt;/a&gt;\nDr John Holden, an American psychologist specialising in the paranormal, arrives in England to attend a convention on the Occult. The man who was to have chaired the convention, Professor Harrington, has recently died in a tragic accident and his niece, Joanna, is convinced that Dr Julian Karswell, the leader of a Satanic cult, was implicated in his death. Holden is visited by Dr Karswell, an amiable yet sinister man, who warns him that he will die in three days unless he drops his investigation. Convinced that Karswell is a charlatan, the American joins forces with Joanna to uncover the truth of Harrington's death - and finds far more than he bargained for... \n\nNight of the Demon deserves its reputation as one of the greatest British horror films, not just because it is one of the best crafted examples of its genre, but also because it is a genuinely frightening film, one that still manages to send a shiver down the spine. Atmospheric lighting and noir-style camerawork create a palpable aura of menace that gradually builds to a terrifying climax, making this a point of reference, if not the template, for all subsequent supernatural thrillers. You have only to look at Hammer's The Devil Rides Out (1968) and Roman Polanski's The Ninth Gate (1999), amongst others, to see the influence this film has had on the genre. \n\nThe film is based on M.R. James's story Casting the Runes, adapted by Charles Bennett who had previously scripted several of Alfred Hitchcock British films, including: Blackmail (1929) and The 39 Steps (1935). It was directed by Jacques Tourneur, who had made several notable horror films during his period in Hollywood, including the classic Cat People (1942) and I Walked with a Zombie (1943). Like his father, Maurice (a distinguished French filmmaker), Jacques Tourneur was greatly influenced by the work of the German expressionists and understood how lighting and camera angles could be used to build tension and bring a sense of hidden menace, something that he put to good use in his horror films and noir thrillers.\n\nThe main character in the film is played by Dana Andrews, an actor who is best known for his portrayal of the hard-bitten hero in many a classic film noir. With his apparently humourless demeanour, Andrews is the perfect casting choice for the part of the diehard sceptic who refuses to believe in the supernatural, even when it is breathing down his neck. Niall MacGinnis is equally impressive as Dr Karswell, a sinister Pinteresque character who combines an inoffensive charm with a chilling touch of the Mephistophelian. Amusingly, we are most aware of the demonic power of Karswell when he is made-up as a clown at a children's party - illustrating the vein of dark humour that runs through this film. \n\nThe only disappointment is the botched appearance of the titular demon at the beginning and end of the story. Even if the demon had been well-realised, its physical manifestation would have been a mistake, since it removes the element of ambiguity which the film plays on throughout. This is what Tourneur believed but his producer Hal E. Chester had other ideas and insisted that the demon be revealed to the audience. Hence the risible puppet Devil - which would have a job frightening a timorous five-year old. Thankfully, this B-movie abomination appears in only a few brief shots and it doesn't get to ruin what is otherwise a diabolically good horror film.\n\nIt's a movie that many people remember with affection and respect from their childhoods -- because it scared the crap out of them.\n\nVIDEO\nSize.... 640mb\nDuration.... 01:35:51\nCodec.... h264\nFrame Width..... 720\nFrame Height.... 432\nData Rate.... 807kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 120kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:2fbbffd64196ccf8165de3cefdf0de00285a4811","amp;dn":"Night+of+the+Demon+1957+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fbbffd64196ccf8165de3cefdf0de00285a4811","infoHashBuffer":{"type":"Buffer","data":[47,187,255,214,65,150,204,248,22,93,227,206,253,240,222,0,40,90,72,17]},"announce":[],"urlList":[]}}