{"title":"Alfred Hitchcock's Rebecca (Criterion) DVD-R R1 MTSC SteelerJ17","uid":8432349,"size":4681734144,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:310f038abd7c6877c1e613d071f3009af0eed19a&amp;dn=Alfred+Hitchcock%27s+Rebecca+%28Criterion%29+DVD-R+R1+MTSC+SteelerJ17&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SteelerJ17","files":-1,"time":1367529920,"description":"Alfred Hitchcock's Rebecca (Criterion) DVD-R R1 NTSC SteelerJ17\n\nThis is a iso file. You can easily burn it through using Nero or IMGBurn\n\nRunning Time 2hrs 10mins      Rated-NR\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0032976/?ref_=sr_4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0032976/?ref_=sr_4&lt;/a&gt;\n\n*Note (This is currently out of print on Criterion)\n\nRebecca's haunting opening line conjures the entirety of Hitchcock's romantic, suspenseful, elegant film. A young woman (Joan Fontaine) believes her every dream has come true when her whirlwind romance with the dashing Maxim de Winter (Sire Laurence Olivier) culminates in marriage. But she soon realizes that Rebecca, the late first Mrs. de Winter, haunts both the temperamental, brooding Maxim and the de Winter mansion, Manderley. In order for Maxim and the new Mrs. de Winter to have a future, Rebecca's spell must be broken and the mystery of her violent dead unraveled. The first collaboration between producer David O. Selznick and Hitchcock, Rebecca was adapted from Daphne du Maurier's popular novel and won the 1940 Academy AwardÂ®? for Best Picture and Cinematography (Black and White).\n\nMenus-Yes\nExtras-Yes\n\nSpecial Features including\nCommentary by Film Scholar Leonard J. Leff, author of Hitchcock and Selznick\nIsolated Music and Effects Track\n\nLet's get this SEEDED people!! Remember it's nice to share. Don't Be A Hit and Run!! (Note: I will seed for 1 week only!!!!)\n\nBookmark me as your favorites! You'll never know what I will upload!!\n\nPlease NO REQUESTS!!!! It's gets too overwhelming for me. I'm only going to upload movies that I think people will like. \n\nPlease enjoy and SEED your TORRENTS!! Seed IT!!\t","torrent":{"xt":"urn:btih:310f038abd7c6877c1e613d071f3009af0eed19a","amp;dn":"Alfred+Hitchcock%27s+Rebecca+%28Criterion%29+DVD-R+R1+MTSC+SteelerJ17","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"310f038abd7c6877c1e613d071f3009af0eed19a","infoHashBuffer":{"type":"Buffer","data":[49,15,3,138,189,124,104,119,193,230,19,208,113,243,0,154,240,238,209,154]},"announce":[],"urlList":[]}}