{"title":"Arrow- 1-28","uid":8432695,"size":539694245,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:31ca705d844e09196e73b1d89cc4e25384ccaca1&amp;dn=Arrow-+1-28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"miloman09","files":28,"time":1367538676,"description":"The series follows Oliver Queen, billionaire playboy of Starling City, who spends five years stranded on an island following a shipwreck that claims the life of everyone else on board, including his father, Robert Queen, and Sara Lance, the sister of Oliver's girlfriend Laurel. Upon his return to Starling City, he is reunited with his mother, Moira, and her new husband, Walter, the former CFO of his father's company who is now the CEO. He is also greeted by his younger sister, Thea, and his best friend, Tommy Merlyn, the son of successful businessman Malcolm Merlyn. Oliver also tries to reconnect with ex-girlfriend Laurel, but she blames him for the death of her sister, Sara, as Oliver and Sara were having an affair at the time of the accident.During the day, Oliver plays the billionaire playboy; at night, he becomes a green-hooded vigilante, following through with his father's dying wishes to right the wrongs of the Queen family, fight the ills of society, and restore Starling City to its former glory. Oliver's vigilante persona becomes the focus of police detective Quentin Lance, father to Laurel and Sara, who is determined to arrest the vigilante and also blames Oliver for his daughter's death and his wife leaving him, though he remains unaware of his dual identity. Oliver is constantly flanked by a bodyguard, John Diggle, who later joins him in his fight for justice. Moira is also hiding secrets: she knows that the family yacht was actually sabotaged. DC Comics debuted a weekly digital comic tie-in. DO NOT READ UNLESS WATCHING TELEVISION SERIES","torrent":{"xt":"urn:btih:31ca705d844e09196e73b1d89cc4e25384ccaca1","amp;dn":"Arrow-+1-28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ca705d844e09196e73b1d89cc4e25384ccaca1","infoHashBuffer":{"type":"Buffer","data":[49,202,112,93,132,78,9,25,110,115,177,216,156,196,226,83,132,204,172,161]},"announce":[],"urlList":[]}}