{"title":"Constant Rolling Studio","uid":9744743,"size":3372220463,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:3784df6d8daed7de502aa7105b4c11d902087163&amp;dn=Constant+Rolling+Studio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ARTM1993","files":-1,"time":1394567830,"description":"This Linux Distro Is Based On Debian Sid And Is For Multimedia Professionals and Linux Hobbyists who want a constantly up to date and install once and get to work distro.\n\nREADME\n\nCRS 2014.0 Production Version This is an audio distro based on debian sid Features 2014.0 1. Kernel 3.13 generic and an RT PREEMPT 3.10.27 Kernel that is on the livecd for your convience. 2. New whisker menu added. 3. Carla-git installed (internal fluidsynth plugin not working so use calf fluidsynth instead when using carla PLEASE!) 4. It's Sid so remember to be a bit careful, but if you stick to the default packages you should be fine. 5. Added mesa 10.1rc2 from experimental for Intel users, specifically for those on Haswell. 6. Replaced NetworkManager with Ceni as it causes less xruns with any kernel plus it ACTUALLY doesn't try to reconnect to the network when on idle, again less xruns. 7. SAMBA Fix had to custom patch it so let me know if this breaks. You can find me in the #linuxdistrocommunity channel on FreeNode irc from time to time for support. Join The DISCUSSION Forum on sourceforge as well if you need help. \n\n","torrent":{"xt":"urn:btih:3784df6d8daed7de502aa7105b4c11d902087163","amp;dn":"Constant+Rolling+Studio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3784df6d8daed7de502aa7105b4c11d902087163","infoHashBuffer":{"type":"Buffer","data":[55,132,223,109,141,174,215,222,80,42,167,16,91,76,17,217,2,8,113,99]},"announce":[],"urlList":[]}}