{"title":"The Big Blue (1988) US","uid":9686701,"size":2189455365,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:44a563d10bb67e76ac51618d8a7ba325889aaba0&amp;dn=The+Big+Blue+%281988%29+US&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Blu.Berry","files":1,"time":1393780448,"description":"Two men answer the call of the ocean in this romantic fantasy-adventure. Jacques (Jean-Marc Barr) and Enzo (Jean Reno) are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that  his vital signs more closely resemble that of dolphins than men (he even considers a school of dolphins as his extended family). As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johanna (Rosanna Arquette), a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea. Le Grand Bleu ran 132 minutes in its original French version, but it was trimmed to 118 for American release, with the original score by Eric Serra replaced by music from Bill Conti.\n\nThis is the US version with the Bill Conti score. Taken from a Laserdisc release.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095250/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095250/&lt;/a&gt;","torrent":{"xt":"urn:btih:44a563d10bb67e76ac51618d8a7ba325889aaba0","amp;dn":"The+Big+Blue+%281988%29+US","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a563d10bb67e76ac51618d8a7ba325889aaba0","infoHashBuffer":{"type":"Buffer","data":[68,165,99,209,11,182,126,118,172,81,97,141,138,123,163,37,136,154,171,160]},"announce":[],"urlList":[]}}