{"title":"Barney Sloane - The Black Death in London [2011][A]","uid":9951216,"size":4805871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45b345246f0d08870b72073a88b178dc313cdd0d&amp;dn=Barney+Sloane+-+The+Black+Death+in+London+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anette14","files":-1,"time":1397404431,"description":"Description\nProduct details\nBook Title: The Black Death in London\t\nBook Author: Barney Sloane\nPaperback: 224 pages\nPublisher: The History Press (1 July 2011)\nLanguage: English\nISBN-10: 0752428292\nISBN-13: 978-0752428291\n\nProduct Description\nThe Black Death of 1348-49 may have killed more than 50% of the European population. This book examines the impact of this appalling disaster on England's most populous city, London. Using previously untapped documentary sources alongside archaeological evidence, a remarkably detailed picture emerges of the arrival, duration and public response to this epidemic and subsequent fourteenth-century outbreaks. Wills and civic and royal administration documents provide clear evidence of the speed and severity of the plague, of how their victims, many named, made preparations for their heirs and familes, and of the immediate social changes that the aftermath brought. The traditional story of the timing and arrival of the plague is challenged and the mortality rate is revised up to 50-60% in the first outbreak, with a population decline of 40-45% across Edward III's reign. Overall, The Black Death in London provides as detailed a story as it is possible to tell of the impact of the plague on a major medieval English city.\n\nAbout the Author\nBarney Sloane was a field archaeologist for the Museum of London and is now in charge of research grants at English Heritage. He is a Fellow of the Society of Antiquaries, an Honorary Research Fellow at the University of Reading and a member of the councils of the British Archaeological Associatin and the London &amp; Middlesex Archaeological Society.\n","torrent":{"xt":"urn:btih:45b345246f0d08870b72073a88b178dc313cdd0d","amp;dn":"Barney+Sloane+-+The+Black+Death+in+London+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45b345246f0d08870b72073a88b178dc313cdd0d","infoHashBuffer":{"type":"Buffer","data":[69,179,69,36,111,13,8,135,11,114,7,58,136,177,120,220,49,60,221,13]},"announce":[],"urlList":[]}}