{"title":"Bruckner Symphony no. 8 Maazel Berliner Philharmoniker  1990","uid":9830653,"size":317717252,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:479f056f88e72b2403840ff906d7189c91b03416&amp;dn=Bruckner+Symphony+no.+8+Maazel+Berliner+Philharmoniker++1990&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"magneez","files":7,"time":1395834843,"description":"FLAC + CUE\n\nrandom review from amazon:\n\n5.0 out of 5 stars Maazel wows the Cosmos February 12, 2011\n\nMake no mistake: this performance from the late 1980s is stunning (the current Berlin Phil shares the same name with this ensemble and that's about it) and the recording is equally superlative. Maazel is clear-headed from the first bar: he has mapped out where he wants to take us, step by step, and the journey that follows is shaped accordingly. Even in the fire and ice of the first movement, there is a deep-set sense of repose. The Scherzo pulsates with cosmic energy. The slow movement is as transfixing as the Horsehead Nebula. Pellucidly, the final coda is 'greater than stars or suns'. It may not be the most metaphysical account in existence - perhaps - but it still works thrillingly in its own right.\n\nAn obvious comparision comes to mind: Barenboim's Eighth with the same orchestra. Whereas Danny lurches from one climax to the other and his troops are mostly 'breathless' (how much rehearsal time were they allocated?) Maazel unerringly conceives and delivers a great Bruckner 8 - whack.\n\nIs this best ten buck investment in the world?\n\nBTW, EMI is indictable for the obscurity that has afflicted this recording since 1988. Firstly, they issued it in an uncompetitive double-CD set when it clearly could have been contained on a single CD. Then, they callously downgraded it to the Red Line series, the EMI graveyard for their so-called B grade recordings. It deserves a better fate.","torrent":{"xt":"urn:btih:479f056f88e72b2403840ff906d7189c91b03416","amp;dn":"Bruckner+Symphony+no.+8+Maazel+Berliner+Philharmoniker++1990","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"479f056f88e72b2403840ff906d7189c91b03416","infoHashBuffer":{"type":"Buffer","data":[71,159,5,111,136,231,43,36,3,132,15,249,6,215,24,156,145,176,52,22]},"announce":[],"urlList":[]}}