{"title":"College.Rules.15.XXX.DVDRip.x264-XCiTE","uid":9836638,"size":2521377426,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5334bb797584441006cd434f10e27c8be53215bf&amp;dn=College.Rules.15.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":6,"time":1395928010,"description":"&quot;Who Can Make The Best Sex Tape? - This week is a competition between two teams to see who can make the best sex video! These two slutty teams go at it with different strategies: The first is an all-out orgy and the second is a lesbian lick fest followed by some one on one fucking. These college kids are crazy, down to fuck and do whatever it takes to win a bit of money!\n\n&quot;Studying Sex - Sex and Humanity. I should have taken that class, because it looks fun as shit! These two girls are studying the effects of porn on their fellow college students. They ask them a bunch of questions and then see if they are down to fuck, get their dicks sucked and perform sexual acts on camera! I wish I went to this college! These slutty girls seem down for whatever, trying new positions and talking about what they like and don't like during sex. A+!\n\n&quot;Truth or FUCK - This house party is about to get crazy with some truth or dare! There are some hot girls and horny dudes having a good time and it gets a whole lot better when truth or dare turns into a fuck fest. A sexy blonde gets double teamed while a red head with nice tits rides the cock and her friend fucks and takes a nice facial. College Rules!\n\n&quot;Horny Girls and Horny Guys - Some sexy girls and some horny guys dare each other to strip down and show off their asses and pussies. One girl with a phat ass and great tits gets a dildo in her pussy until she cums, and then one lucky guy gets his dick sucked by two girls in the closet. This last slutty girl gets double teamed by two hard college dicks and loves every second of it before she gets a load all over her face! Gotta love it!&quot;\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=96654412715807139015.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=96654412715807139015.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=45895408132409958173.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=45895408132409958173.jpeg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5334bb797584441006cd434f10e27c8be53215bf","amp;dn":"College.Rules.15.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5334bb797584441006cd434f10e27c8be53215bf","infoHashBuffer":{"type":"Buffer","data":[83,52,187,121,117,132,68,16,6,205,67,79,16,226,124,139,229,50,21,191]},"announce":[],"urlList":[]}}