{"title":"Britney Spears Femme Fatale (Deluxe CD Rip)","uid":9690438,"size":134563432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:533ecbdba5ae1bf1e4006ff7d71eb4e3c390cd62&amp;dn=Britney+Spears+Femme+Fatale+%28Deluxe+CD+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MusicFanatic98","files":-1,"time":1393851673,"description":"Femme Fatale is the seventh studio album by American recording artist Britney Spears. It was released on March 25, 2011, by Jive Records. Spears wanted to make a &quot;fresh-sounding&quot; and &quot;fierce dance album&quot;, incorporating pop and dance styles with elements of dubstep, techno, and trance. She began working on the album during the second leg of The Circus Starring Britney Spears (2009), while also working on her second compilation The Singles Collection (2009). Contributions to its production came from a variety of producers and songwriters, including long-time collaborator Max Martin in addition to Dr. Luke, William Orbit, Fraser T Smith, Rodney Jerkins, Bloodshy &amp; Avant. will.i.am, and StarGate. Four singles were released from the album. It became Spears's first album to have three top 10 singles on the U.S. Billboard Hot 100, with &quot;Hold It Against Me&quot;, &quot;Till the World Ends&quot;, and &quot;I Wanna Go&quot; peaking at numbers one, three, and seven, respectively. The fourth and final single &quot;Criminal&quot; peaked at number one in Brazil and in the top twenty in five countries. Spears promoted the album with television performances, the Femme Fatale Tour,[1] and collaborations with Kesha, Nicki Minaj, Travis Barker, and Rihanna. The album sold around 2.4 million copies worldwide.","torrent":{"xt":"urn:btih:533ecbdba5ae1bf1e4006ff7d71eb4e3c390cd62","amp;dn":"Britney+Spears+Femme+Fatale+%28Deluxe+CD+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"533ecbdba5ae1bf1e4006ff7d71eb4e3c390cd62","infoHashBuffer":{"type":"Buffer","data":[83,62,203,219,165,174,27,241,228,0,111,247,215,30,180,227,195,144,205,98]},"announce":[],"urlList":[]}}