{"title":"Successful School Change and Transition for the Child with Asper","uid":8423566,"size":729749,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55de1aecebb7ed8dc9006c9d72f29c73a05dd5a3&amp;dn=Successful+School+Change+and+Transition+for+the+Child+with+Asper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ariane_c","files":1,"time":1367272264,"description":"Overview\n\nMoving to a new school can be a daunting prospect for the child with Asperger syndrome, and parents are often left feeling powerless to help prevent the anxiety and loss of confidence which may ensue.\n\nClare Lawrence's new book provides parents of children with AS with practical advice on how to prepare their child for moving to a new school, and how to help make the transition as smooth as possible. A wide range of material is covered, including useful guidance on choosing the right school, supporting the child during the period prior to the move, and identifying and practising the different 'social rules' and expectations of the new school. Strategies covered by the book include working out a transition time-line, identifying a named adult and 'safe haven' at the school, and promoting effective communication between parents, teachers and support staff.\n\nThis clear and accessible book will be an invaluable resource for parents of children with AS who are moving to a new school, and will also be of interest to the teachers and education professionals who work with them.\n\nAbout the Author\nClare Lawrence is a teacher, autism worker, school governor and mother of two children, one of whom has Asperger syndrome. A graduate of Oxford, York, Northumbria, Sheffield Hallam and Birmingham universities, Clare holds a university certificate in autistic spectrum disorders and a post-graduate certificate in Asperger syndrome. For the last six years, she has been working closely with schools and exploring practical solutions on how to make education more accessible for children with Asperger syndrome. Clare is the author of How to Make School Make Sense, also published by Jessica Kingsley Publishers. ","torrent":{"xt":"urn:btih:55de1aecebb7ed8dc9006c9d72f29c73a05dd5a3","amp;dn":"Successful+School+Change+and+Transition+for+the+Child+with+Asper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55de1aecebb7ed8dc9006c9d72f29c73a05dd5a3","infoHashBuffer":{"type":"Buffer","data":[85,222,26,236,235,183,237,141,201,0,108,157,114,242,156,115,160,93,213,163]},"announce":[],"urlList":[]}}