{"title":"The Incredible Shrinking Man 1957 BrRip Avi Lee1001","uid":9825960,"size":3117286732,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:63bfef96bc4da7725c16e98b943f25c4fcf90586&amp;dn=The+Incredible+Shrinking+Man+1957+BrRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"xultfoad","files":2,"time":1395777759,"description":"The Incredible Shrinking Man 1957 BrRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050539/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050539/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Incredible_Shrinking_Man&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Incredible_Shrinking_Man&lt;/a&gt;\nNot merely the best of Arnold's classic sci-fi movies of the '50s, but one of the finest films ever made in that genre. It's a simple enough story: after being contaminated by what may or may not be nuclear waste, Williams finds himself slowly but steadily shedding the pounds and inches until he reaches truly minuscule proportions. But it is what Richard Matheson's script (adapted from his own novel) does with this basic material that makes the film so gripping and intelligent. \n\nAt first, Williams is merely worried about his mysterious illness, but soon, towered over by his wife, he begins to feel humiliated, expressing his shame and impotence through cruel anger. And then his entire relationship with the universe changes, with cats, spiders and drops of water representing lethal threats in the surreal and endless landscape that is, in fact, his house's cellar. And finally, to the strains of Joseph Gershenson's impressive score, we arrive at the film's philosophical core: a moving, strangely pantheist assertion of what it really means to be alive. A pulp masterpiece. \n\nWhen Grant Williams is subjected to a radioactive mist while on holiday with his wife, he falls ill and then starts to shrink. It's a simple premise, but the result is a masterpiece of the science-fiction genre that plays to the human emotion of the situation rather than overwhelming the audience with special effects. First his wife begins to order him around, then, as he gets inexorably smaller, the household cat becomes a savage predator, a splash of water threatens to destroy him and he fights to the death against a spider before advancing to the next stage in his strange and lonely existence. \n\nDirector Arnold came to science fiction from a background of documentary-making (he later moved again, to comedies), and his sparse direction allows the tension to build naturally so that the terror and poignancy of the story work their way into the audience's brain without being forced.\n\nVIDEO\nSize.... 2.90gb\nDuration.... 01:20:50\nCodec.... divx\nFrame Width..... 1280\nFrame Height.... 690\nData Rate.... 5013kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 128kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:63bfef96bc4da7725c16e98b943f25c4fcf90586","amp;dn":"The+Incredible+Shrinking+Man+1957+BrRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63bfef96bc4da7725c16e98b943f25c4fcf90586","infoHashBuffer":{"type":"Buffer","data":[99,191,239,150,188,77,167,114,92,22,233,139,148,63,37,196,252,249,5,134]},"announce":[],"urlList":[]}}