{"title":"Cavale aka On The Run 2002 DVDRip Sonata Premiere","uid":8420550,"size":733855433,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6486f9bdd7b26a3cbd2fd63e7d4abc7fef6966c6&amp;dn=Cavale+aka+On+The+Run+2002+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"klinho","files":4,"time":1367176181,"description":"Inspired by Lawrence Durrell's collection of interrelated novels, The Alexandria Quartet, Lucas Belvaux's trilogy--the violent noir On the Run, the romantic comedy An Amazing Couple, and the melodrama After the Life, examine many of the same characters from three distinct perspectives. In On the Run, taciturn leftist revolutionary Bruno (Belvaux) escapes from prison with the help of one of his former comrades. When his partner is killed by the police, Bruno tracks down another former member of his gang, Jeanne (Catherine Frot), who is now living a quiet, respectable life as a schoolteacher, with a husband and a young son. Bruno is determined to get revenge on the powerful man who betrayed his revolution. Jeanne doesn't want to live in the past. She offers Bruno enough help to get rid of him. Trying to trap his prey, Bruno follows a drug dealer who works for the man. He meets Agnes (Dominique Blanc), a junkie who happens to be the wife of the cop, Pascal (Gilbert Melki) who's hunting Bruno. Bruno ends up helping Agnes avoid the police and cop a fix. In return, she takes him to the vacation home of her co-worker, Cecile (Ornella Muti), where he hides out. But when his plans for revenge go horribly awry, Bruno turns to Jeanne again, and she has to weigh her family's safety against her allegiance to her old friend. While On the Run focuses on Bruno and Jeanne, An Amazing Couple is centered on the paranoid Cecile, who hires Pascal to watch her husband, while After the Life deals with the damaged marriage of Agnes and Pascal. The trilogy was shown at the 2003 Tribeca Film Festival.\n\n\nSubs srt: Portuguese / English / Spanish","torrent":{"xt":"urn:btih:6486f9bdd7b26a3cbd2fd63e7d4abc7fef6966c6","amp;dn":"Cavale+aka+On+The+Run+2002+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6486f9bdd7b26a3cbd2fd63e7d4abc7fef6966c6","infoHashBuffer":{"type":"Buffer","data":[100,134,249,189,215,178,106,60,189,47,214,62,125,74,188,127,239,105,102,198]},"announce":[],"urlList":[]}}