{"title":"The Seven-Ups 1973 BrRip Mp4 Lee1001","uid":9959523,"size":2607612788,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:64ea68561038a556c22bdd8aea91f217152f908f&amp;dn=The+Seven-Ups+1973+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xultfoad","files":2,"time":1397501572,"description":"The Seven-Ups 1973 BrRip Mp4 Lee1001\n[img]http://www.freeimage.us/image-B07A_534AEFC5.jpg[/img]\n[url]http://www.imdb.com/title/tt0070672/[/url]\n[url]https://en.wikipedia.org/wiki/The_Seven-Ups[/url]\nSeemingly one of the lost movies of the 1970s, The Seven-Ups is a diverting low-key follow-up to the French Connection films whose car chase alone ought to seal near-classic status.\n[img]http://imagizer.imageshack.us/v2/1024x768q90/59/yu4c.jpg[/img]\nYou don't need a huge body of work to ensure your place in the movie pantheon. Producer Philip D'Antoni has barely 10 pictures to his name, and since these include made-for-TV disappointments like Shark Kill and Strike Force, you'd half expect him to reside in the &quot;who cares where they are now?&quot; file. However, in amongst the alsorans, the native New Yorker found time to bankroll Bullitt and The French Connection. Make two films like that and you can guarantee people will be talking about you until movies stop being shown. \n[img]http://www.freeimage.us/image-FA97_534B8EAC.jpg[/img]\nNot content with producing ace cop movies, D'Antoni went behind the camera to make superior police action-drama The Seven-Ups. Like his earlier films, this Roy Scheider vehicle would feature one of cinema's great car chases. But there's more to The Seven-Ups than a man trying to cap previous stunt sequences. With a strong storyline and a cracking performance from its criminally underrated leading man, it's a movie that leaves you disappointed D'Antoni never directed another film. All of which said, when the chase arrives, the sight of Scheider speeding through the New York rush hour will have you hyperventilating like an agoraphobic in the Attacama. The involvement of D'Antoni, Scheider and co-star Tony Lo Bianco ensured The Seven-Ups would be held up alongside The French Connection. \n[img]http://www.freeimage.us/image-4B65_534B8EAC.jpg[/img]\nNo doubt aware critics would draw such comparisons, the director - surprisingly but sensibly - did nothing to further distance the two pictures. Rather, by hiring the same DP and composer and by enlisting the help of Sonny Grosso (the ex-cop who inspired the Scheider character in Connection), D'Antoni made sure his film had the same semi-documentary grittiness that made William Friedkin's drama so compelling. If it has edge, The Seven-Ups lacks the scope and originality that made The French Connection a bona fide masterpiece. Still, you couldn't hope for a more entertaining companion piece. And if you're looking to celebrate the life of Roy Scheider - as much the face of 1970s American cinema as De Niro and Pacino - this unpolished gem is a great place to start.\n[img]http://www.freeimage.us/image-32C2_534B8EAC.jpg[/img]\nProducer Philip D'Antoni gave crime pix a big shot in the arm with 1968's Bullitt, a detective-vs-the-mob story that pared dialogue to a minimum, gave Steve McQueen a definitive role and upped the ante for the violent car chase as a spectator sport. The French Connection is a distinctive William Friedkin picture but it stayed close to the D'Antoni formula, with a major car chase opening up the third act. The Seven-Ups may be the lesser cinematic achievement of the three films but it is possibly the best of the crime action flicks of the early 1970's -- it's a consistently convincing, gritty little drama, and its central car chase may be the best of all for simple credibility.\n[img]http://www.freeimage.us/image-3EA6_534B8EAC.jpg[/img] \nRichard Hugh Lynch,was found dead on 19 June 2012 on the kitchen floor of his Yucca Valley, California, home by his friend, actress Carol Vogel,who had gone to check up on him after not hearing from him for a few days. He was 76 years of age.\nIn 1967 he had an accident in Central Park, setting himself on fire in the middle of an LSD trip. After massive reconstructive surgery he eventually rebuilt enough confidence to return to acting. His height and distinctive scarred appearance made him ideal casting for villains in sci-fi, fantasy and horror films, and he became a favourite character actor among cult film fans.\n\nVIDEO\nSize.... 2.42gb\nDuration.... 01:43:17\nCodec.... h264\nFrame Width..... 1280\nFrame Height.... 690\nData Rate.... 3112kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 246kbps\n1 Channel mono\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:64ea68561038a556c22bdd8aea91f217152f908f","amp;dn":"The+Seven-Ups+1973+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64ea68561038a556c22bdd8aea91f217152f908f","infoHashBuffer":{"type":"Buffer","data":[100,234,104,86,16,56,165,86,194,43,221,138,234,145,242,23,21,47,144,143]},"announce":[],"urlList":[]}}