{"title":"Fort Bowie 1958 DvdRip Mp4 Lee1001","uid":10029782,"size":733581331,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6752f989a1b03ae1dbccf00a566792e9bf26469e&amp;dn=Fort+Bowie+1958+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xultfoad","files":2,"time":1398318755,"description":"Fort Bowie 1958 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0051627/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0051627/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.rottentomatoes.com/m/fort_bowie/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rottentomatoes.com/m/fort_bowie/&lt;/a&gt;\nFort Bowie is an American western first released on 1st February 1958, directed by Howard W. Koch. The film stars Ben Johnson, Jan Harrison, Kent Taylor, Maureen Hingert and Peter Mamakos. \n\nThere's a measure of sympathy for the Apaches at the beginning of Fort Bowie. Under the tyrannical rule of ambitious Major Wharton, a cavalry detachment slaughters a band of Apache who've arrived with the intention of surrendering. A counterattack is inevitable, but before this happens the story is sidetracked by the jealous behavior of Colonel Garrett. When stalwart young Captain Thompson resists the romantic overtures of Garrett's wife Allison, she screams &quot;Rape!&quot; and Thompson finds himself facing court-martial and execution. This plot strand and several others are resolved after the Cavalry is forced to attack its own fort following an Apache takeover.\n\ndougdoepke from Claremont, USA 26 January 2011\nAt a cavalry outpost, the colonel (Taylor) dispatches a captain (Johnson) on a suicide mission among the Apaches because of rivalry over his wife's (Harrison) affections.\n\nThe colonel loves wife Allison, but she loves the captain, I think. And, the captain loves her, at least some of the time. However, the rest of the time, he loves Chanzana, but Chanzana is half Apache, and I think she loves Apache leader Victorio. Oh well, I may be wrong about all this, but then the script can't seem to make up its mind either. So maybe you can sort it out.\n\nGood thing there's lots of action to interrupt this frontier soap opera. In fact I don't know when I've heard more shooting. Seems like somebody's always wiping out somebody else. Boy, was I surprised when the major shoots all the Indians carrying that white flag of truce. Pretty rotten thing for our guys to do, which sets off all the shooting because now the Apaches want revenge.\n\nBut then it seems like the Indians like roasting our guys over an upside-down spit. That's pretty rotten too and not in any multi-cultural handbook I know of. Then too, that part reminds me of another good Apache movie, Ulzana's Raid (1971), where the Apaches also practice some strange culinary arts. Even stranger, however, is when the Indians defend the fort against attacking cavalry (I love that wagon-ramp trick). Now where has any Western fan seen that upside-down world before.\n\nAnyway, it's an okay Western with some interesting sidelights and the great Ben Johnson. I'm just wondering why they went all the way to scenic Kanab, Utah to film, and then didn't didn't do it in Technicolor. Then again, maybe they spent their budget on all the big shoot- outs. But-- bottom line-- if you can untangle the big who-loves-whom puzzle in this movie, I'm sure there's a place for you at People magazine. Otherwise, you might want to catch up with this cowboys-and-Indians on an especially slow night.\n\nVIDEO\nSize.... 699mb\nDuration.... 01:21:08\nCodec....... AVC1\nFrame Width.... 720\nFrame Height.... 384\nData Rate.... 1070kbps\nFrame Rate.... 25F/S\nAUDIO\nBit Rate.... 127kbps\n2 Channel Stereo\nAudio Sample Rate.... 44KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:6752f989a1b03ae1dbccf00a566792e9bf26469e","amp;dn":"Fort+Bowie+1958+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6752f989a1b03ae1dbccf00a566792e9bf26469e","infoHashBuffer":{"type":"Buffer","data":[103,82,249,137,161,176,58,225,219,204,240,10,86,103,146,233,191,38,70,158]},"announce":[],"urlList":[]}}