{"title":"Singing from the Floor - A History of British Folk Clubs [EPUB]","uid":9880503,"size":1675541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69ee0124ada8d399982aa92c35b11e4125ada90e&amp;dn=Singing+from+the+Floor+-+A+History+of+British+Folk+Clubs+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AtomTPB","files":1,"time":1396540268,"description":"Paperback: 448 pages\nPublisher: Faber &amp; Faber Rock Music (March 6, 2014)\nLanguage: English\nISBN-10: 0571305458\nISBN-13: 978-0571305452\n\n\n\nIn smoky rooms above pubs, bare rooms with battered stools and beer-stained tables, where the stage was little more than a scrap of carpet and sound systems were unheard of, an acoustic revolution took place in Britain in the 1950s and '60s. This was the folk revival, where a generation of musicians, among much drink and raucous cheer, would rediscover the native songs of their own tradition, as well as the folk and blues coming from across the Atlantic by artists such as Leadbelly, Woody Guthrie and Big Bill Broonzy. Singing from the Floor is the story of this remarkable movement, faithfully captured in the voices of those who formed it by JP Bean. We hear from luminaries such as Shirley Collins, Martin Carthy, Peggy Seeger and Ralph McTell, alongside figures such as Billy Connolly, Jasper Carrott and Mike Harding, who all started their careers on the folk circuit. The book charts the revival's improvised beginnings and its ties to the CND movement, through the heyday of the '60s and '70s, when every university, town and many villages across the country boasted a folk club, to the fallow years of the '80s and '90s. The book finishes on a high note, with the recent resurgence of interest in folk, through such artists as the Lakemans, Sam Lee and Eliza Carthy. It is a joyous, boisterous and hugely entertaining book, and an essential document of our recent history stretching into the past.","torrent":{"xt":"urn:btih:69ee0124ada8d399982aa92c35b11e4125ada90e","amp;dn":"Singing+from+the+Floor+-+A+History+of+British+Folk+Clubs+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69ee0124ada8d399982aa92c35b11e4125ada90e","infoHashBuffer":{"type":"Buffer","data":[105,238,1,36,173,168,211,153,152,42,169,44,53,177,30,65,37,173,169,14]},"announce":[],"urlList":[]}}