{"title":"Deerhunter - Monomania (2013) [FLAC]","uid":8428512,"size":285453930,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7022e6ab21db21cc7d3197dc03aecb343ae3aabf&amp;dn=Deerhunter+-+Monomania+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":14,"time":1367424766,"description":"\n  Deerhunter - Monomania (2013) [FLAC]\n\n  Released: 2013\n  Duration: 43:18\n  Genre: Pop/Rock\n  Style: Indie Rock, Post-Rock, Dream Pop\n  Source: CD (log + cue)\n  Codec: FLAC \n  Bit Rate: ~ 850 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Neon Junkyard 02:53\n  02 Leather Jacket II 03:10\n  03 The Missing 03:42  \n  04 Pensacola 04:01\n  05 Dream Captain 03:02\n  06 Blue Agent 03:30\n  07 T.H.M. 04:20\n  08 Sleepwalking 03:09\n  09 Back To The Middle 02:38\n  10 Monomania 05:20\n  11 Nitebike 04:17\n  12 Punk (La Vie Anterieure) 03:28\n\n  Deerhunter is an experimental noise rock band from Atlanta, fronted by the compellingly odd singer Bradford Cox. Cox's vocal style blends vocal experimentation along the lines of Meredith Monk or Yoko Ono with a more direct and punky howl inspired by the Fall's Mark E. Smith. Cox is also a striking on-stage presence: the exceedingly skinny 6'4&quot; lead singer has Marfan syndrome, a genetic disorder of the connective tissue that gives him abnormally long and spindly limbs. (The late Joey Ramone was another well-known frontman with Marfan syndrome.) Cox often exaggerates his otherworldly look by performing in Victorian-style party frocks and engaging in Iggy Pop-style acts of ritual self-abasement while his bandmates churn out an aggressive mix of industrial-grind guitars and fractured dance rhythms that often recalls earlier Georgia art punks like the Method Actors and Pylon. Deerhunter was formed in 2001 by Cox and drummer and keyboardist Moses Archuleta; guitarists Colin Mee and Lockett Pundt and bassist Josh Fauver completed the lineup over the following years. \n\n  Deerhunter signed with the local Atlanta indie Stickfigure Records for their 2005 debut: nominally untitled, the album is also known as &quot;Turn It Up, Faggot&quot; (a phrase that doesn't appear on the sleeve), an insult that Cox claimed was often thrown at the band during their gigs. Deerhunter then signed to the higher-profile indie Kranky (Godspeed You Black Emperor!, etc.) for their second album, Cryptograms, as well as the EP Fluorescent Grey.Mee left Deerhunter and was replaced by former cheerleader Whitney Petty. The band recorded their third album Microcastle at New York City's Rare Book Room studio; the album was released digitally two months before it arrived on CD in fall 2008; like Fluorescent Grey, it found Brad Cox and company moving in a more pop-oriented direction. The band toured extensively on the indie festival circuit, but took a break in 2010 to record their fourth album, Halcyon Digest, in their homebase of Athens, GA.\n","torrent":{"xt":"urn:btih:7022e6ab21db21cc7d3197dc03aecb343ae3aabf","amp;dn":"Deerhunter+-+Monomania+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7022e6ab21db21cc7d3197dc03aecb343ae3aabf","infoHashBuffer":{"type":"Buffer","data":[112,34,230,171,33,219,33,204,125,49,151,220,3,174,203,52,58,227,170,191]},"announce":[],"urlList":[]}}