{"title":"Lovesliescrushing - Ghost Colored Halo (2013) [FLAC]","uid":8494994,"size":259190326,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:73f88346551d07d51652165be52a45830fadfd8d&amp;dn=Lovesliescrushing+-+Ghost+Colored+Halo+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"politux","files":-1,"time":1369113323,"description":"\n  Lovesliescrushing - Ghost Colored Halo (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Styles: Dream Pop, Ambient, Shoegaze, Drone\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 750 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Blemished Sunspot\n  02 The Tiger Hunts Alon\n  03 Darklit And Crow \n  04 The Wounds That Won't Heal\n  05 Whitening Glos \n  06 Ghost Colored\n  07 Blacklight Thundering Halo\n\n\n The duo known as Loveliescrushing first came together in the early '90s, when vocalist Melissa Arpin and multi-instrumentalist Scott Cortez decided to try their hand at the emerging dream pop scene. They began to send out demo tapes of their bizarre, heavily layered music to labels until Projekt finally contacted the band about releasing a single. 1994's Your Eyes Immaculate was the result, a single that so impressed the label that a year later they released the full-length Bloweyelashwish. The album was a mix of ethereal textures, wordless female vocals, and repetitive droning that set them apart from many of the label's gothic artists. Cortez would speak out loudly about how the music was all formed from guitar sounds, something that he was proud of if only because he was accused so much of using keyboards on the album. \n\n  The band was back the next year with Xuvetyn, another complicated album of lush sounds that moved the sound further in the direction of experimental music. But the band would drop off after promoting that album, working on a new studio album for years and years while still promising that they were together. They finally announced in 2001 that they were ready to edit and release the album, although the year went by without any news outside of that tidbit. The next year proved golden for fans: Arpin and Cortez remerged with a third album. Intricate and glossy, Glissceule was issued on Sonic Syrup in March 2002, followed by Voirshn towards the end of that year on Projeckt. The group took a break from recording for the much of the rest of the decade, but returned in full force with 2010's Avianium. (Microphona Magnetica), 2011's Aviatrix, and 2013's Ghost Colored Halo.","torrent":{"xt":"urn:btih:73f88346551d07d51652165be52a45830fadfd8d","amp;dn":"Lovesliescrushing+-+Ghost+Colored+Halo+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73f88346551d07d51652165be52a45830fadfd8d","infoHashBuffer":{"type":"Buffer","data":[115,248,131,70,85,29,7,213,22,82,22,91,229,42,69,131,15,173,253,141]},"announce":[],"urlList":[]}}