{"title":"WatchingMyMomGoBlack - Tia Gunn &amp; Angel Cakes - HD","uid":9819770,"size":1137651009,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:74fd7071b82af91535759f92e77d491248154ba9&amp;dn=WatchingMyMomGoBlack+-+Tia+Gunn+%26amp%3B+Angel+Cakes+-+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"HardFuck","files":1,"time":1395680727,"description":"WatchingMyMomGoBlack - Tia Gunn &amp; Angel Cakes - HD\n\nScene Pictures:\n &lt;a href=&quot;\nhttp://www.urpichost.com/?v=watchilll.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.urpichost.com/?v=watchilll.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.urpichost.com/?v=watchieye.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.urpichost.com/?v=watchieye.jpg&lt;/a&gt;\n\n\nSome parents just won't cut that umbilical cord no matter the age. Angel Cakes is spending her afternoon playing tonsil hockey with her boyfriend, Flash Brown. Angel thinks she's alone but mom, Tia Gunn, is watching her daughter doing the unthinkable by locking lips with  man of the ebony persuasion. Tia's scornful wrath results in Angel leaving the room and this is where mom becomes the opportunist. One thing leads to another and Angel Cakes walks in as her mother is sucking down on forbidden black cock. If you can't beat em', join em' and that's exactly what happens. Angel Cakes and Tia Gunn swim in the interracial porn pool as both take turns sucking on Flash' giant slab of black meat. One can't help but be envious of Flash Brown since he's getting to fuck 2 generations of black cock sluts. Tia, with her thunderous tits, shows her daughter the exact way to get as much black cock deep inside her pussy while risking no permanent damage. Mother and daughter take turns riding that big, black cock until his balls are slapping against their fuck holes. The term, &quot;Like mother, like daughter&quot; never echoed so loudly as both girls jerk off 12 inches of black anaconda with their 10 little piggies. It seems as if the ban on black men has been lifted since both ladies waste no time in letting Flash ram his black tree trunk deep into their love holes. Tia Gunn gets a front row seat to the possible conception of her grandchild when Flash detonates his balls inside the cavern of Angel Cakes. Who said interracial porn can't be a family affair?","torrent":{"xt":"urn:btih:74fd7071b82af91535759f92e77d491248154ba9","amp;dn":"WatchingMyMomGoBlack+-+Tia+Gunn+%26amp%3B+Angel+Cakes+-+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74fd7071b82af91535759f92e77d491248154ba9","infoHashBuffer":{"type":"Buffer","data":[116,253,112,113,184,42,249,21,53,117,159,146,231,125,73,18,72,21,75,169]},"announce":[],"urlList":[]}}