{"title":"Sanford Clark - Shades - Bear Family CD (1993)","uid":8492979,"size":167985214,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:751e4ca372f77651963658406157f8631a17032b&amp;dn=Sanford+Clark+-+Shades+-+Bear+Family+CD+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bonnie335","files":29,"time":1369055290,"description":"Sanford Clark - Shades - Bear Family CD (1993)\n\n\nPicks up Sanford Clark's story where it left off on the previous volume. His deep soulful baritone is heard on 1960 recordings with Don Cole, 1967-8 sides with Waylon Jennings and others, and 1973 and 1982 recordings, as well as previously unissued demos. Altogether, 27 songs including Better Go Home (Throw That Blade Away), The Girl On Death Row, The Fool, Climbin' The Walls, The Big Lie, Now I Know I'm Not In Kansas, and Nine Pound Hammer. CD with 20-page booklet.\n\nBear Family's The Fool -- a 33-track anthology of Sanford Clark's Jamie and Dot recordings that includes his only major hit, &quot;The Fool&quot; -- is as generous and definitive a collection as anyone could want. Not content to stop there, Bear Family followed up with Shades, a miscellany of Clark's odds and ends spanning more than 20 years. The album begins with three Jamie recordings that didn't fit on The Fool, including Lee Hazlewood's tragic story-song &quot;The Girl on Death Row,&quot; about an innocent girl who is mistakenly put to death. The anthology then jumps forward to 1966 when Clark sang straight country music for the small Ramco label, dropping the rockabilly elements that gave his earlier recordings their crossover appeal. A remake of &quot;The Fool&quot; with fuzztone bass (a brief craze in country music) is of only mild interest, but &quot;Where's the Door&quot; and &quot;Black Jack County Chain&quot; show Clark's singing noticeably improved from the wobbly and uncertain performances heard earlier in the collection. Two demos from 1973 are the only representatives of Clark's music from that decade before Shades makes another quantum leap into the future with nearly an album's worth of recordings from 1982, all but two of which see their commercial debut here. Of these tracks, &quot;Mother Texas (You've Been a Mother to Me)&quot; is an excellent mainstream country song, &quot;Kung Fu U&quot; is a novelty recitation with buzzsaw guitar, and &quot;Movin' On&quot; (actually a cover of &quot;I'm Moving On,&quot; the Hank Snow classic) and &quot;Nine Pound Hammer&quot; (which Clark first recorded in the '50s) represent a slight return to the rockabilly fold. If The Fool already targeted a specialized audience, then Shades will appeal to an even smaller portion of that group -- collectors with a pointed interested in amassing every last demo and latter-day recording of Sanford Clark. ~ Greg Adams","torrent":{"xt":"urn:btih:751e4ca372f77651963658406157f8631a17032b","amp;dn":"Sanford+Clark+-+Shades+-+Bear+Family+CD+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"751e4ca372f77651963658406157f8631a17032b","infoHashBuffer":{"type":"Buffer","data":[117,30,76,163,114,247,118,81,150,54,88,64,97,87,248,99,26,23,3,43]},"announce":[],"urlList":[]}}