{"title":"Tullycraft - Lost in Light Rotation (2013) [FLAC]","uid":8418669,"size":226083409,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8041ad6d4cf0ec4351f9cbb43ccbb61cc3bd5eb2&amp;dn=Tullycraft+-+Lost+in+Light+Rotation+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1367118212,"description":"\n  Tullycraft - Lost in Light Rotation (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Indie Pop, Twee Pop, Alternative, Indie Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Agincourt\n  02 Queenie Co.\n  03 Lost In Light Rotation 03:32\n  04 Westchester Turnabouts\n  05 From Wichita With Love\n  06 Elks Lodge Riot\n  07 No Tic All Tac\n  08 Dig Up The Graves\n  09 Wake Up Wake Up\n  10 We Knew Your Name Until Your Heart Stopped\n  11 Anacortes\n\n  The long-running Seattle indie poppers Tullycraft took a few years off after the release of their excellent 2007 album Every Scene Needs a Center before returning in 2013 with Lost in Light Rotation. They didn't come back tentatively or with any thoughts of mellowing, they came back to make some noise. There isn't a single slow song to be found here, most of the tracks are set just below rock-out level and even the one or two midtempo songs have a propulsive energy that will have you up and out on the dancefloor. There's plenty of polite punk in their sound on this outing; there's no time for electronic flourishes or songs that take their time to sink in. It's all immediate and it's all fun. Singing about thrift shop record digging, dance parties, failed bands, and the vagaries of being in love with music, Sean Tollefson is his usual witty self throughout. He has an uncanny knack for telling stories and bringing characters to life with just a few details or sardonic twists of phrase. And his melodies are knockouts! \n\n  Jenny Mears is once again the secret weapon, bolstering Tollefson's reedy vocals with her sweetly sung backing vocals and occasional lead. The way the two arrange their vocals is one of the highlights of the record. Phil Ek's simple yet very punchy production is another; the guitars are front and center and he doesn't dress up the sound with any reverb or tricks at all. He just gets out of the way and lets the band tear it up on rowdy tracks like &quot;Tear Up the Graves&quot; or &quot;Elks Lodge Riot,&quot; and when they bring it down a little, like on &quot;Westchester Turnarounds,&quot; there's still plenty of excitement in the grooves. After almost 20 years together as a band, you might expect that they would sound a little tired or played out, but Tullycraft sound better and younger than ever. Here's to another 20 years of the best indie pop around.","torrent":{"xt":"urn:btih:8041ad6d4cf0ec4351f9cbb43ccbb61cc3bd5eb2","amp;dn":"Tullycraft+-+Lost+in+Light+Rotation+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8041ad6d4cf0ec4351f9cbb43ccbb61cc3bd5eb2","infoHashBuffer":{"type":"Buffer","data":[128,65,173,109,76,240,236,67,81,249,203,180,60,203,182,28,195,189,94,178]},"announce":[],"urlList":[]}}