{"title":"Hobson's Choice (1954) DVD9 - Charles Laughton, Brenda deBanzie,","uid":10005018,"size":8114968576,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:81104c69b6108682a8aa9d164f0337e86a93756c&amp;dn=Hobson%27s+Choice+%281954%29+DVD9+-+Charles+Laughton%2C+Brenda+deBanzie%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1398039387,"description":"Hobson's Choice (1954) DVD9 - Charles Laughton, Brenda deBanzie, Classic Winner [DDR]\n\nHobson's Choice is a 1954 romantic comedy film directed by David Lean. It is based on the play of the same name by Harold Brighouse. It stars Charles Laughton in the role of Victorian bootmaker Henry Hobson, Brenda De Banzie as his eldest daughter and John Mills as a timid employee. The film also features Prunella Scales, in one of her first roles, as another daughter.\n\nHobson's Choice won the British Academy Film Award for Best British Film 1954 and the film won the Golden Bear at the 4th Berlin International Film Festival in 1954\n\n    CAST:-\n    Charles Laughton as Henry Horatio Hobson\n    John Mills as Will Mossop\n    Brenda De Banzie as Maggie Hobson\n    Daphne Anderson as Alice Hobson\n    Prunella Scales as Vicky Hobson\n    Richard Wattis as Albert Prosser\n    Derek Blomfield as Freddy Beenstock\n    Helen Haye as Mrs. Hepworth, the financial backer\n    Jack Howarth as Tubby Wadlow, another Hobson employee\n    Joseph Tomelty as Jim Heeler\n    Julien Mitchell as Sam Minns, the publican\n    Gibb McLaughlin as Tudsbury\n    Philip Stainton as Denton\n    John Laurie as Dr. MacFarlane\n    Dorothy Gordon as Ada Figgins\n\nDirected by David Lean\nProduced by David Lean\nWritten by Harold Brighouse, Wynyard Browne, David Lean\nMusic by \tMalcolm Arnold\nRunning time 107 minutes\n\nSYNOPSIS:- Hobson's Choice (1954)\nWill Mossop (John Mills) is a gifted but unappreciated bootmaker employed by the tyrannical Henry Horatio Hobson (Charles Laughton) in his moderately upscale shop in 1880s Salford. Hard-drinking widower Hobson has three daughters. Maggie (Brenda De Banzie) and her younger sisters Alice (Daphne Anderson) and Vicky (Prunella Scales) have worked in their father's establishment without wages and are eager to be married and free of the shop. Alice has been seeing Albert Prosser (Richard Wattis), a young up-and-coming solicitor, while Vicky prefers Freddy Beenstock (Derek Blomfield), the son of a respectable corn merchant. Hobson does not object to losing Alice and Vicky, but Maggie is far too useful to part with. To his friends, he mocks Maggie as a spinster &quot;a bit on the ripe side&quot; at 30 years of age.\n\nHer pride injured, Maggie bullies the browbeaten, unambitious Willie into an engagement. When Hobson objects to her choice of his own lowly employee as husband and refuses to start paying her, Maggie announces that she and Willie will set up in a shop of their own. For capital, they turn to a satisfied customer for a loan. With money in hand, they are married, and, between Maggie's business sense and Willie's shoemaking genius, the enterprise is successful. Within a year, they have not only paid off their business loan, but have also taken away nearly all of Hobson's clientele. Under Maggie's tutelage, the formerly illiterate Willie has become an educated, self-confident man of business, and he and Maggie have fallen in love.\n\nWhen Hobson's drinking finally catches up with him, Dr. MacFarlane (John Laurie) sends for Maggie to care for the ailing, bedridden man. At her urging, Mossop offers to go into partnership with Hobson, on condition that Hobson take no further part in the business. After a tussle over the name to be used, Hobson reluctantly agrees.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 107 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 107 mins","torrent":{"xt":"urn:btih:81104c69b6108682a8aa9d164f0337e86a93756c","amp;dn":"Hobson%27s+Choice+%281954%29+DVD9+-+Charles+Laughton%2C+Brenda+deBanzie%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81104c69b6108682a8aa9d164f0337e86a93756c","infoHashBuffer":{"type":"Buffer","data":[129,16,76,105,182,16,134,130,168,170,157,22,79,3,55,232,106,147,117,108]},"announce":[],"urlList":[]}}