{"title":"Mount Olympus v1.1.8 [With.OBB.files](AnDrOid)","uid":9958433,"size":132326291,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:82262a5e3810b0422311f061f5fd8cae769baabf&amp;dn=Mount+Olympus+v1.1.8+%5BWith.OBB.files%5D%28AnDrOid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Evil_Amdis","files":1,"time":1397434649,"description":"Mount Olympus \n\n\nThe Greek Gods have gone missing, and you're just the hero to solve the mystery and bring the Gods back.\n\nMount Olympus is a point and click adventure designed specifically to be simple, yet gripping and challenging at every turn. Unlike other adventure games, Mount Olympus has been crafted in a way that makes getting lost next to impossible. So instead of floundering around, unsure of where to turn, you'll be lost in the elegance of the art, and the story instead.\n\nYou are the hero, sent on a quest to Mount Olympus by your village elders to discover why the Gods have gone missing. Your quest begins as you enter the city of Olympus, which stretches out, covering the base of the great mountain of the Gods.\n\nYou must search through the abandoned ancient city looking for clues, solving puzzles, and slowly making your way to the top of the great mountain, in hopes of solving the mystery laid out before you and returning the great and powerful Gods to their glory.\n\nWith the success of our last point-and-click adventure game, Tesla's Electric Mist, we've gone back to the drawing board, adjusting our core game engine, adding all the elements our fans requested. Our fans begged for a longer game (they were sad to see it end). Mount Olympus will be double the chapters, and is expected to be 3x as long in game play as Tesla. You wanted more puzzles; how's 10x the puzzles sound? Although we never once heard a complaint about our easy to use in-game map and hint guide, we've improved them immensely. With our new in-game hint system, we literally will show you exactly where to click if you need that level of help. With so many puzzles to work through, we felt it would be awesome to have an auto-solve system for your convenience on those really tough puzzles.\n\nFeatures\n- Simple point and click system\n- Never feel lost\n- 10x the puzzles &amp; 3x as long in game play\n- Elegant artwork in every scene\n- Almost 300 scenes to play through\n- In-game hint system that literally shows you where to click next if needed\n- Auto-solve feature for getting past the puzzles you just can't figure out\n- Collect an inventory of items along the way to help you progress\n- Scenes you visit are mapped for you automatically\n- Important clues you come across are recorded automatically\n\nSCREENSHOTS","torrent":{"xt":"urn:btih:82262a5e3810b0422311f061f5fd8cae769baabf","amp;dn":"Mount+Olympus+v1.1.8+%5BWith.OBB.files%5D%28AnDrOid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82262a5e3810b0422311f061f5fd8cae769baabf","infoHashBuffer":{"type":"Buffer","data":[130,38,42,94,56,16,176,66,35,17,240,97,245,253,140,174,118,155,170,191]},"announce":[],"urlList":[]}}