{"title":"Once Upon a Time S02E19 XviD [JKS]","uid":8430497,"size":409274445,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:825cba4b8b3306a6f714877691aa6775b7245aad&amp;dn=Once+Upon+a+Time+S02E19+XviD+%5BJKS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jksADIDAS","files":14,"time":1367475202,"description":"Once Upon a Time S02E19 XviD [JKS]\n.\nXviD \nEncode Information\nResolution....: 624x352\nVideo : XviD (.avi)\nAudio : MP3 2ch 128kbps\nAudio sample rate 48kHz\nFrame Rate : 23 fps\n.\nIMDb: http://www.imdb.com/title/tt1843230/?ref_=sr_1\nWiki: http://en.wikipedia.org/wiki/Once_Upon_a_Time_(TV_series)\nOfficial Site: http://beta.abc.go.com/shows/once-upon-a-time\nOfficial Fan site: http://once-storybrooke.net/\nOfficialsite:\n.\nThe series takes place in the fictional seaside town of Storybrooke, Maine, in which the residents are actually characters from various fairy tales that were transported to the &quot;real world&quot; town and robbed of their real memories by the Evil Queen, Regina (Lana Parrilla), using a powerful curse obtained from Rumplestiltskin (Robert Carlyle). The residents of Storybrooke have lived an unchanging existence for 28 years, unaware of their own lack of aging. The town's only hope lies with a bail bondswoman, Emma Swan (Jennifer Morrison), the daughter of Snow White (Ginnifer Goodwin) and Prince Charming (Josh Dallas), who was transported from the fairy tale world before she could be cursed. As such, she is the only person who can break the curse and restore the characters' lost memories, aided by her son, Henry (Jared S. Gilmore), with whom she has recently reunited (after giving him up for adoption upon his birth), and his book of fairy tales that holds the key to ending the curse. Henry is also the adopted son of Regina (who is the mayor of Storybrooke), providing a source of conflict between the two women.\nEach episode focuses on a character backstory. One segment details the character's past life that, when serialized, adds a piece to the puzzle about the primary and/or secondary characters and their connection to the events that preceded the curse and its consequences. The other, set in the present day, follows a similar pattern with a different outcome but also offers similar insights. In addition, another storyline follows the results of what had happened after the curse took place and after it was broken by Emma.\n.\nOnce Upon a Time Season 2 Episode 19\nTitle: Lacey  Directed by: Milan Cheylov  Written by: Edward Kitsis &amp; Adam Horowitz  Original air date: April 22, 2013\n...\nMr. Gold enlists the aid of David to help him try to jog Belle's now cursed memories and get her to love him again; and when it is revealed that the magic beans Anton and the dwarves have been harvesting have begun to grow and could possibly transport everybody home, Emma is torn over whether she would want to live in fairytale land or stay in our world. Meanwhile, in the fairytale land that was, Rumplestiltskin forces Belle to accompany him on a hunt to kill a thief, whom she had freed in the name of mercy.\n","torrent":{"xt":"urn:btih:825cba4b8b3306a6f714877691aa6775b7245aad","amp;dn":"Once+Upon+a+Time+S02E19+XviD+%5BJKS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"825cba4b8b3306a6f714877691aa6775b7245aad","infoHashBuffer":{"type":"Buffer","data":[130,92,186,75,139,51,6,166,247,20,135,118,145,170,103,117,183,36,90,173]},"announce":[],"urlList":[]}}