{"title":"Adrian James Boot Camp v2.0.0","uid":8503106,"size":37729980,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:82f624d80b3c9d257ad0c0efa3473adec9f2cbef&amp;dn=Adrian+James+Boot+Camp+v2.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":-1,"time":1369352968,"description":"\nThe Adrian James Boot Camp helps you get toned and improve your core strength without the need for any equipment. Achieve your fitness goals with the most comprehensive range of exercises designed to be performed anywhere for all levels of ability.\n\nInspired by the training routines used by professional fitness model Adrian James, you can share the exercises honed and developed by Adrian over years of training. This training regime has allowed Adrian to build an aspirational physique that keeps him at the top of his profession, and to be one of the elite athletes who has achieved coveted sponsorship with Europe's number one sports nutrition supplier, Maximuscle.\n\nStay motivated and track your progress using the 8 week body transformation challenge featuring randomly generated workouts with increasing levels of difficulty. Clear videos with audio instructions and exercise tips help you to perform each exercise correctly for rapid results.\n\nAdrian James Boot Camp provides the most comprehensive range of training exercises to tone your body and build core strength.\n\n+ 18 easy, medium and hard exercises to challenge every level of ability\n\n+ Clear video demonstrations with audio commentary make sure you are performing each exercise for best results\n\n+ Tips provide clear 'at a glance' step by step guidance for each exercise to motivate you to reach your fitness goals\n\n+ Customise your own workouts\n\n+ Absolutely no gym equipment required\n\n** PLEASE NOTE - This app may not display correctly on some tablet devices including the Asus Nexus 7 inch tablet. Apologies, we are doing our best to revolve this **\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.sixpackproductions.bootcamp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.sixpackproductions.bootcamp&lt;/a&gt;\n","torrent":{"xt":"urn:btih:82f624d80b3c9d257ad0c0efa3473adec9f2cbef","amp;dn":"Adrian+James+Boot+Camp+v2.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f624d80b3c9d257ad0c0efa3473adec9f2cbef","infoHashBuffer":{"type":"Buffer","data":[130,246,36,216,11,60,157,37,122,208,192,239,163,71,58,222,201,242,203,239]},"announce":[],"urlList":[]}}