{"title":"Core Temp","uid":9809480,"size":534608,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:88883a8d3c0317dc4cb16b55db58c5d937911e9f&amp;dn=Core+Temp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"prodallasosoft","files":1,"time":1395503499,"description":"Version 1.0 RC5 - 28th February, 2013\n\n*** Core Temp Monitor is now available, an Android app to monitor your machines from anywhere in the world! More information can be found here.\n\n- New: Multilingual interface. Core Temp now natively supports adding non-English languages.\n- New: Plugin system - 3rd party developers can now create plugins and extensions for Core Temp, both native code and .Net is supported, please see this for more information.\n- New: Added support for Intel Pentium and AMD K5 and newer processors. (detection only, Temperature by Acpi Thermalzones)\n- New: Added support for VIA processors. (C3 - detection only, Temperature by Acpi Thermalzones)\n- New: Intel Sandy Bridge, Ivy Bridge, AMD Bulldozer, Piledriver and Fusion (Trinity, Llano, Brazos) support.\n- New: Max TDP detection on supporting processors.\n- New: Active power consumption on Intel's Sandy Bridge and Ivy Bridge processors.\n\n- Fix: All of the user reported bugs and many more unreported problems.\n\n- Update: Optimized the startup code, Core Temp should now launch 2 to 4 times faster.\n- Update: Optimized many other aspects of the code, Core Temp should now consume much less CPU time than before.\n- Update: Restored support for older OS: Windows XP is now fully supported, Windows 2000 requires security updates KB935839, KB835732 and GDI+. In some cases hotfix KB816542 may be needed as well.\t\t\n\nAd supported exe,just decline and uncheck unwanted B.S.\n\nScanned (With Kaspersky) And 100% Clean.\n\nPlease Leave A Comment Confirming This Pack\n\nPLEASE SEED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! \n\n        This is a exe. This is best Quality,Just Install!\n\nSEED AND ENJOY !\n\nTHE UPLOADS ARE VIRUS / MALWARE FREE.\n\nLEAVE COMMENTS FOR OTHER DOWNLOADERS TO REFER.\n\nAND REMEMBER TO ENJOY ! \n\nIF YOU DON'T SEED, YOU DON'T NEED THIS TORRENT!!! BE KIND TO OTHER DOWNLOADERS \t\t\t\t\t\t\t\t\t\t\n\nCheck out all prodallasosoft torrents at http://thepiratebay.se/user/prodallasosoft\t\t\t\t\t\t\t","torrent":{"xt":"urn:btih:88883a8d3c0317dc4cb16b55db58c5d937911e9f","amp;dn":"Core+Temp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88883a8d3c0317dc4cb16b55db58c5d937911e9f","infoHashBuffer":{"type":"Buffer","data":[136,136,58,141,60,3,23,220,76,177,107,85,219,88,197,217,55,145,30,159]},"announce":[],"urlList":[]}}