{"title":"The Big Bang Theory S06-E24 Season Finale (2013)mkv 720p NL srt ","uid":8491090,"size":618918654,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8b07caa5ee32d4b2ac8701af46b409891742590d&amp;dn=The+Big+Bang+Theory+S06-E24+Season+Finale+%282013%29mkv+720p+NL+srt+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ChickieChicken","files":-1,"time":1369003845,"description":"Seizoen 6 Aflevering 24 van deze populaire tv serie.\n\n\nDe show gaat over vier vrienden: Leonard Hofstadter, Sheldon Cooper, Howard Wolowitz en Rajesh Koothrappali, die allemaal werken bij Caltech. Leonard, Sheldon en Rajesh zijn gepromoveerd en hebben een PhD in een natuurwetenschappelijke richting, Howard is een ingenieur met een masterdiploma. Het zijn alle vier echte geeks: bollebozen met een voorliefde voor wiskunde en fysica, ze spreken verschillende talen (zoals Klingon) en hebben allemaal een hoog IQ. In hun vrije tijd spelen ze vooral computerspelletjes, lezen ze stripverhalen en kijken ze graag naar sciencefictionfilms en/of -series.\n\nLeonard en Sheldon delen een appartement. Op een dag krijgen de twee een nieuwe overbuur: Penny. Zij is (in haar woorden &quot;tijdelijk&quot;) serveerster bij eetgelegenheid The Cheesecake Factory met acteerambities. Ze is niet zo intelligent als de mannen, maar haar sociale vaardigheden zijn stukken beter. Penny komt uit Omaha (Nebraska) en is naar Los Angeles gekomen om het te maken in de showbizz, maar dat wil niet zo goed lukken. Leonard is onmiddellijk verliefd op Penny, en zijn vrienden plagen hem daarmee, omdat Penny volgens hen ver buiten zijn bereik ligt. Toch klikt het soms tussen hen beiden, maar door hun grote verschillen in persoonlijkheid en levensstijl is hun relatie/vriendschap van wisselend succes.\n\nBron: Dimension 720p\n\n\nUiteraard bedankt vertalers van SRT\n\n\n\nNLtoppers wenst u veel kijkplezier!\n\n\nGroetjes CC","torrent":{"xt":"urn:btih:8b07caa5ee32d4b2ac8701af46b409891742590d","amp;dn":"The+Big+Bang+Theory+S06-E24+Season+Finale+%282013%29mkv+720p+NL+srt+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b07caa5ee32d4b2ac8701af46b409891742590d","infoHashBuffer":{"type":"Buffer","data":[139,7,202,165,238,50,212,178,172,135,1,175,70,180,9,137,23,66,89,13]},"announce":[],"urlList":[]}}