{"title":"Fred Eaglesmith and The Flathead Noodlers - Balin [2003][EAC,log","uid":8427620,"size":283385844,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8bde653ad81d1f191477a9a3a3aa4ef0e06aa1c9&amp;dn=Fred+Eaglesmith+and+The+Flathead+Noodlers+-+Balin+%5B2003%5D%5BEAC%2Clog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":21,"time":1367392691,"description":"01. The Building (01:20)\n02. Do You Love Me Now (02:07)\n03. Bailing Again (02:24)\n04. Rooster Fight (02:26)\n05. A Little Lost (01:33)\n06. Run-A-Way Lane (03:53)\n07. Back There (02:13)\n08. Two Machines (03:54)\n09. The Rocket (03:54)\n10. John Deere &quot;b&quot; (03:14)\n11. No Sorrow No More (02:54)\n12. Tin Pot Nelly (02:11)\n13. I Shot Your Dog (03:04)\n14. Small Motors (03:13)\n15. Dixie Mountain (02:21)\n16. Some Roads (03:30)\n17. Mary Lane (06:11)\n\nFred's bluegrass effort &quot;Balin'&quot; is another exquisite disc in Fred's very strong catalogue. From the a cappella opener &quot;The Building,&quot; we know we're in for a great down home roots treat. &quot;Do You Love Me Now&quot; is a classic, with Fred's catchy chorus giving a failed love affair a sense of irony. &quot;Baling Again&quot; is a touching remembrance of a daddy gone on. &quot;Bring your money &amp; bring your gun; if you got any rotgut, bring it along,&quot; Fred sings on the loping &quot;Rooster Fight.&quot; It's rare to have tracks at a minute &amp; a half these days; so &quot;A Little Lost&quot; breezes by with the Flathead Noodler's great harmonies. &quot;Run-a-way Love&quot; is a great country track that'd fit well on most of Fred's other recordings. John Allen's fiddle moans on the aching &quot;Two Machines,&quot; &quot;I changed the magneto &amp; the wire, but it won't go no matter how I try.&quot; &quot;The Rocket&quot; is an aching track from an old man's point of view that enjoys watching the trains. &quot;John Deere B&quot; is another sad country weeper about a great old tractor relegated to a restaurant decoration. &quot;No Sorrow No More&quot; sounds like it was sung in a Baptist Church in the 1930's. &quot;Tin Pot Nelly&quot; is classic Eaglesmith creating great musical drama from sparse lyrical touches, &quot;There's a picture on the wall when momma was pretty; she had new clothes and she had nice things.&quot; Country is as country as country can be on &quot;I Shot Your Dog.&quot; &quot;Some Roads&quot; boasts a gorgeous melody on a great outlaw track, &quot;I'm going to turn myself in today; she'll be crying by the scaffold when the hangman calls my name.&quot; Fred Eaglesmith is one of Canada's great musicians. This set combines bluegrass touches with sparse acoustic country arrangements. There are no weak tracks. You don't want to miss this great set! Enjoy!","torrent":{"xt":"urn:btih:8bde653ad81d1f191477a9a3a3aa4ef0e06aa1c9","amp;dn":"Fred+Eaglesmith+and+The+Flathead+Noodlers+-+Balin+%5B2003%5D%5BEAC%2Clog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bde653ad81d1f191477a9a3a3aa4ef0e06aa1c9","infoHashBuffer":{"type":"Buffer","data":[139,222,101,58,216,29,31,25,20,119,169,163,163,170,78,240,224,106,161,201]},"announce":[],"urlList":[]}}