{"title":"2014 - The Year In Christian Music (Bundle 19)","uid":10011335,"size":2154874667,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8bf313fdd699753786bc20984fceed4e621ea5d9&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+19%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"TorrentTracts","files":262,"time":1398103618,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nI think it's finally time to move these torrents to a private tracker.  I've had initial discussions last week with someone on the matter, but there's a bit of a language and understanding barrier there.  So I'm moving on to Plan B.  And that is calling out to all of you for help.  Specifically those of you who may have the means of making it possible.\n\nIn your opinion, would you say I work hard at this?  Do I faithfully serve you?  In your opinion, am I honoring God?  If you had to locate and gather all of this music yourself, would it not take you longer than a single click of a torrent file?  Do you come here looking for Christian Music because it's easy, and you can usually count on me to find these albums for you?  Do you feel you've been at all blessed by my years of service?\n\nWe'll I've had enough of The Pirate Bay.  I'm tired of anonymity giving some a false sense of bravado.  I'm tired of the drama.  I'm tired of dealing with the courage some find while hiding behind the glow of their monitor.  I'm tired of being yoked into the negativity of some of these messages.  I'm tired of all the advertising pornography I see on my screen each and every day I come here to torrent, or to answer your questions.  I'm tired of coming here wondering who the next person is that will be pissing on my foot and telling me it's just rain.\n\nSo here are four options...\n\n(1) I continue to torrent here.  But I don't see that happening for much longer.  I've been actively sharing here on TPB since 2009.  Five years is enough.\n\n(2) One of you, who either has or knows of a private tracker, leads us all to that Promise Land.  Once there, we all sign up.  I would continue to torrent all of this great music, and then some.  By now most of you know my collection is massive and growing daily so I can back that statement up.  But at least we'd have more control over banning certain idiots.  My only reserve is that the Owner of the tracker doesn't get hung up on nonsense like transcodes, and other such arguments over already inferior mp3 quality.\n\n(3) I may have the inside track on running a somewhat abandoned file-sharing website.  I was asked to take it over a year or so ago.  I didn't.  Maybe that offer would still stand today.  And if it did, it would be a signup to download situation.  Not torrents.  But instead direct downloads.  At least we'd have more control over creating a family-friendly space.\n\n(4) I simply do as I always do when I stop sharing here on The Pirate Bay.  I quietly go away.  I take my act on the road, sharing elsewhere.  And I'm perfectly okay doing that too.\n\nBut this can't go on.  If you read this message today, and you ignore it, then you're basically saying you can't help.  Or you won't help.  Fair enough.  But if you have a solution for us, and you'd welcome this Christian Music on your tracker, then please let us all know.  Please make room for me and all who would follow me there.  I'm sure one or two Pirate Bay users would be eager to join.  ;)\n\nFor those keeping score, our year to date total is now up to 676.\n\nThe 20 titles being offered today include...\n\nChoir, The - 2014 - Shadow Weaver\nCitizens - 2014 - You Brought Me Back To Life - Single\nClose Your Eyes - 2014 - Prepackaged Hope\nFayBN - 2014 - The Kingdom\nFrancesca Battistelli - 2014 - If We're Honest - Deluxe Edition\nIV Conerly - 2014 - Box Me In\nJim Clark - 2014 - You Can\nKings And Dreams - 2014 - Kings And Dreams\nLeonard Jones - 2014 - Crowns\nMatt Maher - 2014 - Bootleg 2014-04-05 - RMB Fairgrounds, Robstown, TX\nOne Republic - 2014 - Love Runs Out - Single\nPhil Wickham - 2014 - The Ascension - Deluxe Edition\nPlaydough - 2014 - Gold Tips - With Sean Patrick\nRed - 2014 - Run And Escape - Single\nRoyal Ezenwa - 2014 - Misfit, Vol 1\nSteven Patrick - 2014 - Guns And Gold\nVarious - 2014 - Glorious Morning - 10 Stirring Anthems Of The Risen Christ\nVarious - 2014 - Heaven Is For Real - Nick Glennie-Smith - Soundtrack\nVarious - 2014 - I've Seen Heaven - Songs Of Worship And Revelation\nVarious - 2014 - Ultimate Easter Worship Collection\n\nGod Bless,\nTorrentTracts, April 2014\n","torrent":{"xt":"urn:btih:8bf313fdd699753786bc20984fceed4e621ea5d9","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+19%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf313fdd699753786bc20984fceed4e621ea5d9","infoHashBuffer":{"type":"Buffer","data":[139,243,19,253,214,153,117,55,134,188,32,152,79,206,237,78,98,30,165,217]},"announce":[],"urlList":[]}}