{"title":"Sexually Broken--Fresh faced Latina Selma Sins railed by 2 guys ","uid":10099320,"size":1544253097,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8da7f0850f69112b23bfee53db4e8b22808e1452&amp;dn=Sexually+Broken--Fresh+faced+Latina+Selma+Sins+railed+by+2+guys+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1399363011,"description":"\nFresh faced Latina Selma Sins gets railed by 2 guys brutal deepthroat on BBC, fucked hard and rough! | Selma Sins\n\nMay 5, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nToday we happily welcome back an eager newcomer that impressed us last time with her stamina and dedication to the dick. Selma Sins and her keen throathole are here to get railed as only Sexuallybroken can deliver. We are bringing not one but two cocks to the table to properly break this bitch down. Selma is going to get fucked silly today.\n\nWe start off with a simple wrist tie. That is all it takes to render someone completely helpless. Once Selma is properly immobilized, we drop her to her knees. Most sluts look better on their knees and Selma is no exception. Pulling up two comfortable chairs, we pass Selma and her facepussy back and forth like a party favor. She gasps and drools as her legendarily sticky throat lube flows out of that well used mouth. This throat training is just the warm up though.\n\nIt is time for the main course, and we pull up our handy and much used fuck table. The bondage keeps Selma completely restrained but gives us the freedom to ragdoll fuck her from both ends in every possible position and angle we so desire. We tag team her without mercy, never getting a chance her a chance to get on top of it or catch her breath. 10 inches of rock hard BBC is shoved down her throat while another dick drills her pussy, owning every inch of her tender flesh.\n\nWe flip her back and forth, keeping up the relentless pounding as Selma drifts off into sexual subspace. She is an undone puddle of well used holes. Her eyes are glassy and her mouth is slack. She doesn't even remember her own name at this point. This little fucktoy is one worth keeping around. And judging by the wide grin dancing across her drool covered face, she had as much fun as we did today.  \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_05ssins3/SexuallyBroken-Selma-Sins-Fresh-faced-Latina-Selma-Sins-gets-railed-by-2-guys-brutal-deepthroat-on-BBC-fucked-hard-and-rough.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_05ssins3/SexuallyBroken-Selma-Sins-Fresh-faced-Latina-Selma-Sins-gets-railed-by-2-guys-brutal-deepthroat-on-BBC-fucked-hard-and-rough.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:8da7f0850f69112b23bfee53db4e8b22808e1452","amp;dn":"Sexually+Broken--Fresh+faced+Latina+Selma+Sins+railed+by+2+guys+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da7f0850f69112b23bfee53db4e8b22808e1452","infoHashBuffer":{"type":"Buffer","data":[141,167,240,133,15,105,17,43,35,191,238,83,219,78,139,34,128,142,20,82]},"announce":[],"urlList":[]}}