{"title":"Don't Hate the Player...Hate the Game by Katie Ashley [MU]","uid":8427141,"size":2430723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:939fc7654a68204caf091fbb064318933a2838f2&amp;dn=Don%27t+Hate+the+Player...Hate+the+Game+by+Katie+Ashley+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1367376421,"description":"Don't Hate the Player...Hate the Game by Katie Ashley (April 30th 2013) in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter \nCalibre - http://calibre-ebook.com/download \nOnline - http://ebook.online-convert.com/ \n\nFor Noah Sullivan being the best friend to a douchebag and player like Jake Nelson has never been easy. It's been a rocky road since kindergarten when Jake duct taped Noah to his chair before recess. With just six weeks to high school graduation, Jake accidentally blows his drunken ass up on his grandfather's tractor, and Noah finds himself immersed not only in a whirlwind of grief, but on a quest to find a mystery girl from Jake's past. \n\nWhile cleaning out Jake's room, Noah and Jake's dad make a startling discovery. Instead of the obligatory porn collection or pot stash, they find a ring, but not just any ring. Its half a carat of commitment in a platinum setting-proving even man whores have taste. After Jake's mom pleads with Noah to find the girl who meant so much to Jake, Noah begins a modern day Grail quest to track the girl down.\n\nSince Jake was a notorious player with a legendary collection of trophy panties, Noah finds himself in over his head. There are the usual suspects like Avery, the Ice Princess Jake dated for appearances, or Presley, the school mattress Jake dated for convenience. But the trail begins to point to the most unlikely of suspects: Maddie, the Valedictorian and choir girl who was trying to help the unmotivated jock graduate--the girl who also has surprisingly caught Noah's eye and meddled with his heart. \n\nHanging out with Maddie shows Noah a different side of Jake--one that was deeply human and surprisingly douche-free. And the more he tries to solve the mystery of the ring and of Jake, the more Noah starts to discover about himself and of love.\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:939fc7654a68204caf091fbb064318933a2838f2","amp;dn":"Don%27t+Hate+the+Player...Hate+the+Game+by+Katie+Ashley+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"939fc7654a68204caf091fbb064318933a2838f2","infoHashBuffer":{"type":"Buffer","data":[147,159,199,101,74,104,32,76,175,9,31,187,6,67,24,147,58,40,56,242]},"announce":[],"urlList":[]}}