{"title":"Machete Kills","uid":8501366,"size":29708705,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:95f561cef4716a604acde799aa06e172fde9461d&amp;dn=Machete+Kills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sexyhdwalls","files":72,"time":1369307332,"description":"This is the biggest collection of HD wallpapers for the upcoming movie MACHETE KILLS. Its the sequel to the 2010 movie MACHETE. The movie is tied up in some legal issues and the release is in doubt. But all these images are 100% official and genuine. Not fan art, and not fake and not somebody's imagination. These wallpapers are made from 100% official images.\n\nEach wallpaper is available in 10 different resolutions. Available resoulutions are:\n\n[1024x768]  \n[1280x1024]\n[1440x900]\n[768x1024]\n[1280x800]\n[1360x768]\n[1366x768]\n[1600x900]\n[1680x1050]\n[1920x1080]\n\n\nSince you are going to see a lot of spamming in this Pictures section by some cheap douchebags related to an Indian website, who are following and attacking me since 5 years, please always check my profile to collect all HD wallpapers i post. Otherwise you might miss my posting due to their spamming... You can identify these douchebags by noting their join date. They will have joined TPB on this month (may 2013) or after.. and they will be showing a huge sudden interest in OTHERSPICTURE section by spamming here. They are spamming to push back my torrents.  If its needed, i will be posting more details about these douchebags, along with everybody's photos and personal details and the actual reason for their attacks and details about everything they did so far. \n\nAnyway, you can bookmark my profile, so that you will always get all the wallpapers i post. I have over 70,000 wallpapers, which i will be posting here one by one. My profile is:    &lt;a href=&quot;\nhttp://thepiratebay.se/user/sexyhdwalls/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/sexyhdwalls/&lt;/a&gt;\nYou can bookmark it, so that you will always get my wallpapers.\n\n\nPlease seed after you download, because my connection is slow, and i cant seed 24x7 due to my connection restrictions\n\nThanks to all who are supporting me by seeding my earlier wallpaper packs\n\n","torrent":{"xt":"urn:btih:95f561cef4716a604acde799aa06e172fde9461d","amp;dn":"Machete+Kills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f561cef4716a604acde799aa06e172fde9461d","infoHashBuffer":{"type":"Buffer","data":[149,245,97,206,244,113,106,96,74,205,231,153,170,6,225,114,253,233,70,29]},"announce":[],"urlList":[]}}