{"title":"Plunder Road 1957 BrRip Avi Lee1001","uid":9826547,"size":2773409994,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:966748c5416d6a15a0ef75f52ed0fbed64f64b0b&amp;dn=Plunder+Road+1957+BrRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xultfoad","files":2,"time":1395788841,"description":"Plunder Road 1957 BrRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050847/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050847/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Plunder_Road&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Plunder_Road&lt;/a&gt;\nPlunder Road is an American crime film first released in 1957, directed by Hubert Cornfield. The film is based on a story by Jack Charney and stars Gene Raymond, Jeanne Cooper, Wayne Morris and Elisha Cook Jr. and Stafford Repp. It is a Regal Films production, produced by Leon Chooluck.\n\nPlunder Road looks great on Blu-ray from Olive Films. Despite the single-layering the visuals appear crisp with multi-layered contrast and notable shadow detail. I don't know that dual-layering would have benefitted the image quality much more in this case. The black levels are strong indicating the source to have good density. There are a few speckles but no noise. AS the screen captures should attest the Blu-ray provides a strong presentation of an exceptional Noir.\n\nPlunder Road is a one-of-a-kind film noir beautifully shot in scope by the great cinematographer Ernest Haller (Gone with the Wind, Mildred Pierce). On a dark rainy night, five men stage a well-planned U.S. Mint train robbery and walk away with ten million in gold bullion. To throw the cops off the track, the gang split up the massive haul into three concealed truckloads and go off to three different directions hoping for a perfect getaway. No big stars, just a great cast of character-actor greats; Gene Raymond, Wayne Morris, Elisha Cook Jr., Stafford Repp and Steven Ritch.\n\nA great low-budget heist film noir. In a remote part of Utah a gang robs a train heading for San Francisco with ten million in gold. They overcome the train by blocking it and using tear gas to overcome the motorman, and while wearing white stockings to cover their faces -- they remove the gold mint onto their truck.\n\nThe gang members are: Eddie, the college educated leader and brains behind the operation, who is pulling off his first job; Skeets, who just got released from jail and is despondent because his wife died-- he now plans to take his teenage son to Rio to live in luxury; Frankie, a race car driver barred from racing for life because he failed to follow the track rules during a race; Commando, a happy-go-lucky bachelor, who works as a stuntman; and, Roly a regular truck driver with a chewing gum habit.\n\nThe plan is to travel in three different trucks: a furniture moving van, a truck carrying coffee, and a chemical tanker. They are separated by thirty minute intervals, with the gold split in each truck and hidden, as they plan to reach Los Angeles and melt the gold into the fenders of the three cars they purchased under false names. They will then load them onto a boat they will board to take them to Lisbon\n\nVIDEO\nSize.... 2.58gb\nDuration.... 01:12:25\nCodec.... XviD\nFrame Width..... 1280\nFrame Height.... 544\nData Rate.... 4914kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 192kbps.... MP3\n1 Channel mono\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:966748c5416d6a15a0ef75f52ed0fbed64f64b0b","amp;dn":"Plunder+Road+1957+BrRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"966748c5416d6a15a0ef75f52ed0fbed64f64b0b","infoHashBuffer":{"type":"Buffer","data":[150,103,72,197,65,109,106,21,160,239,117,245,46,208,251,237,100,246,75,11]},"announce":[],"urlList":[]}}