{"title":"Wings of the Hawk 1953 DvdRip Avi Lee1001","uid":9823433,"size":1174453980,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96c29f41b712b181b70a24cf119c4e573307d92d&amp;dn=Wings+of+the+Hawk+1953+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xultfoad","files":1,"time":1395728340,"description":"Wings of the Hawk 1953 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0046552/9/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0046552/9/&lt;/a&gt;\nWings of the Hawk is an American western first released in 1953, directed by Budd Boetticher. The film is based on a novel by Gerald Drayson Adams and stars Van Heflin, Julie Adams, Abbe Lane, George Dolenz and Noah Beery Jr.. Our overall rating for this film is: good.\n\nBoetticher's love affair with Mexico runs through his career. Sandwiched between his two bullfighting movies (1951 and 1955) he made a series of minor B-movies of which this Mexico-set adventure is one. \n\nIt predates the great Randolph Scott westerns but has the benefit of economy and a reasonable cast headed by Heflin as Irish Gallaher, a miner who gets caught up in the 1910-11 Mexican revolution. He also gets emotionally involved with guerrilla fighter Raquel (Adams).\n\nThe film follows familiar territory as he shows that all gringos are not evil in a film with the accent on action rather than politics.\n\nAdapted from a novel by Gerald Drayon Adams, Wings of the Hawk stars Van Heflin as Irish Gallegher, an American mining engineer working in Mexico. When his gold mine is confiscated by the local government, Gallegher aligns himself with a renegade group of insurrectionists, led by Arturo (Rodolfo Acosta). \n\nWhat follows is one perilous situation after another, usually involving explosions and chunks of debris flying at the camera, the better to show off the film's 3D camerawork. In addition, Gallegher finds time for a romance with firebrand lady outlaw Raquel (Julia Adams) and local senorita Elena (Abbe Lane). Lifting Wings of the Hawk above the norm is the always-inventive direction of Budd Boetticher.\n\nVIDEO\nSize.... 1.09gb\nDuration.... 01:17:24\nCodec.... divx\nFrame Width..... 640\nFrame Height.... 480\nData Rate....1831kbps\nFrame Rate.... 25F/S\nAUDIO\nBit Rate.... 192kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:96c29f41b712b181b70a24cf119c4e573307d92d","amp;dn":"Wings+of+the+Hawk+1953+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96c29f41b712b181b70a24cf119c4e573307d92d","infoHashBuffer":{"type":"Buffer","data":[150,194,159,65,183,18,177,129,183,10,36,207,17,156,78,87,51,7,217,45]},"announce":[],"urlList":[]}}