{"title":"Coollector Movie Database v3.24.6 MacOSX Retail-CORE","uid":8421311,"size":86173802,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:98f492f31fae5bdfaa4916d1085c656769563823&amp;dn=Coollector+Movie+Database+v3.24.6+MacOSX+Retail-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jazzan0va","files":-1,"time":1367200298,"description":"p r e s e n t   t h e   3 0 k - c o l l e c t i o n\n\nCoollector Movie Database v3.24.6 *CRACKED*\n\nCracked by....:  CORE              Release-Name..:  CR-B234B.ZIP\nSupplied......:  CORE              Release-Date..:  2013/04/09\nPackaged......:  Bergelmir         Release-Type..:  Reference\nProtection....:  DRM               OS............:  MacOSX\nCrack/SN......:  Patch             Language......:  English\nRating........:  [You decide!]     Disks.........:  18\n\n\n..: DESCRiPTiON :..\n\nCoollector Movie Database is a personalized movie database and a\nvideo collection manager, at the same time!\n\nTo begin with, the program includes a huge encyclopedia of more\nthan 100,000 movies and series. Because it's installed on your\ncomputer, you can use it even when you're offline. The interface is\nvery easy to use. You can customize the layout to your liking, and\nmake almost any search you can think of.\n\nThen, you'll start personalizing the database. You can rate all\nthe movies that you've seen, to remember whether they were good or\nbad. You can maintain a wishlist with all the movies that you'd\nlike to watch. You can organize your video collection, remembering\nwhat you own, where it's stored, and what you've loaned to whom.\nYou'll soon appreciate that the movie database is personalized.\nIndeed, your owned movies are now highlighted, and colored icons\nwill instantly remind you of how much you like a movie or a\nperson.\n\nAs a movie lover, this will greatly help you when you have to pick\nup a movie, when watching TV, or going to the theaters. Does the\nmovie have actors whom you like? Have you seen other movies from\nthis director? At first glance you'll have the answer! And to help\nyou even further in your choice, the program displays the IMDb\nrating and popularity of each movie, and provides a link to the\ntrailers on Youtube.\n\nIf you're also a video collector, you'll easily list all the\nmovies that you own. You can even scan the video files on your hard\ndisk. They'll be added automatically, and you'll be able to play\nthem from the program. Finally, if you want to grow your collection\nat the best price without missing a bargain, a database of existing\nvideos is also included, with prices updated daily.\n\n\n..: iNSTALL/REGiSTER NOTES :..\n\nJust install.\n\n\nThanks for choosing\n(C)hallenge (O)f (R)everse (E)ngineering!","torrent":{"xt":"urn:btih:98f492f31fae5bdfaa4916d1085c656769563823","amp;dn":"Coollector+Movie+Database+v3.24.6+MacOSX+Retail-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98f492f31fae5bdfaa4916d1085c656769563823","infoHashBuffer":{"type":"Buffer","data":[152,244,146,243,31,174,91,223,170,73,22,209,8,92,101,103,105,86,56,35]},"announce":[],"urlList":[]}}