{"title":"3 Books by Charity Norman (Epub, Mobi)","uid":9843382,"size":5028694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99e5a965f2c5d0542389c43cbaf9bf30793f9f2e&amp;dn=3+Books+by+Charity+Norman+%28Epub%2C+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"karaokeking123","files":-1,"time":1396029813,"description":"3 Books by Charity Norman (Epub, Mobi)\n\nRequirements: ePUB Reader | 1.78 MB | Version: Retail\n\nOverview: Born in Uganda and brought up in successive draughty vicarages in Yorkshire and Birmingham. After several years' travel she became a barrister, specialising in crime and family law in the northeast of England. Also a mediator, she is passionate about the power of communication to slice through the knots. In 2002, realising that her three children had barely met her, she took a break from the law and moved with her family to New Zealand. \nGenre: Fiction | Contemporary\n\n\n\nSecond Chances: \n\nIn the quiet of a Napier, New Zealand winter's night, the rescue helicopter is sent to airlift a five-year-old boy with severe internal injuries. He's fallen from the upstairs verandah of an isolated farmhouse, and may not last the next few hours. At first, Finn's fall looks like a horrible accident; after all, he's prone to sleepwalking. Only his frantic mother, Martha McNamara, knows how it really happened. And she isn't telling. Not yet. Maybe not ever. Martha only wants the best for her family. That's why she moved heaven and earth to move them to the other side of the world, to start their lives afresh. And now she's faced with decisions she never dreamed she'd have to make, decisions with potentially devastating consequences. She's torn between her loyalty to her family and her need to protect them. What do you do when your dream escape turns into a nightmare - and is there ever a way back? Gripping, emotional and intelligent, this is a book you won't be able to put down.\n\nThe Son-in-Law: \n\nFor three years Joseph Scott has been haunted by one moment-the moment that changed his life forever. Now he is starting over, and he wants his family back more than anything. This is the story of Joseph and his wife, Zoe; of their children, Scarlet, Theo and Ben, for whom nothing will be the same; and of Zoe's parents, who can't forgive or understand. A compelling, moving and ultimately optimistic story of one man who will do almost anything to be reunited with his children. And of the grandparents who are determined to stop him. Praise for Freeing Grace: 'An absorbing examination of fraught family dynamics and complex social issues . . . will appeal to devotees of Joanna Trollope and Jodi Picoult . . . Charity Norman has put down the clearest of markers that she is hot on their heels.' Daily Mail Praise for Second Chances: ' . . . emotionally astute, Norman writes with razor sharp perception and deep compassion.' Meredith Jaffe, the hoopla.\n\nFreeing Grace:\n\nA tender and thought-provoking story exploring the sacrifices we make for family and what it takes to be a good parent. Grace's teenage mother dies shortly after giving birth and the perfect adoptive parents are found for her: David, the curate of an inner-city parish, and his wife Leila, who are unable to have children of their own.What they don't count on is Matt Harrison, Grace's shell-shocked young father who falls in love with his daughter and fights to keep her. The Harrisons are an unconventional family who see in Grace a chance for redemption. To convince the courts of their suitability will require a commitment from Matt's mother to return from Africa to her unhappy marriage. The Harrisons enlist their friend, the feckless, charming Jake Kelly, to retrieve her and he sets off on a quest that will force a confrontation. Ultimately, there are terrible decisions to be made about Grace's fate. Everyone only wants what's best for her - but who can say exactly what that is?\n","torrent":{"xt":"urn:btih:99e5a965f2c5d0542389c43cbaf9bf30793f9f2e","amp;dn":"3+Books+by+Charity+Norman+%28Epub%2C+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e5a965f2c5d0542389c43cbaf9bf30793f9f2e","infoHashBuffer":{"type":"Buffer","data":[153,229,169,101,242,197,208,84,35,137,196,60,186,249,191,48,121,63,159,46]},"announce":[],"urlList":[]}}