{"title":"Game of Thrones 3 [x264]","uid":9911169,"size":2603451433,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9d3c5738616f95530b08056251d95a001d419de1&amp;dn=Game+of+Thrones+3+%5Bx264%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skumole83","files":10,"time":1396899949,"description":"Game of Thrones 3\n\nThe third season primarily centers on the Lannisters in King's Landing. After defeating Stannis Baratheon at the Battle of the Blackwater, they hold a firm grasp on the Iron Throne. They are threatened by their new ally House Tyrell, powerful and manipulative players of the game. Tyrion Lannister struggles with losing the power he had as Hand of the King, and feels his father doesn't appreciate the service he provided the family as hand. Meanwhile, Jaime Lannister continues his attempt to return home, and begins to form a bond with his road companion, Brienne of Tarth.\n\nThe Starks find themselves losing the War. They have lost the support of Lord Walder Frey, after Robb Stark broke his vow to him by marrying Talisa Maegyr, and many members of Robb's army are losing faith in him. His relationship with his mother has also turned icy after her freeing of Jaime Lannister, though the reported deaths of her father and the younger Stark boys brings them closer. In reality, Bran and Rickon Stark are alive and continuing their journey north, with new strange allies in the Reed siblings. It was Theon Greyjoy who faked the Stark boys' deaths, and is now being physically tortured under an unknown person's command. However, a mysterious boy claiming to be sent by his sister plans to aid his escape. Arya Stark, on her journey home with companions Gendry and Hot Pie, finds herself entangled with The Brotherhood without Banners and Sandor Clegane. Sansa Stark remains in King's Landing a prisoner of the Lannisters, but is now being offered help by both the treacherous Petyr Baelish and the Tyrells.\n\nAt Dragonstone, Stannis Baratheon appears a broken man after being crushed at the Battle of the Blackwater. His advisor Ser Davos is imprisoned after attempting to kill Melisandre, who still believes her god, the Lord of Light, will help Stannis return to prominence.\n\nBeyond the Wall, Jon Snow joins Mance Rayder's wildling army, but with hidden intentions. His vows are tested more than ever by a growing romance with wildling Ygritte, as he finds that he will have to choose between her and the Night's Watch. The latter has been largely decimated by a White Walker attack, and a group of them is making their way back to the Wall. However, many of the rangers find themselves also questioning their vows, putting Lord Commander Mormont's and Samwell Tarly's lives in danger.\n\nAcross the Narrow sea in Astapor, Daenerys Targaryen continues her quest to reclaim the seven kingdoms. She has a new companion in former King's Guard member Barristan Selmy, and is still advised by Jorah Mormont. She contemplates buying the Unsullied, an elite army of harshly trained eunuchs. They are controlled by a cruel master with an intelligent young translator, Missandei.","torrent":{"xt":"urn:btih:9d3c5738616f95530b08056251d95a001d419de1","amp;dn":"Game+of+Thrones+3+%5Bx264%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d3c5738616f95530b08056251d95a001d419de1","infoHashBuffer":{"type":"Buffer","data":[157,60,87,56,97,111,149,83,11,8,5,98,81,217,90,0,29,65,157,225]},"announce":[],"urlList":[]}}