{"title":"Michael A. Reynolds - Shattering Empires [2011][A]","uid":10016501,"size":9430653,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d6cebb3eb07e2085d19446bac4256a202e129b6&amp;dn=Michael+A.+Reynolds+-+Shattering+Empires+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anette14","files":-1,"time":1398151996,"description":"Description\nProduct Details\nBook Title: Shattering Empires: The Clash and Collapse of the Ottoman and Russian Empires 1908-1918\t\nBook Author: Michael A. Reynolds (Author)\nPaperback: 324 pages\nPublisher: Cambridge University Press; 2.12.2011 edition (March 14, 2011)\nLanguage: English\nISBN-10: 0521149169\nISBN-13: 978-0521149167\n-----------------------\nBook Description\nThe break-up of the Ottoman empire and the disintegration of the Russian empire were watershed events in modern history. The unravelling of these empires was both cause and consequence of World War I and resulted in the deaths of millions. It irrevocably changed the landscape of the Middle East and Eurasia and reverberates to this day in conflicts throughout the Caucasus and Middle East. Shattering Empires draws on extensive research in the Ottoman and Russian archives to tell the story of the rivalry and collapse of two great empires. Overturning accounts that portray their clash as one of conflicting nationalisms, this pioneering study argues that geopolitical competition and the emergence of a new global interstate order provide the key to understanding the course of history in the Ottoman-Russian borderlands in the twentieth century. It will appeal to those interested in Middle Eastern, Russian, and Eurasian history, international relations, ethnic conflict, and World War I.\n-----------------------\nReviews\n&quot;A first-class work of history ... an impressively clear and highly original account of the complex events in the Russian and Ottoman empires&quot; - Financial Times\n\n&quot;Shattering Empires is a pioneering study that brilliantly illuminates the entangled crises of the Ottoman and Russian states. In this timely and well-written book, Reynolds skilfully shows how the confrontation between these two states contributed to the collapse of both empires and to the birth of a new kind of politics in the Middle East and the Caucasus.&quot; Robert D. Crews, Stanford University\n\n&quot;Michael Reynolds has written an important and original book. He relates a complex story with remarkable clarity and admirable rigor. His balanced and nuanced account is based on wide research and is a major addition to the literature on Russian and Ottoman history, and to the history of the First World War.&quot; Peter Holquist, University of Pennsylvania\n\n&quot;Michael Reynolds combines a deep understanding of Russia and Turkey to produce an outstanding book that illuminates both historical and contemporary questions.&quot; Stephen Rosen, Harvard University\n\n&quot;Shattering Empires is a fine book ... it makes a valuable contribution not only to the history of Russian-Ottoman relations but also to our understanding of the intersection of nationalism and geopolitics in the age of imperial downfall.&quot; -Times Literary Supplement\n\n&quot;This fine, provocative book asks important questions: about the alleged anachronistic nature of empires; about nationalism as a driving force to explain the modern historical narrative; about the quest for security and its costs and consequences. It deserves a wide and serious reading.&quot;. -Journal of Military History\n\n&quot;This very well-written study is an invaluable addition to literature on WWI, borderland studies, and analyses of the Armenian question. Highly recommended.&quot; -Choice\n\n&quot;...original, fresh, and insightful...&quot; -Paul W. Werth, The Journal of Modern History\n----------------------\nBook Description II\nThe fall of the Ottoman and Russian empires irrevocably changed the landscape of the Middle East and Eurasia. Drawing on extensive archival research, Shattering Empires overturns accounts that attribute their demise to conflicting nationalisms, proposing instead the significance of geopolitical competition and the emergence of a new global inter-state order.\n----------------------\nAbout the Author\nMichael A. Reynolds is Assistant Professor of Near Eastern Studies at Princeton University.\n","torrent":{"xt":"urn:btih:9d6cebb3eb07e2085d19446bac4256a202e129b6","amp;dn":"Michael+A.+Reynolds+-+Shattering+Empires+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d6cebb3eb07e2085d19446bac4256a202e129b6","infoHashBuffer":{"type":"Buffer","data":[157,108,235,179,235,7,226,8,93,25,68,107,172,66,86,162,2,225,41,182]},"announce":[],"urlList":[]}}