{"title":"The Haunted Palace 1963 BrRip Mp4 Lee1001","uid":9974737,"size":495660132,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e27eff33f6c6c98aca5d0a73a5dff09bf73f569&amp;dn=The+Haunted+Palace+1963+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xultfoad","files":2,"time":1397678127,"description":"The Haunted Palace 1963 BrRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0057128/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0057128/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Haunted_Palace&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Haunted_Palace&lt;/a&gt;\n\nThis supposed version of Poe's poem, beautifully scripted by Charles Beaumont with a good deal more than a dash of Lovecraft's The Case of Charles Dexter Ward, boasts a superb performance from Price as a New England warlock who is burned alive for his evil practices, though not before putting a curse on his tormentors. In due course he returns, taking over the body of his great-great-grandson to wreak a picturesque revenge, well-flavoured with ground fogs, creaking doors, cobwebs, electrical storms and mutant monsters.Corman, with his prowling camera omnivorously probing the darker recesses of nightmare, paces his direction to perfection.\n\nBill Treadway, Queens, New York,2 June 2001.\nRoger Corman's &quot;The Haunted Palace&quot; has very little in common with Poe's poem, with the exception of the title and a few lines recited by Vincent Price. It is in fact based on an H.P. Lovecraft story &quot;The Strange Case of Charles Dexter Ward&quot;. In fact, that was this films' title before it was made an entry in Corman's highly successful Poe series.\n\nThat doesn't mean this is a bad picture at all. In fact, this is one of Corman's very best films: a beautifully shot (by Floyd Crosby in Panavision), subtly frightening thriller. Price stars in a double role: Ward and his great-grandfather, an evil Puritan (I guess) who has a hidden secret. Hundreds of years later, Ward inherits the &quot;haunted palace&quot; of the title. You can probably guess what happens next.\n\nBut films like &quot;The Haunted Palace&quot; (and the other Poe films for that matter) aren't about plot. It's about style, atmosphere and fine acting, all of which this film has. Price is excellent as usual in his double role, but he also gets strong support from Lon Chaney, Jr. as Ward's servant and Debra Paget as his wife (This was her final film before her retirement the following year) \n\nThe sets by Daniel Haller are the best yet in a Poe film. (And this was before his final two Poe assignments. After that, he became a director with &quot;Die, Monster,Die!&quot;, ironically also based on a Lovecraft story &quot;The Colour from Outer Space&quot;)This is a really classy production with great production values and Corman proves he knows how to get the most for his money on screen. How many people can you say that about?\n\nNote: As with all the Poe films, &quot;The Haunted Palace&quot; is best seen in the letterbox format, which preserves the 2.35:1 aspect ratio of the Panavision photography. With American Movie Classics showing this frequently and MGM releasing the cycle on DVD, viewers now have a chance to see these films the way they are supposed to. Well done.\n\nVIDEO\nSize.... 472mb\nDuration.... 01:27:07\nCodec.... h264\nFrame Width.... 720\nFrame Height.... 304\nData Rate.... 753kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 157kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:9e27eff33f6c6c98aca5d0a73a5dff09bf73f569","amp;dn":"The+Haunted+Palace+1963+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e27eff33f6c6c98aca5d0a73a5dff09bf73f569","infoHashBuffer":{"type":"Buffer","data":[158,39,239,243,63,108,108,152,172,165,208,167,58,93,255,9,191,115,245,105]},"announce":[],"urlList":[]}}