{"title":"Tarrabyte - Something Clever Goes Here","uid":9802471,"size":44170356,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9e82f535e6f55469cb16f50c32e5d9123380b95a&amp;dn=Tarrabyte+-+Something+Clever+Goes+Here&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Heromist","files":9,"time":1395403023,"description":"Hey, \nSo you are prolly wondering what this is all about? Right? \n\nWell, if you are a fateful pirate like me and keep up with Pirate news, you will know that the bay is on of the leading sites in torrenting/sharing.\n\nNot just &quot;illegal&quot; torrents but torrents that help change the world. \n\nBlah blah blah you don't care.\n\n&quot;what is this torrent?&quot;\n\nthis is a torrent of some of my...Well.. Work...Some of my music, I'm seeding out my work on the bay to any one that loves electronic music. I want to test an idea out and see how well it works. \n\n&quot;Don't you want to get paid for your work?&quot;\n\nI do, and I'm trying. I love making music and I love working on what ever I can in FL. Music is basically my life. I'm not going to lie and say I'm amazing. I want feedback. I want people to tell me what I can do to fix my mistakes. How I can tweak something and make it sound cooler. \n\nI am proud to be at the point I am at right now. I can definitely say I feel like I've come a long way, but I'm not where I want to be, and I know I'm no where near the Armin Van Burren or Deadmau5 or Sander Van Doorn stage. Maybe one day. \n\nTill then, I will try my best.\n\n=========\n\n\nANY HOW:\n\nPlease share my music and have others come and see me at my blog etc and tell me how I'm doing even leave comments! \nPS read the note I left in the torrent.\n\nPlease help an electronic artist make it some place! \n\n-HERO!","torrent":{"xt":"urn:btih:9e82f535e6f55469cb16f50c32e5d9123380b95a","amp;dn":"Tarrabyte+-+Something+Clever+Goes+Here","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e82f535e6f55469cb16f50c32e5d9123380b95a","infoHashBuffer":{"type":"Buffer","data":[158,130,245,53,230,245,84,105,203,22,245,12,50,229,217,18,51,128,185,90]},"announce":[],"urlList":[]}}