{"title":"The Life of Anton Bruckner - Hans Conrad Fischer (documentary) D","uid":10064000,"size":8148867072,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a392cb1249d3a4e29d9a4c16857dae416edcd9b8&amp;dn=The+Life+of+Anton+Bruckner+-+Hans+Conrad+Fischer+%28documentary%29+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"magneez","files":14,"time":1398731411,"description":"Anyone who enjoys the music of Anton Bruckner should see this film. \n\nHans Conrad Fischer's film, &quot;The Life of Anton Bruckner&quot; was initially released in 1974 and premiered simultaneously in Lucerne, Sydney, Linz and London. It has been acclaimed as one of the most fitting tributes to this unique and extrordinary composer. \n\nNow, for the first time, this film is being released on DVD (viewable on NTSC &amp; recent PAL machines) after a digital restoration. Previously available only on VHS, the film can now been seen as it was presented in many music halls and theaters around the world. The sound has also been restored which gives the viewer an opportunity to hear some classic performances as never before. In almost every case, the extended excerpts presented here were recorded exclusively for this film so these are unique performances not obtainable anywhere else. The orchestra excerpts include:\n\n-Eugen Jochum and the Bamberg Symphony Orchestra\n-Karl Boehm and the Bayreuth Symphony Orchestra\n-Wilhelm Jerger and the Bruckner Konservatorium Orchestra\n-Eugen Jochum and the Bruckner Orchestra, Linz\n-Rudolf Kempe and the Munich Philharmonic\n-Rafael Kubelik and the Vienna Philharmonic\n\nIn addition to performances by these past masters, there are numerous scenes from Bruckner's life and portraits of the people who influenced him the most. There are tantalizing glimpses of rare scores and manuscripts plus photographs and portraits of Bruckner from throughout his life.\n\nIt is a valuable addition to any music lover's video library.","torrent":{"xt":"urn:btih:a392cb1249d3a4e29d9a4c16857dae416edcd9b8","amp;dn":"The+Life+of+Anton+Bruckner+-+Hans+Conrad+Fischer+%28documentary%29+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a392cb1249d3a4e29d9a4c16857dae416edcd9b8","infoHashBuffer":{"type":"Buffer","data":[163,146,203,18,73,211,164,226,157,154,76,22,133,125,174,65,110,220,217,184]},"announce":[],"urlList":[]}}