{"title":"Buried at Birth s/t 7&quot; (2012)","uid":8433703,"size":14958710,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a69fe20a02f6706216e098a85fc4db9b155aac95&amp;dn=Buried+at+Birth+s%2Ft+7%26quot%3B+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stainless408","files":5,"time":1367564585,"description":"This is the second offering from Buried At Birth and their follow-up to the Full Length CD. More blasting and pulverizing, angry, clench-fisted female fronted grindcore / powerviolence from these California locals.\n\nREVIEW\n\nSan Jose's very own Grindcore/Powerviolence crew, Buried At Birth will be releasing a new Self Titled EP on Give Praise Records this summer. I had the honor of listening to the four killer tracks the album has to offer.\n\nThe first song on Side A, &quot;&quot;Pink Mist&quot; gets straight to business. Female shrieks from, vocalist, Veronica Mars (Yes, the same name) that will make your skin crawl. Accompanying the shrieks is an evil riff reminiscent of something that would be used in a Black Metal song. The song then goes into sweet tech-grind style riffage. Angry backup shouts make the song sound kinda catchy. This style is continued for the entire EP. A straight 6 minutes of sweet grindage. The second song, &quot;Wick Effect&quot; is the only song under a minute, clocking in at 57 seconds. It's as straight forward as powerviolence can be.\n\nThe second side of the EP continues the madness. &quot;Parallel Lines&quot; is mosh worthy with a killer breakdown that leads into a movie sample that begins the final song of the EP, &quot;Creature Cruiser&quot;. The B side ends in sweet bass lines and another killer mosh riff that makes me want to get crazy. The lyrics are not your typical joke or simple grind lyrics. They are very well written and angry as can be. A sweet upside to an already sweet band. Get on this one once it is released, Grinders.\n\n- Satan Loves Mexicans Blog ","torrent":{"xt":"urn:btih:a69fe20a02f6706216e098a85fc4db9b155aac95","amp;dn":"Buried+at+Birth+s%2Ft+7%26quot%3B+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a69fe20a02f6706216e098a85fc4db9b155aac95","infoHashBuffer":{"type":"Buffer","data":[166,159,226,10,2,246,112,98,22,224,152,168,95,196,219,155,21,90,172,149]},"announce":[],"urlList":[]}}