{"title":"TEN GRAND 001 (2013) (Image) (Digital) (jk-Empire) STRACZYNSKI","uid":8428735,"size":56863490,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a75a9acbe367a4be455a82ed21e244431a196df2&amp;dn=TEN+GRAND+001+%282013%29+%28Image%29+%28Digital%29+%28jk-Empire%29+STRACZYNSKI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1367430095,"description":"Ten Grand #1\n\nStory by: J. Michael Straczynski\nArt by: Ben Templesmith\nCover by: Ben Templesmith\nOn Sale: May 01, 2013\t\n\nJoe Fitzgerald was a mob enforcer until the day he met Laura, who convinced him to leave that world behind. Before quitting, Joe agreed to one last job, little realizing that the man he'd been sent to kill was deeply involved in demonlogy. He survived Joe's attempt and came after him, fatally wounding Joe and killing Laura. As he lay dying, an angelic force (who may or may not be what she appears) pointed out that where she is going, he can't follow, and where he is going, he wouldn't want her to follow. But if he will agree to work for them as a different kind of enforcer, they will bring him to life and keep on bringing him to life every time he is killed in a righteous cause. The reward: for those five minutes of death, he will be with Laura again. Would you endure an eternity of pain and death, dying over and over, to be with the woman you love for just five minutes each time you died? Most people might say no. But Joe Fitzgerald isn't most people.\n\nA bold new era begins with the long-anticipated return of Joe's Comics, the imprint that brought you MIDNIGHT NATION and RISING STARS. All-new stories from J. MICHAEL STRACZYNSKI (Babylon 5, Jeremiah, Thor, Amazing Spider-Man, Superman: Earth One) return in 2013 with an action packed line up featuring everything from superhero action to supernatural thrillers. Watch this space as a new wave of exciting, challenging and experimental stories begins!","torrent":{"xt":"urn:btih:a75a9acbe367a4be455a82ed21e244431a196df2","amp;dn":"TEN+GRAND+001+%282013%29+%28Image%29+%28Digital%29+%28jk-Empire%29+STRACZYNSKI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a75a9acbe367a4be455a82ed21e244431a196df2","infoHashBuffer":{"type":"Buffer","data":[167,90,154,203,227,103,164,190,69,90,130,237,33,226,68,67,26,25,109,242]},"announce":[],"urlList":[]}}