{"title":"Dead Confederate - In the Marrow (2013) [FLAC]","uid":8418772,"size":255065485,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a86bd6eca339ba3990fb9563e83c66a977bebdf9&amp;dn=Dead+Confederate+-+In+the+Marrow+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1367121184,"description":"\n  Dead Confederate - In the Marrow (2013) [FLAC]\n  \n  Released: 2013\n  Duration: 39:37\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 SLow Poisons\n  02 Vacations\n  03 Bleed-Through\n  04 In the Marrow\n  05 Best of the Worst\n  06 Dead Poetry\n  07 Big City Life\n  08 Winter Waters\n\n  Dead Confederate don't change their template very much on the group's third full-length, In the Marrow, still favoring dirge-like, guitar-driven, slow-burning grunge epics that blend Pink Floyd atmospherics with Nirvana attitude and maybe a touch of Neil Young's ragged glory, and the group definitely isn't in any kind of hurry to stick a song in heavy rotation anywhere on the radio. That's no doubt a good thing, since nothing in this set caters to the commercial end of things, although that doesn't mean that In the Marrow isn't commercial. It's imminently listenable, even strangely fascinating, and it's an album that isn't in too big of a hurry at all, choosing to unwind at its own pace, with nothing that really tries to guide people to the dancefloor. \n\n  All of this gives In the Marrow an odd grandeur, as if these mostly sludge-paced tracks are after their own concerns, and they sound big, solid, and immutable, going where they're going in whatever time it takes them to get there. The opener, &quot;Slow Poisons,&quot; one of the highlights, is epic and sprawling. &quot;Dead Poetry,&quot; another highlight, is smart post-grunge grunge. &quot;Bleed-Through&quot; sounds like a cover of a lost Kurt Cobain song, with singer Hardy Morris even sounding eerily like Cobain. Only the last two tracks on the album really break out of the template a little bit, with &quot;Big City Life&quot; and &quot;Winter Waters&quot; both featuring guitars that chime more than they growl, and they might almost be mistaken for ballads on an album full of molasses-paced guitar drone epics. This is an interesting album, one that will reward repeated listening, but one can't help but think that it's a transitional album, and that Dead Confederate are building to something even bigger and more balanced down the road.","torrent":{"xt":"urn:btih:a86bd6eca339ba3990fb9563e83c66a977bebdf9","amp;dn":"Dead+Confederate+-+In+the+Marrow+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a86bd6eca339ba3990fb9563e83c66a977bebdf9","infoHashBuffer":{"type":"Buffer","data":[168,107,214,236,163,57,186,57,144,251,149,99,232,60,102,169,119,190,189,249]},"announce":[],"urlList":[]}}