{"title":"The Islamic Antichrist: The Shocking Truth about Nature of the B","uid":8429130,"size":6848522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa3fb0870fa03fcb9c9132ef52fc320d369881aa&amp;dn=The+Islamic+Antichrist%3A+The+Shocking+Truth+about+Nature+of+the+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1367439018,"description":"The Islamic Antichrist: The Shocking Truth about the Real Nature of the Beast By Joel Richardson\n2009 | 304 Pages | ISBN: 1935071122 | EPUB | 7 MB\n\n\n\nThe Bible predicts that in the last days a charismatic leader will establish a global following in the name of peace. The Koran also predicts that a man will rise up to lead the nations, pledging to usher in an era of peace. The man in the Koran is called the Mahdi, or Islam's savior. However, the man in the Bible is the Antichrist. Joel Richardson's stunning research and analysis suggest that the Mahdi and the Antichrist are actually one and the same.\nIn The Islamic Antichrist, Richardson exposes Western readers to the traditions of Islam and predicts that the end times may not be far away. His book will stun readers unaware of the similarities between the Antichrist and the &quot;Islamic Jesus.&quot; His research on the relationship between Christian end-time prophecy and Islamic expectations of world domination will shock readers and shape the debate over radical Islam for years to come. This is the book to read on the world's fastest growing religion and the future of the world. ","torrent":{"xt":"urn:btih:aa3fb0870fa03fcb9c9132ef52fc320d369881aa","amp;dn":"The+Islamic+Antichrist%3A+The+Shocking+Truth+about+Nature+of+the+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa3fb0870fa03fcb9c9132ef52fc320d369881aa","infoHashBuffer":{"type":"Buffer","data":[170,63,176,135,15,160,63,203,156,145,50,239,82,252,50,13,54,152,129,170]},"announce":[],"urlList":[]}}