{"title":"Hide Folders 2012 4.1.5.801 With Serial - KurdTM","uid":8492891,"size":2129933,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ab1681fbdc7a8f4d7c96c694ca57a1bdde749184&amp;dn=Hide+Folders+2012+4.1.5.801+With+Serial+-+KurdTM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KurdTM","files":-1,"time":1369008800,"description":"\n\nHide Folders 2012 is a simple but ingenious program for Microsoft Windows XP and 2000 users. Every day we trust our personal files to a computer. Who knows how many people will want to get access to them? If you share your computer with co-workers, children, spouse or your computer is always connected to the Internet, your private files are under threat of being revealed. Since 2001, our Hide Folders software products help our users to hide private files and folders from prying eyes.\n\nFeatures and benefits\n- Immediate data protection (protect and unprotect commands are execited in no time).\n- 4 protection methods available: Hide, Lock, Hide &amp; Lock, Read Only \n- NTFS, FAT32, exFAT and FAT volumes are supported. \n- File masks (wildcards) support. \n- Unlimited number of folders can be protected at the same time. \n- No limits on the size of protected data.\n- Trusted processes support - processes which are permitted to access the protected data. \n- No file system structure modifications will occur. \n- Password protection to prevent unauthorized users from accessing your private data.\n- Protected uniinstall.\n- Removing Hide Folders application folder from the system will not uncover hidden folders. \n- Files from hidden folders will not be lost even if someone tries to remove an upper-level folder. \n- Different wipe tracks options.\n- Crutical folders aware - Hide Folders prevent locking system folders for stability reasons.\n- Safe mode support - The folders can be hidden even if your computer is running in safe mode. \n- Hot keys to manage basic Hide Folders functions. \n- Command line support of all main Hide Folders functions. \n- Support of folders named with national language symbols . \n- Multilingual support, its user interface supports different languages and can be easily translated to new languages. \n- Intuitive and extremely easy-to-use user interface with skins.\n\nHome Page - www.fspro.net","torrent":{"xt":"urn:btih:ab1681fbdc7a8f4d7c96c694ca57a1bdde749184","amp;dn":"Hide+Folders+2012+4.1.5.801+With+Serial+-+KurdTM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab1681fbdc7a8f4d7c96c694ca57a1bdde749184","infoHashBuffer":{"type":"Buffer","data":[171,22,129,251,220,122,143,77,124,150,198,148,202,87,161,189,222,116,145,132]},"announce":[],"urlList":[]}}