{"title":"Sexually Broken--Redhead Claire Robbins bend over a barrel, tagt","uid":9895240,"size":1240965853,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:abdb96cc3142cc13f6538264e3bc68e73b72321d&amp;dn=Sexually+Broken--Redhead+Claire+Robbins+bend+over+a+barrel%2C+tagt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1396698432,"description":"Redheaded sweetheart Claire Robbins bend over a barrel, tagteamed by dick, totally destroyed! | Claire Robbins | Matt Williams\n\nApril 4, 2014\n\n\niPod, Low and High Bitrate MP4 + Pics.\n\n\nOur favorite redheaded girl next door is back! Claire Robbins has the innocent face of an angel, you would never think she would do the hardcore action she does. But behind that innocent facade lurks a sexual animal of unparalleled skill. She will take anything you throw at her with a grin on her face and ask for more. Lucky for her hardcore is exactly what Sexuallybroken dishes out.\n\nBound and bent over a barrel, both ends of her are wide open and ready for access. She is completely vulnerable, firmly lashed down and unable to do so much as wiggle. Two rock hard dicks walk up and make full use of those helpless holes. Her new purpose in life is to be a cock sheath. Nothing more, nothing less. Claire is in her happy place as we fill her to the hilt. She is Chinese finger trapped as both dicks attempt to shake hands in the middle.\n\nIn a relentless flurry of never ending banging, Claire is slowly but surely worn down. Pussy does not have a chance against that much dick. Back and forth we switch, using both ends as we see fit. We swap mouth and cunt, cunt and mouth, dicked down balls deep. Claire is destroyed, face slick with her own juices, gasping quick breaths of air as the cock allows. Her eyes are locked in a far off place. This is sexual subspace at its finest.\n\nWe pick up the pace. It is time to seal the deal for this redhead. She finally grasps the true meaning of sexually broken. Her mouth is slack and well fucked. We deliver a bone jarring pounding that blasts her into another dimension. When we have had our fill for the moment, we walk away, leaving her lashed over the rusty barrel. Claire makes a great decoration and we might want to have another serving later... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_04crobbins6/SexuallyBroken-Claire-Robbins-Matt-Williams-Redheaded-sweetheart-Claire-Robbins-bend-over-a-barrel-tagteamed-by-dick-totally-destroyed.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_04crobbins6/SexuallyBroken-Claire-Robbins-Matt-Williams-Redheaded-sweetheart-Claire-Robbins-bend-over-a-barrel-tagteamed-by-dick-totally-destroyed.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:abdb96cc3142cc13f6538264e3bc68e73b72321d","amp;dn":"Sexually+Broken--Redhead+Claire+Robbins+bend+over+a+barrel%2C+tagt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abdb96cc3142cc13f6538264e3bc68e73b72321d","infoHashBuffer":{"type":"Buffer","data":[171,219,150,204,49,66,204,19,246,83,130,100,227,188,104,231,59,114,50,29]},"announce":[],"urlList":[]}}