{"title":"Society SM----SSM - Mar 21, 2014 - Amelea Dark","uid":9881153,"size":1577276416,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ad0349b33fec1f68555ca1fc5c7e5170ffa721c7&amp;dn=Society+SM%5C----SSM+-+Mar+21%2C+2014+-+Amelea+Dark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1396551196,"description":"Society SM  SSM - Mar 21, 2014 - Amelea Dark\n\n\n\nMp4  540 and 720 + Pics\n\n\nAmelia Dark is a luscious dark-haired beauty who has proven her stength and endurance for torture here at Dungeon Corp, so we brought her back to test her boundaries even further. Feenix starts off with a bit of humiliation, cutting her dress from her bound body. He them amuses himself - and torments her - by making her complete timed tasks. He adds more and more painful clamps and suction cups to her nipples when she doesn't complete the tasks correctly, calling her names the whole time. Next, Feenix binds Amelia in a tight hogtie. He begins with a bit of bastinado and tickling. Then he tightens her binds with a nose hook, pussy hook and hair tie, all of which poor Amelia can barely handle. Feenix sends her over the edge with the magic wand in this helpless position. Amelia is starting to get worn out, but we're far from finished with her. Next, Feenix ties her stradling a metal horse over a cumbot. As the dildo penetrates her swollen pussy, he adds nipple clamps and crops her back until she screams in pain and pleasure. He turns up the speed on the cumbot and once her pussy is dripping, he adds vibration to her clit but makes her wait to cum until she is shaking and begging his permission. Amelia's day in the dungeon ends with a lot of electricity. She is tied inverted with the TENS unit on her shapely legs while Feenix uses the violet wand to shock her perky breasts and sensitive feet. He crops her while using the electric dildo and the magic wand to make her moan in intense orgasms. When he is finally through, Amelia is shaking and red all over. She later told us that she had to submit, she couldn't control her body at all\n\n\n\nScreens \n        &lt;a href=&quot;\nhttp://www.societysm.com/updates14/AME_021914/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.societysm.com/updates14/AME_021914/index.html&lt;/a&gt;\n\n\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice \n\ncomment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n         &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-) \t","torrent":{"xt":"urn:btih:ad0349b33fec1f68555ca1fc5c7e5170ffa721c7","amp;dn":"Society+SM%5C----SSM+-+Mar+21%2C+2014+-+Amelea+Dark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0349b33fec1f68555ca1fc5c7e5170ffa721c7","infoHashBuffer":{"type":"Buffer","data":[173,3,73,179,63,236,31,104,85,92,161,252,92,126,81,112,255,167,33,199]},"announce":[],"urlList":[]}}