{"title":"2014 - The Year In Christian Music (Bundle 16)","uid":9934283,"size":2185941056,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:adbd95bdb62ad2a5fb6b86ad23e41b747e39e53f&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+16%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorrentTracts","files":291,"time":1397147867,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nBlessedMom recently shared an interesting link speaking on the subject of Switchfoot's new-found position on Christian music.  For anyone who missed it, you can read the article here...\n &lt;a href=&quot;\nhttp://faithlikes.com/2014/04/05/this-is-why-switchfoot-wont-sing-christian-songs-anymore/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://faithlikes.com/2014/04/05/this-is-why-switchfoot-wont-sing-christian-songs-anymore/&lt;/a&gt;\n\nI won't rehash the entire article, but Jon Foreman basically said he believes there is, and I quote, &quot;no such thing as Christian music.&quot;  Say what?!?  He spoke about music being conformed to fit into &quot;boxes&quot;, and suggested that Christ didn't come and die on the cross for his songs.\n\nSometimes when we read articles, we don't truly comprehend the intended message.  But in this case, I'm not sure how anyone can read this article and not conclude that Switchfoot has made a very public statement, perhaps for no other reason than to soften the shock that might be felt among their Christian fan base as they start to branch out to other genres of music.\n\nWhen I first came to know the Lord, I walked around with a pretentious smile on my face.  Almost like I won the lottery.  I was going to Heaven.  Cha-ching.  Hallelujah!  At the time, little did I know that &quot;knowing the Lord&quot; and &quot;knowing of the Lord&quot; are two entirely different things.  And I clearly didn't know the Lord.  But once I grew in my role as a Christian, I learned that everything I do in this lifetime, every gift He has blessed me with, is meaningless if I'm freely not using those gifts to give back to Him.\n\nAfter reading the Switchfoot article yesterday, their message stayed with me throughout the day.  With musical talent as gifted and promising as theirs, why wouldn't they want to glorify Him with every note played, every breath taken, and every lyric penned?  Just as I am called to glorify Him with every talent He has given to me.  After all, the most reiterated command in the Bible is for us to sing our praises to the Lord.  Amen?  So when those amongst us have the God-given talent to literally do just that, why walk away from those commands?\n\nI don't pretend to know much about the music industry.  I'm still baffled how someone can call themselves a &quot;Christian Performer&quot; when only one of their ten album songs speaks of Christ.  And not all ten.  If you went to Church this coming Sunday, and your Pastor chose to speak the entire time about his car problems instead of Christ while standing at the pulpit, wouldn't you question that?  If you went to see a living nativity scene next Christmas, and the coordinator decided to throw some teenage mutant ninja turtles into the mix, wouldn't you question that?  In the same regard, I often question how all ten songs shouldn't be Christ glorifying.\n\nOh well.  What do I know.\n\nPOP: Anthony Evans, Jonny Diaz, Owl City.  ALTERNATIVE: Bennett Autrey, Joe Lane, Sleeping At Last, The Vizion.  HIP-HOP/RAP: DJ I Rock Jesus, Flame, John The Baptist, Lamar Riddick, No Face, P Lo Jetson, TwoSkies.  SINGER-SONGWRITER: Eleos Music.  CONTEMPORARY: Jessa Anderson, Various.  ROCK: Kat Marco, MercyMe, Rush Of Fools.  INDIE: Loud Harp.  PRAISE &amp; WORSHIP: Ryan Edberg.\n\nOur year to date total is now up to 598.\n\nThere are 30 titles being offered today, including...\n\n * Anthony Evans - 2014 - Real Life Real Worship\n * Bennett Autrey - 2014 - I Am - Single\n * Bennett Autrey - 2014 - What Was Broken EP\n * DJ I Rock Jesus - 2014 - It Don't Stop\n * DJ I Rock Jesus - 2014 - Knocking Them Down\n * DJ I Rock Jesus - 2014 - Nerve DJs Exclusive\n * DJ I Rock Jesus - 2014 - Run The Track\n * DJ I Rock Jesus - 2014 - Straight Ministry Heat - Hot Pick\n * DJ I Rock Jesus - 2014 - Straight Ministry Heat - Soul Cafe Soul, Session 1\n * Eleos Music - 2014 - It Is Finished\n * Flame - 2014 - King Of The World - Single\n * Flame - 2014 - What You Mean - Single\n * Jessa Anderson - 2014 - Whole\n * Joe Lane - 2014 - It's Not Half Bad But It's Only Half Good\n * John The Baptist - 2014 - Unbreakable - Single\n * Jonny Diaz - 2014 - Let It Fly\n * Jonny Diaz - 2014 - Whole World - Single\n * Kat Marco - 2014 - Jail Break\n * Lamar Riddick - 2014 - On Fire\n * Loud Harp - 2014 - Asaph\n * MercyMe - 2014 - Welcome To The New\n * No Face - 2014 - Powerless EP\n * Owl City - 2014 - Beautiful Times - Single\n * P Lo Jetson - 2014 - The P Lo Jetson Project I\n * Rush Of Fools - 2014 - Undo - Single\n * Ryan Edberg - 2014 - Give All Of Me - Single\n * Sleeping At Last - 2014 - Atlas 06 - Oceans EP\n * TwoSkies - 2014 - Embassy Life\n * Various - 2014 - Girls Of Grace - Live Love Lead\n * Vizion, The - 2014 - Vizion's Hottest Hits\n\nFor Him,\nTorrentTracts, April 2014\n","torrent":{"xt":"urn:btih:adbd95bdb62ad2a5fb6b86ad23e41b747e39e53f","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+16%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adbd95bdb62ad2a5fb6b86ad23e41b747e39e53f","infoHashBuffer":{"type":"Buffer","data":[173,189,149,189,182,42,210,165,251,107,134,173,35,228,27,116,126,57,229,63]},"announce":[],"urlList":[]}}