{"title":"The Green Mask 1939 Fox Golden Age","uid":8427725,"size":474969353,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:af7ac36be500a303058f8cfe5e8a3ab9e89f2079&amp;dn=The+Green+Mask+1939+Fox+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367398202,"description":"Yup, another one brought back by project Superpowers, I am beginning to think Alex Ross snatched up all the forgotten heroes, whether or not they were any good!  lol\n\nMichael Selby (later Shelby) was an independently wealthy private eye who who became the first Green Mask to fight injustice. He was non-powered, using only his wits and firearms, until he was mortally wounded while trying to protect his father, an influential senator. Senator Shelby sponsored the passage of the bill that would make death sentences mandatory for all gang members, which was why a criminal organization known as the Grim Circle had him assassinated. To save Micheal's life, Professor Lascomb, a friend of the senator, exposed him to vita-rays. Because the machine was overloaded, Michael not only recovered, but he also gained super-strength, super-speed, flight, and limited invulnerability.\n\nA short time later, the Grim Circle assassinated a foreign envoy as part of their plan to provoke the United States into entering World War II. When the Green Mask set out to investigate, the leader of the Grim Circle decided that the masked crime-fighter was too dangerous and decided to assassinate him as well. The criminals hit Green Mask with the bomb, but while the hero survived, Don Tracy, a young orphan, was caught in the blast. Thanks to Green Mask's timely intervention, Professor Lascomb was able to use the vita rays to heal the boy. The grateful Don decided to become Green Mask's sidekick, Domino.\n\nWhen Fox Feature Syndicate returned to publishing after a two year hiatus, Green Mask's title was taken over by Johnny Green. According to his back story, he was the son of Walter Green, the previous Green Mask. Aside from the name and costume, neither of those characters were related to Michael Shelby and his alter-ego. \n\n\nSeed so all may enjoy, sharing is caring","torrent":{"xt":"urn:btih:af7ac36be500a303058f8cfe5e8a3ab9e89f2079","amp;dn":"The+Green+Mask+1939+Fox+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af7ac36be500a303058f8cfe5e8a3ab9e89f2079","infoHashBuffer":{"type":"Buffer","data":[175,122,195,107,229,0,163,3,5,143,140,254,94,138,58,185,232,159,32,121]},"announce":[],"urlList":[]}}