{"title":"Notes Of A Russian Sniper","uid":9801117,"size":2616357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0cfa9ae6a38a7c1889cf5973f65f52baaaab9b7&amp;dn=Notes+Of+A+Russian+Sniper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":14,"uploader":"LoadData","files":3,"time":1395378971,"description":"I searched for this book for a while and could not find it. I bought it and decided to share it with all. I hope you enjoy the book! \n\n\n &lt;a href=&quot;\nhttp://bayimg.com/mAmnhaaff&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/mAmnhaaff&lt;/a&gt;\n\n\n\n\n\n\nAs a sniper, I've killed more than a few Nazis. I have a passion for observing enemy behavior. You watch a Nazi officer come out of a bunker, acting all high and mighty, ordering his soldiers every which way, and putting on an air of authority. The officer hasn't got the slightest idea that he only has seconds to live.'Vassili Zaitsev's account of the hell that was Stalingrad is moving and harrowing. This was a battle to the death - fighting street by street, brick by brick, living like rats in a desperate struggle to survive. Here, the rules of war were discarded and a psychological war was being waged. In this environment, the sniper was king - an unseen enemy who frayed the nerves of brutalized soldiers.Zaitsev volunteered to fight at Stalingrad in 1942. His superiors recognized quickly his talent, and made him a sniper. He adapted his hunting skills to the ruins of the city, watching his prey with nerves of steel. In his first 10 days, Zaitsev killed 40 Germans. He achieved at least 225 kills and the tactics he developed are still being studied.Zaitsev was used a symbol of Russian resistance against the Nazis. His exploits, including a famous 'duel' with a Nazi sniper, remain the stuff of legend. His account is absorbing to anyone interested in World War II and seeing how one person could survive in the most extreme of conditions. returncharacterreturncharacter returncharacterreturncharacter REVIEWS returncharacterreturncharacter&quot;...gives an on-the-ground account of what it was like to be one of Stalingrad's defenders... Both moving and harrowing, this book will appeal to any reader interested in the Second World War.&quot;Book News Inc, 06/2010&quot;Much has been written about the Battle for Stalingrad, but nothing as interesting as this volume by a sniper who was wounded several times, buried alive in a sealed bunker with a number of dead Russian soldiers, and given the permission to start a school for snipers.&quot;Gun Week, 08/2010&quot;...Zaitsev's legendary efforts made him a symbol of Russian resistance against the Nazi's, and his own words reveal how a dedicated and determined man could hold out and fight back even in the most severe situations...highly recommended especially for college library, military history, and military biography collections. &quot;The Midwest Book Review, 08/2010&quot;... of interest to sniper buffs...&quot; Soldier of Fortune, 10/2010 ","torrent":{"xt":"urn:btih:b0cfa9ae6a38a7c1889cf5973f65f52baaaab9b7","amp;dn":"Notes+Of+A+Russian+Sniper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0cfa9ae6a38a7c1889cf5973f65f52baaaab9b7","infoHashBuffer":{"type":"Buffer","data":[176,207,169,174,106,56,167,193,136,156,245,151,63,101,245,43,170,170,185,183]},"announce":[],"urlList":[]}}