{"title":"Samson Complete Fox Publishing Golden Age","uid":8427715,"size":220245301,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b0fbacfbbb13e83d38d0d0572073d7b459397f18&amp;dn=Samson+Complete+Fox+Publishing+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367397816,"description":"yup another hero brought back from the Golden Age dustbin by Alex Ross\n\n\nSamson is a direct descendant of the biblical Samson. Like his ancestor, Samson has immense strength and endurance but loses his powers if his hair is cut. However, the fact that his hair grew back much faster than normal made up for that weakness. Samson did not manifest that ability until he reached college age. That's when his mother revealed his ancestry.\n\nShortly after graduating from college, his college frend, Professor Dunn showed him a new invention, the &quot;iconoscope&quot;, which allowed the viewer to watch remote scenes without a transmitter. The iconoscope picked up the image of an eastern holy man who was praying for a higher power to send someone to battle evil. Samson used his super powers to visit the holy man and agreed to be that champion.\n\nIn issue #10 of Fantastic Comics, Samson gained a young sidekick whom he named David. He had no apparent super powers and was the sole survivor of a plane crash. Orphaned after the crash, Samson took him into his care.\n\nLater, Ajax / Farrell Productions revived several Fox characters, including the Phantom Lady, the Flame (Ajax-Farrell) and Samson (Ajax-Farrell). The second Samson had a modified costume and did not possess the same weaknesses as the first Samson. \n\nSeed so all may enjoy   Sharing is Caring","torrent":{"xt":"urn:btih:b0fbacfbbb13e83d38d0d0572073d7b459397f18","amp;dn":"Samson+Complete+Fox+Publishing+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0fbacfbbb13e83d38d0d0572073d7b459397f18","infoHashBuffer":{"type":"Buffer","data":[176,251,172,251,187,19,232,61,56,208,208,87,32,115,215,180,89,57,127,24]},"announce":[],"urlList":[]}}