{"title":"Strap Some Boyz 2 XXX DVDRip x264-RedSecTioN","uid":9973027,"size":2849047324,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b1541550eee0ea0e46fde83705cc44e5b11414a7&amp;dn=Strap+Some+Boyz+2+XXX+DVDRip+x264-RedSecTioN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":7,"time":1397654058,"description":"&quot;Something about hot women dildo-fucking the asses of masculine men is indescribably perverse. Director Joey Silvera knows the allure of intense pegging sessions with luscious ladies anxious to switch places and teach theoretically authoritative men the value of anal surrender. Strap Some Boyz #2 stars a bevy of stunning women fixated on ruthlessly invading boyz with their big, menacing strap-ons! They soon relish the power that comes from wielding their very own cocks. Charli Piper and busty, young girlfriend Dillion Harper anally exploit their horny teacher, Mr. Kurt Lockwood, in a twisted threesome of pegging and pussy pounding. Naturally buxom Holly Michaels tackles her muscular coach, Robert Axel, eagerly slurping on his big, black cock and exploring his tight ass before milking his throbbing shaft to orgasm. Unsure, Robert visits busty, red-haired MILF Veronica Avluv, who treats his obsession with some unconventional interracial therapy involving a fat dildo and lots of kinky ass-to-mouth fun. Eighteen-year-old Noelle Easton has never pegged a guy before, but she can t resist driving her strap-on up muscular Christian s asshole. The voluptuous beauty oils up her enormous, natural boobs and sodomizes him, getting her sweet pussy well fucked along the way. Wearing long black fetish gloves, vinyl-clad Asian teen Alina Li lubes up kinky Wolf Hudson and reams his bunghole. The sultry minx jacks hot cum from his shaft and licks her spermy fingers clean. Empowering girls one man-ass at a time, Strap Some Boyz #2 is a deeply penetrating experience!&quot;\n\nAlina Li, Dillion Harper, Charli Piper, Holly Michaels, Noelle Easton, Veronica Avluv, Kurt Lockwood, Robert Axel, Christian, Wolf Hudson\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=10391998651338225124.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=10391998651338225124.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=65821373699003888661.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=65821373699003888661.jpeg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b1541550eee0ea0e46fde83705cc44e5b11414a7","amp;dn":"Strap+Some+Boyz+2+XXX+DVDRip+x264-RedSecTioN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1541550eee0ea0e46fde83705cc44e5b11414a7","infoHashBuffer":{"type":"Buffer","data":[177,84,21,80,238,224,234,14,70,253,232,55,5,204,68,229,177,20,20,167]},"announce":[],"urlList":[]}}