{"title":"Vennard - Federal Reserve Hoax - Age of Deception (1980)","uid":8428372,"size":1859887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b23545c4db314b5c4bd12b68e77525f0cdd8a0b8&amp;dn=Vennard+-+Federal+Reserve+Hoax+-+Age+of+Deception+%281980%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"red_gonzo","files":1,"time":1367420306,"description":"This is Wickliffe B. Vennard's explosive book The Federal Reserve Hoax - The Age of Deception (1980) which exposes how the Federal Reserve System clandestinely usurped the US government and its constitution it was supposed to protect. A culmination of author's 30 years of research, it includes little known facts on how the international bankers gained full control over US monetary system with all its consequences. Vennard demonstrates how the world's wars and revolutions are all tied into the scheme for a new world order which is being ruled from top down by international banking institutions. Of them, the American central bank, also known as the Federal Reserve System, has played a pivotal role in 20th century history. This did not come by chance but as a result of a far reaching conspiracy which uses deceptions of all kinds to advance its goals. Vennard traces its origins throughout the history and especially in the last century where their master plan has been laid openly for all to see. The influence of the untouchable international financial institutions has today reached an overall high as millions are pushed to the brink intentionally by their brutal policies. Find out how it all started and how you can legaly and constitutionally defeat their schemes. 320 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:b23545c4db314b5c4bd12b68e77525f0cdd8a0b8","amp;dn":"Vennard+-+Federal+Reserve+Hoax+-+Age+of+Deception+%281980%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b23545c4db314b5c4bd12b68e77525f0cdd8a0b8","infoHashBuffer":{"type":"Buffer","data":[178,53,69,196,219,49,75,92,75,209,43,104,231,117,37,240,205,216,160,184]},"announce":[],"urlList":[]}}