{"title":"Arrow S01E20 XviD [JKS]","uid":8430573,"size":380006171,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3ddf5a4ef90a79c0a54b9b184585011d4ba52e8&amp;dn=Arrow+S01E20+XviD+%5BJKS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jksADIDAS","files":20,"time":1367476183,"description":"Arrow S01E20 XviD [JKS]\n.\nXviD \nEncode Information\nResolution....: 720x404\nVideo : XviD (.avi)\nAudio : MP3 2ch 128Kbps\nFrame Rate : 29.97 fps\n.\nIMDb: http://www.imdb.com/title/tt2193021/\nWiki: https://en.wikipedia.org/wiki/Arrow_(TV_series)\nOfficial: http://www.cwtv.com/shows/arrow\n.\nArrow is an American action-adventure television series developed by Greg Berlanti, Marc Guggenheim, and Andrew Kreisberg. It is based on the fictional superhero Green Arrow, a costumed crime-fighter who appears in comic books published by DC Comics. It premiered in North America on The CW on October 10, 2012, with international broadcasting to take place in late 2012. The series follows billionaire playboy Oliver Queen, portrayed by Stephen Amell, who, after five years of being stranded on a hostile island, returns home to fight crime and corruption as a secret vigilante whose weapon of choice is a bow and arrows. Arrow will also feature appearances by other DC Comics characters. To assist in promotion, a preview comic book was released to tie into the television series.\nOn October 22, 2012, Arrow was picked up by The CW for a full season. On February 11, 2013, Arrow was renewed for a second season by The CW.\n.\nArrow Season 1 Episode 20\nTitle: Home Invasion  Directed by: Kenneth Fink  Written by: Ben Sokolowski &amp; Beth Schwartz  Original air date: April 24, 2013\n...\nLaurel represents the Moore family who are suing a corrupt businessman, Edward Rasmus (Al Sapienza), who cheated the family out of their life savings, but a hit is put out on the family, and the couple's young child is the only one to survive. Laurel takes the boy into her custody until his extended family can be reached, but the hitman (J. August Richards) comes after the boy, who can identify him. Laurel is saved by the vigilante, and Tommy suggests that they all go to Oliver's for protection while the police look for the hitman. A sting operation headed up by A.R.G.U.S is set to capture Deadshot, but Oliver chooses to locate the man responsible for hiring the hitman instead of stopping Deadshot. Feeling betrayed by Oliver for choosing Laurel over him, after Oliver agreed to help Diggle kill Deadshot, Diggle decides to leave Oliver. After killing his client, the hitman comes to the Queen residence to kill all remaining witnesses, but Oliver manages to kill him before he can get to Laurel and the boy. Afterward, Tommy decides to leave Laurel, believing that he could never compete with Oliver should she ever discover that he is the vigilante. Elsewhere, Roy continues his search for the vigilante, and Thea agrees to help after seeing how important it is to him. During a flashback to the island, Shado teaches Oliver to shoot a bow but before his skills can be used as their cover, Yao Fei brings Fyers' men to their hideout to capture them all. Oliver to shoot a bow but before his skills can be used as their cover, Yao Fei brings Fyers' men to their hideout to capture them all.\n","torrent":{"xt":"urn:btih:b3ddf5a4ef90a79c0a54b9b184585011d4ba52e8","amp;dn":"Arrow+S01E20+XviD+%5BJKS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ddf5a4ef90a79c0a54b9b184585011d4ba52e8","infoHashBuffer":{"type":"Buffer","data":[179,221,245,164,239,144,167,156,10,84,185,177,132,88,80,17,212,186,82,232]},"announce":[],"urlList":[]}}