{"title":"Bruckner Symphony no. 5 Thielemann, MPO","uid":9830648,"size":360953927,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3e1a8dbdf3127ab2570b89b7f5dae387f8541c6&amp;dn=Bruckner+Symphony+no.+5+Thielemann%2C+MPO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"magneez","files":5,"time":1395834732,"description":"FLAC + CUE, ripped with EAC\n\n\nrandom review from amazon:\n\n5.0 out of 5 stars Relavatory recording of a wonderful Bruckner symphony June 16, 2005\n\n\nSome of the points offered in the other review of this recording I will echo. My complaint with the other review is his/her obvious affinity and love for Sergiu Celibidache. While I recognize this particular conductor as a pretty good interpreter of Bruckner's music, he is not the end all to his music. If you can put all that aside and get down to what this music says to you we tell a different story.\n\nThieleman's recording, having ascended to the director position of the Munich Philharmonic Orchestra, is a revelation. In the liner notes the conductor talks about his take on recording this great symphony casting aside the notion that this should be viewed as church music and discusses the nature-like quality of this piece. In listening to it in this phrame of reference - it makes sense!\n\nWhat I like about this recording? It is a wonderfully atmospheric recording, full of depth, architecture, and warmth. The strings are sensual at times; biting in others. The brass in particular are right on. And, what so many other recordings lack are achieved in this recording - the low brass and bass instruments are brought out to form a more perfect, wholistic picture. If you want to make the chruch-like comparison - bruckner sculpted his music on this catherdral-esque sound and its achieved in this performance. All the elements are brought together and maintain a beautiful balance throughout. The finale alone is worth playing over and over again. There is so much triumph, regality, and emotion.\n\nBravo to Mr. Thieleman for producing in what is in my opinion the most exciting 5th recording to date. I say this after hearing some outstanding conductors do admirable 5ths like Barenboim, Celibidache, von Karajan, Knapperstbusch, and Wand.\n4 Comments | \nW","torrent":{"xt":"urn:btih:b3e1a8dbdf3127ab2570b89b7f5dae387f8541c6","amp;dn":"Bruckner+Symphony+no.+5+Thielemann%2C+MPO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3e1a8dbdf3127ab2570b89b7f5dae387f8541c6","infoHashBuffer":{"type":"Buffer","data":[179,225,168,219,223,49,39,171,37,112,184,155,127,93,174,56,127,133,65,198]},"announce":[],"urlList":[]}}