{"title":"TSSeduction--TS-34837 Honey FoXXX, TS Jessy Dubai, Jessica Fox, ","uid":9838434,"size":3230978600,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b42a558f5ab6d23c560c673923946b865566a62b&amp;dn=TSSeduction--TS-34837+Honey+FoXXX%2C+TS+Jessy+Dubai%2C+Jessica+Fox%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"merzedes","files":-1,"time":1395948515,"description":"The First EVER TS GANG BANG on TsSeduction.com - The Gangster Gangbang\n\nMar 26, 2014 - Performers: Jessica Fox ,  Sebastian Keys ,  Honey FoXXX ,  TS Jessy Dubai   and  Jimmy Bullet \n\n\nMed, Hi and HD MP4 + Pics.\n\n\nTsSeduction.com presents a feature shoot starring Jessica Fox, Jessy Dubai, Honey Foxxx gangbanging Sebastian Keys and mouth fucking newcomer, Jimmy Bullet. This shoot is the first ever gangbang on TsSeduction and it is incredible. The best thing about a TsSeduction gangbang is that everyone gets fucked - the Ts women fuck each other and they all tear up their man meat, cumming all over his backside. Be forewarned - if you think about this shoot after you watch it, you are likely to get a boner in public just reminiscing about the sex and the hard cocks of these fine ladies. \n\nThe sleepy hollow of Landsend, New York is the perfect place for hustlers - the port access, the unsuspecting community of soccer moms and commuters, cheap waterfront property and above all, small time cops. Cops that are looking to make a bust big enough to get them noticed, get them promoted to the NYPD. The Queen Pins in this operation certainly do not fear the local police - they fear no one. They have heat of their own tucked away in the panties. When the two green cops try and bust into the warehouse fortress, the women barely care. All they can see is a new asshole to fuck, a new backside to cum all over. The cops' botched attempted at arresting these big time criminals ends with them both cuffed and giving up their holes for the taking. \n\nHoney with her massive cock fucks everyone, Jessy with her sexy dominating style cums all over the face of one cop and all over the backside of the other. And Jessica Fox shows her horny self off in hot fashion as she anchors the double anal penetration and sucks all the girls cocks. It's a palooza of sex and so hot and complicated and involved, that you can watch this update 100 times and still see something different. \n\nScreens &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=34837&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=34837&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:b42a558f5ab6d23c560c673923946b865566a62b","amp;dn":"TSSeduction--TS-34837+Honey+FoXXX%2C+TS+Jessy+Dubai%2C+Jessica+Fox%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b42a558f5ab6d23c560c673923946b865566a62b","infoHashBuffer":{"type":"Buffer","data":[180,42,85,143,90,182,210,60,86,12,103,57,35,148,107,134,85,102,166,43]},"announce":[],"urlList":[]}}