{"title":"Zyzzyx Rd (2006) DVDRip","uid":9654214,"size":1670217971,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5d6644a9ac02ea4a82d40ef7f528c767e76c645&amp;dn=Zyzzyx+Rd+%282006%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TFG92","files":-1,"time":1393150136,"description":"Fellow TPB users, I present you the infamous Katherine Heigl-starring 2006 thriller, Zyzzyx Rd., which is well-known for the fact it only grossed $20 in the domestic box office from its estimated $2,000,000 budget.\n\nZyzzyx Rd. follows Grant (Leo Grillo), a family man accountant, who travels to Los Angeles and meets the lascivious &quot;Lolita&quot; Marissa (Katherine Heigl) in a casino. While in the motel with Marissa, her violent ex-boyfriend Joey (Tom Sizemore) surprises them on the bed, hits Grant on the head and kills Joey. Grant brings her body to bury in the desert Zyzzyx Road, but after digging a grave, he finds that the body is missing in the trunk of his car. Grant chases Joey with a shovel in the desert, and when he finds the man hidden in a abandoned mine, Joey discloses a secret about Marissa.\n\nThe film's very limited release was a technical necessity to comply with Screen Actors Guild's regulations. It opened at one theater, Highland Park Village Theater in Dallas, Texas, running for six days, and made $30 at the box office. A crew member who took a friend got a refund, so the final domestic box-office gross was $20 (or the equivalent of three tickets sold).\n","torrent":{"xt":"urn:btih:b5d6644a9ac02ea4a82d40ef7f528c767e76c645","amp;dn":"Zyzzyx+Rd+%282006%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5d6644a9ac02ea4a82d40ef7f528c767e76c645","infoHashBuffer":{"type":"Buffer","data":[181,214,100,74,154,192,46,164,168,45,64,239,127,82,140,118,126,118,198,69]},"announce":[],"urlList":[]}}