{"title":"Men At Play - Executive Pleasures 1","uid":9842678,"size":1198386968,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b6bc22d6688a32a27c3e0dd8ebd6b961c4112868&amp;dn=Men+At+Play+-+Executive+Pleasures+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"alias84yyz","files":1,"time":1396015504,"description":"&quot;Get ready to play! Award-winning website Men at Play present the first volume of their debut DVD collection Executive Pleasures. Jam-packed with six unforgettable scenes, re-mastered and re-edited.\n\nFollow your favorite suited hunks through their working day at the Men at Play offices and enjoy as they suck, fuck and spurt their way up the corporate ladder. Starting with an early morning job interview for Julian, that isn't exactly what he expected, and turns into a hot, hard fucking, over the reception desk. Executive Pleasures 1 takes you through your appointments for the day, with stops at the Men at Play training rooms with Rick and Carlos, the local gym where Ted gives a hungry bottom the fucking of a lifetime with his throbbing nine inches, a horny taxi ride through London with James and a visit with Nathan to the men's room glory hole where he receives a hot sticky facial from a hung stranger.\n\nBut seldom do we get through the working day without some overtime. However, at Men at Play this often turns out to be something to look forward to. Especially for Lucas who falls asleep at his desk and wakes to find his beautiful young P.A. Carl Wilde sucking on his hard dick. Undeniably one of the most memorable Men at Play scenes, with the stunning Carl getting a fucking which you are likely to watch again and again.\n\nAnd if you're still hungry for Carl, check the bonus scenes which include his hot audition where you'll see how he got the nickname of office cum-puppy.&quot;\n\nCast:  Julian Vincenzo, Adam, Carl Wilde, Fred Colcci, James Lee, Lucas, Lucas DiFubbiano, Nathan, Rick Bauer, T.J., Ted Colunga\nDirector:  Matt Jordan\nCountry:  Great Britain\nLength: 1 hr 36 min\nYear: 2006\nStudio :  Men at Play","torrent":{"xt":"urn:btih:b6bc22d6688a32a27c3e0dd8ebd6b961c4112868","amp;dn":"Men+At+Play+-+Executive+Pleasures+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6bc22d6688a32a27c3e0dd8ebd6b961c4112868","infoHashBuffer":{"type":"Buffer","data":[182,188,34,214,104,138,50,162,124,62,13,216,235,214,185,97,196,17,40,104]},"announce":[],"urlList":[]}}