{"title":"Necrobius (Unreleased 1996 Point-and-Click Adventure/Mystery Gam","uid":9777286,"size":589053198,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b96ea07f0fdbe5ca7d79d1154f0c0fb3a8ec3e79&amp;dn=Necrobius+%28Unreleased+1996+Point-and-Click+Adventure%2FMystery+Gam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roninwater","files":-1,"time":1395052226,"description":"Necrobius is an (officially) unreleased 1996 click-and-point adventure/mystery game, featuring psychedelic visuals and cryptic puzzles. It was created by Daniel Auld, now Chief Architect of NeuralEssence LTD. For a time, the game was rumoured to have been released in Japan, though this claim has since been proven false.\n\nThe game is played from the perspective of an unnamed character journeying through the mind of one Professor Necrobius, on a quest to uncover the secret to preventing the death of their planet.\n\nUntil very recently, not a lot more was known about the game, although a demo was found to have been released alongside the July 1995 issue of PC Gamer magazine, available for download throughAs a result of this, following the initiation of an online search effort, I decided to email the creator himself, to try and find out exactly what happened to this game, why it was never released and why it faded into obscurity.\n\nDaniel Auld was very kind in promptly responding to my email, answering many questions about the game. He revealed that the game had not been released in Japan, but was rather in the works with a Japanese company early on, before being revoked and transferred to Microprose, in the U.S. It was also revealed that the game was roughly 95% percent complete (ie. completable start to finish, but still in need of a little polishing), but nearing the official release had become &quot;bogged down in legal wrangling&quot;, resulting in its release being postponed indefinitely, in what Auld describes as a &quot;very cut throat and quite dishonest&quot; industry. Notably, an official strategy guide, (written by Steven Schwartz), was discovered by online sleuths to have been in the works and was perhaps even completed before the game's cancellation, with an intended release of June 1995.\n\nDaniel then went on to confirm that he was still in possession of beta copies of the game circa May 1996 and that said beta (utilising the Macromedia Director engine) was compatible with Mac OS 9 and most Windows releases (with the exception of Windows 7, in which &quot;the transitions are ugly&quot;).\n\nLargely unexpecting of actually receiving the game, I decided to ask him if it was possible to purchase a copy of the beta, or whether it was still tied up in legal issues. To my delight, not only was he willing to provide me with a copy, but he was willing to do so free of charge. Elated, I promptly accepted his gracious offer and roughly one week later a copy of the game turned up in my mailbox, just as promised; it even came with a printed out inlay!\n\nSo, upon receiving the game a few days ago, I decided to query Auld on what his stance would be on me 'leaking' the game to the public, to which he replied favourably, stating that he was perfectly happy for me to do so, as &quot;the whole point of making Necrobius was for as many people as possible to enjoy it, so it was quite disappointing when the distribution got shut down&quot;.\n\nPerhaps now Necrobius will finally get the recognition it deserves, as a classic game from fond days of old. The disc image is available for download viaplease feel free to contact me if you have any trouble getting it to run and I will attempt to advise you on remedying the situation. Big, big thanks to Daniel Auld, without whom we would not have a playable, near-complete version of this fascinating game, (nor would it even exist, for that matter).\n\nEnjoy!\n\n-dycaite, lostmedia.wikia.com","torrent":{"xt":"urn:btih:b96ea07f0fdbe5ca7d79d1154f0c0fb3a8ec3e79","amp;dn":"Necrobius+%28Unreleased+1996+Point-and-Click+Adventure%2FMystery+Gam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b96ea07f0fdbe5ca7d79d1154f0c0fb3a8ec3e79","infoHashBuffer":{"type":"Buffer","data":[185,110,160,127,15,219,229,202,125,121,209,21,79,12,15,179,168,236,62,121]},"announce":[],"urlList":[]}}