{"title":"Slut Whore Airport Cleaner Squeals For Peanuts","uid":10048612,"size":894864652,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b9bafb8aa6410a074d142837f6943ae9d945e2fb&amp;dn=Slut+Whore+Airport+Cleaner+Squeals+For+Peanuts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":-1,"time":1398575358,"description":"Lita was a cleaner at the airport, in charge shining of the glass division between the arrivals and departures lines. She would see all these uncouth foreigners coming into the nation, some would smile at her and others would leer at her. In their first steps into the country they would see a pretty little girly halfheartedly cleaning glass. She would see other foreigners leaving the nation, often accompanied by their low class slut whore girlfriends. So Lita resolved, she could fuck foreigners for money. She was not paid well at the airport, and let the baggage handling boys fuck her for free in the unclaimed baggage department. A lot of fucking went on in the unclaimed baggage department, as it was outside the main terminal on the runway side. A girl could squeal as much as she wanted and no one would hear. Lita, as much as any airport cleaner learned to associate sex with moaning and screaming. So here is Lita in my hotel room, pleased to be working as a low class slut whore, for marginally better money than she is used to. See her shine my cock with spit and saliva. Hear her squeal on high def video. ","torrent":{"xt":"urn:btih:b9bafb8aa6410a074d142837f6943ae9d945e2fb","amp;dn":"Slut+Whore+Airport+Cleaner+Squeals+For+Peanuts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9bafb8aa6410a074d142837f6943ae9d945e2fb","infoHashBuffer":{"type":"Buffer","data":[185,186,251,138,166,65,10,7,77,20,40,55,246,148,58,233,217,69,226,251]},"announce":[],"urlList":[]}}