{"title":"Society SM----SSM - Mar 15, 2014 - Courtney Shea","uid":9880965,"size":1295648416,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ba226bb7b1508e8d328f5976653e0bf0aab93fec&amp;dn=Society+SM%5C----SSM+-+Mar+15%2C+2014+-+Courtney+Shea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1396548149,"description":"Society SM  SSM - Mar 15, 2014 - Courtney Shea\n\n\n\nMp4  540 and 720 + Pics\n\n\nFeisty Courtney is used to doing whatever she wants, whenever she wants and Feenix is going to teach her that that's not how it works at Dungeoncorp. He starts off by stringing her up, leaving one leg free. He electrifies her with the TENS unit, canes and spanks her. As he vibrates her plump pussy, she cums once without permission, so Feenix teaches her about obedience by pulling a few more orgasms out of her weakened body. Next, she is strapped into a backbend. She is flogged and covered in clothespins. Feenix attaches her pussy lips to her toes and canes her clit until she is whimpering in pain. But the pussy torture is not through just yet...Feenix puts a weighted crotch rope on her sensitive pussy lips as he whips her a bit longer until she finally apologizes for her disobedience. Courtney refuses to address Feenix as Sir, so he continues her punishment. She is put in a neck stock and the ball gag is removed and she is flogged until, in tears, she finally submits and calls him by his proper title. Now that she is cooperative and submissive, she is allowed some pleasure and she takes it, moaning through some intense orgasms. But she disobeys again. Finally, Feenix secures Courtney in some predicament bondage, pussy and ripe breasts exposed for some more torment and a final chance to to obey. He electrifies, clamps and vibes her until she is desperetly trying to keep from cumming. Feenix will allow it, but she has to say please, and call him Sir. In the end, she gives up her disobedience and gives in to the pleasure\n\n\n\nScreens \n       &lt;a href=&quot;\nhttp://www.societysm.com/updates14/COU_021214/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.societysm.com/updates14/COU_021214/index.html&lt;/a&gt;\n\n\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice \n\ncomment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n        &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-) ","torrent":{"xt":"urn:btih:ba226bb7b1508e8d328f5976653e0bf0aab93fec","amp;dn":"Society+SM%5C----SSM+-+Mar+15%2C+2014+-+Courtney+Shea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba226bb7b1508e8d328f5976653e0bf0aab93fec","infoHashBuffer":{"type":"Buffer","data":[186,34,107,183,177,80,142,141,50,143,89,118,101,62,11,240,170,185,63,236]},"announce":[],"urlList":[]}}