{"title":"XXX.Fucktory.The.Auditions.XXX.DVDRip.x264-CiCXXX","uid":9737610,"size":2657600279,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bbc88a963c976d40f4cad22337c4c7027a36f4eb&amp;dn=XXX.Fucktory.The.Auditions.XXX.DVDRip.x264-CiCXXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":5,"time":1394463689,"description":"Smut world legend Rocco Siffredi and his band of horny Euro-studs are hot to test out a new group of gorgeous female applicants. showcases some of the most beautiful women from all over the world, all learning Rocco's way of intensely sensuous anal hard-core. The fine ladies in this multicultural cast get their lovely asses thoroughly serviced, Italian style! Gorgeous, kimono-clad Japanese model Marica Hase isn't quite sure what to make of American madman Mike Chapman, but the Asian cutie is soon gagging on his huge black cock, eagerly riding him, getting fucked in every hole. After a rough interracial ass reaming, Marica opens wide and receives a huge, messy cum facial. Next, two beautiful Hungarian models, blonde Blue Angel and dark-haired April Blue, treat Rocco to a nasty threesome brimming with ass-to-mouth cocksucking. Young Italian beauty Valentina Nappi meets Mike in her first-ever scene, never before released. The naturally busty, bikini-clad darling obediently takes Mike's massive member inside her sweet pussy and up her plump, womanly rear. Hungrily she sucks his throbbing pole before swallowing a mouthful of cum. Short-haired, busty cutie Emylia Argan gets off to a bad start with young stud Marcus, but it's not long before she's slurping on his cock, squeezing the shaft between her soft tits. Marcus impales her tender butt, ramming Emylia as her fine jugs jiggle. Rocco Siffredi's &quot;XXX Fucktory: The Auditions&quot; is a freewheeling feast of anal antipasto cooked up by porn's master chef.\n\nMarica Hase, Mike Chapman, Blue Angel, April Blue, Rocco Siffredi, Valentina Nappi, Emylia Argan, Marcus\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=85339489178283700274.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=85339489178283700274.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=55656639314642184750.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=55656639314642184750.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:bbc88a963c976d40f4cad22337c4c7027a36f4eb","amp;dn":"XXX.Fucktory.The.Auditions.XXX.DVDRip.x264-CiCXXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc88a963c976d40f4cad22337c4c7027a36f4eb","infoHashBuffer":{"type":"Buffer","data":[187,200,138,150,60,151,109,64,244,202,210,35,55,196,199,2,122,54,244,235]},"announce":[],"urlList":[]}}