{"title":"Hostage (2005) DVD9 PAL ENG GER","uid":9933637,"size":7921457152,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bc8fb0e256c870244f1c78064caa7aa27c31a071&amp;dn=Hostage+%282005%29+DVD9+PAL+ENG+GER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1397139588,"description":"audio: english,german DTS\n\n\nsubs: english,german\n\n\n\nHostage is a 2005 thriller film with Bruce Willis that was directed by Florent Emilio Siri. The film was based on a novel by Robert Crais, and was adapted for the screen by Doug Richardson.\n\nThe film's plot is roughly the same as the novel; the main difference is that a complicated subplot involving the Mafia was removed and the ages of the first group of hostage-takers was lowered slightly. In the novel, Smith's employer is Sonny Benza, a crime overlord whose influence reaches throughout the entire West Coast.\n\nFormer SWAT officer Jeff Talley is a hostage negotiator in Los Angeles. Talley is negotiating with a man who has taken his wife and son hostage after learning she has been cheating on him. Talley denies a SWAT commander's request to give snipers the green light to take out the suspect. There are three gunshots in the house. Talley runs through the barricaded door and finds the man and his wife dead. In the boy's room he finds the son, who passes away in Talley's arms. This leaves Talley emotionally scarred. He moves with his family to become police chief in Bristo Camino, a peaceful suburban hamlet in Ventura County, California.\n\nA year after the incident, Talley finds himself in another hostage situation. Two teenagers, Dennis and his brother Kevin, and their mysterious accomplice Marshall &quot;Mars&quot; Krupcheck take hostage Walter Smith and his two children, a teenager Jennifer and a young child Tommy, in Smith's house after a failed robbery attempt. The first officer to respond, Carol Flores, is brutally shot twice by Mars just before Talley and a fellow officer arrive. Talley attempts to rescue the seriously injured officer, who dies in front of him. Traumatized and unwilling to put himself through yet another life-or-death situation, Talley hands authority over to the Ventura County Sheriff's Department and leaves.","torrent":{"xt":"urn:btih:bc8fb0e256c870244f1c78064caa7aa27c31a071","amp;dn":"Hostage+%282005%29+DVD9+PAL+ENG+GER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc8fb0e256c870244f1c78064caa7aa27c31a071","infoHashBuffer":{"type":"Buffer","data":[188,143,176,226,86,200,112,36,79,28,120,6,76,170,122,162,124,49,160,113]},"announce":[],"urlList":[]}}