{"title":"Society SM----SSM - Apr 11, 2014 - Scarlett Fay","uid":9982136,"size":1498104236,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:bcc1a4252d394fec03510bc2df0526831d79f8aa&amp;dn=Society+SM%5C----SSM+-+Apr+11%2C+2014+-+Scarlett+Fay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1397751477,"description":"Society SM  SSM - Apr 11, 2014 - Scarlett Fay\n\n\n&quot;Tightly Bound&quot;\n Scarlett Fay\n\n\n\nMp4  540 and 720 + Pics\n\n\nScarlett is a super sexy, young girl with creamy skin and an ass for days. We have worked with her before and know that she can take some pain. Feenix starts her off rigged standing up, nearly hanging by her hair, but she skirms too much so he decides to tighten her bindings, attaching her from all sides to the metal rig. Once he is satisfied that she can't move an inch he brings out the mini vibe but only to tease and deny her the privledge of an orgasm. Next, We rig her bent over with her big, plump rear end and soft pink pussy exposed for torment. Feenix adds heavily weighted nipple clamps before flogging, caning and tickling her lovely backside and feet. He lubes up the magic wand in a pool of Scarlett's drool and uses it to bring her to a screaming painful orgasm. Then we put her back in a standing rig with much less support from her feet, testing her hair suspension abilities further. Feenix uses the violet wand to electrcute her toes and soaking pussy. He puts on an incredibly tight crotchrope to warm her up while he canes clothespins running up and down her slender waist. Once he thinks she can't handle any more pain, he leaves her there to cum alone with a Hitachi affixed to the crotchrope. Poor Scarlette is beat and ehausted but we're not quite through using her pretty body yet. Finally she is suspended spread eagle in the center of the metal rig.with the TENS unit electrifying her supple thighs and the breast pumps sqeezing her tits.When she is in tears from the pain, Feenix gives her one last burst of pleasure with the dick stick combo, but not before making her beg him first\n\n\nScreens \n           &lt;a href=&quot;\nhttp://www.societysm.com/updates14/SCA_032514/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.societysm.com/updates14/SCA_032514/index.html&lt;/a&gt;\n\n\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice \n\ncomment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n            &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-) ","torrent":{"xt":"urn:btih:bcc1a4252d394fec03510bc2df0526831d79f8aa","amp;dn":"Society+SM%5C----SSM+-+Apr+11%2C+2014+-+Scarlett+Fay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcc1a4252d394fec03510bc2df0526831d79f8aa","infoHashBuffer":{"type":"Buffer","data":[188,193,164,37,45,57,79,236,3,81,11,194,223,5,38,131,29,121,248,170]},"announce":[],"urlList":[]}}