{"title":"Obedience.School.XXX.DVDRip.x264-Pr0nStarS","uid":8422898,"size":1904387199,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bd26b5582ccbcc73625760bc9cf5f3ec7e3f6f34&amp;dn=Obedience.School.XXX.DVDRip.x264-Pr0nStarS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1367255521,"description":"Category Fetish, Bondage, P.O.V. - Point of View \n  \nDirector Kevin Moore \nStarring Dana DeArmond, Lea Lexis, Gia Dimarco, Mr Pete, Lezley Zen, Derrick Pierce, Michael Vegas, Alec Knight, Danny Wylde, Maddy O'Reilly, Kendra Lust, Bonnie Rotten, Dani Woodward, Kevin Moore, Billy Hart \n\nPOV fetish maestro Kevin Moore has expanded his repertoire - the creator of the fetishy 'Panty Pops' and 'Titty Creampies' series brings his kinky sensibility to the ambitious, artistic 'Obedience School,' which combines depraved D/s fantasies, Hollywood production values and hard-hitting, Evil Angel-style sex. In the four lengthy, fully developed scenes of this double-disc marathon, gorgeous, lustful XXX starlets immerse themselves in wicked scenarios predicated on the issue sexual control. The first two scenes originate in an oppressive religious school and show the dark consequences of repression. Busted with a batch of porn DVDs, students Billy Hart and Michael Vegas get hauled into detention... where they take control of their preachy teacher!\n\nDelectable brunette Kendra Lust succumbs to her lewd inclinations as the boys deliver a rough double-dicking and loads of cream across her spectacles. After the school's sanctimonious director chastises provocatively dressed secretary Gia DiMarco, she snaps and kidnaps him. Busty Gia partners with striking, fabulously tattooed Bonnie Rotten to humiliate Danny Wylde, insult his god and take his control. The girls get their asses sodomized, symbolizing their conquest of a hypocrite. (In shocking cutaways, the girls see themselves made up with exquisite Dia de los Muertos masks as they dominate pathetic Danny.) At an eerie, bondage-style masquerade orgy, Dana DeArmond and Lea Lexis both get double-penetrated as masked guests watch. And auburn-haired girl-next-door Maddy O'Reilly gives up control, living out her nasty intruder fantasy. 'Obedience School' artfully details the thrill of power exchange. \n\n\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=psobdschoo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=psobdschoo.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=psobdskxk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=psobdskxk.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.fastpics.net/?v=psobdsnln.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fastpics.net/?v=psobdsnln.jpg&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:bd26b5582ccbcc73625760bc9cf5f3ec7e3f6f34","amp;dn":"Obedience.School.XXX.DVDRip.x264-Pr0nStarS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd26b5582ccbcc73625760bc9cf5f3ec7e3f6f34","infoHashBuffer":{"type":"Buffer","data":[189,38,181,88,44,203,204,115,98,87,96,188,156,245,243,236,126,63,111,52]},"announce":[],"urlList":[]}}