{"title":"The Strongman Collection Complete  1940 Holyoke Golden Age","uid":8488279,"size":200941823,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bea680acbe779bab71357c86e41c1d158d21d327&amp;dn=The+Strongman+Collection+Complete++1940+Holyoke+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1368932885,"description":"another of the characters that Alex Ross took from Golden Age obscurity for Project Superpowers:\n\nPercy van Norton was an American playboy who acquired a secret book of yogi. He studied it for years until he became the world's most perfect man. He has the strength of 100 elephants, the speed of a race car, and skin as tough as rhino hide. He put his super strength and genius-level mind to work fighting crime and foreign invasions. He also carried a boomerang rope.\n\nIn Crash Comics #3, he stopped &quot;Aissur&quot; (a transparent Soviet Union proxy - read it backwards) from invading the nation of Rutania by defeating Aissurian troops and coercing it's leader, &quot;Linats,&quot; into making peace. In Crash Comics #5, he stopped a thinly veiled Nazi Germany proxy from invading a thinly veiled Poland proxy. In both cases, he managed to stop the invasion in the span of a few hours, and his friends were none the wiser.\n\nLike many bored playboy characters, Percy passes himself off as a weak, generally useless hedonist among his society friends. He constantly travels in a company of a small entourage that usually includes at least two women who find him charming (if useless). During the first three issues of Crash Comics, he wore a monocle in his civilian ID, presumably for the same reason as Clark Kent wore glasses. ","torrent":{"xt":"urn:btih:bea680acbe779bab71357c86e41c1d158d21d327","amp;dn":"The+Strongman+Collection+Complete++1940+Holyoke+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bea680acbe779bab71357c86e41c1d158d21d327","infoHashBuffer":{"type":"Buffer","data":[190,166,128,172,190,119,155,171,113,53,124,134,228,28,29,21,141,33,211,39]},"announce":[],"urlList":[]}}