{"title":"FUSE.XBOX360-COMPLEX","uid":8505895,"size":7870868544,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:beee91c698826bded4787127d898234a4ad72a35&amp;dn=FUSE.XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kPulsate","files":82,"time":1369420797,"description":"Fuse \n\n\n================================================= ========== \n----- Information for \n\n\n\nInsomniac Games Razprostranitel : Electronic Arts Date on the emission of : 24.05.2013 Genre : Action Type : XGD3 REGION : Free Hack : LT +3 Description What happens when humans take possession of volatile alien technology they were never meant to have? Find out the hard way in Fuse, a four-person co-op action shooter that puts players in command of contact team Overstrike 9 - four elite agents, each with their own unique skills and experimental weapons. In story-driven, cooperative action, players must thwart a rogue paramilitary organization called Raven from stealing the deadly alien energy source known as Fuse. Your Team - Dalton Brooks, Izzy Sinclair, Jacob Kimble and Naya Deveraux - Will Pursue Raven around the World, from the fortified Desert Facility to underwater bases, Strongholds Island, Icy Mountain peaks, palatial hideouts and Beyond. Even solo players can Experience the unique attributes of each agent by using the game's LEAP feature to switch between the four characters at will during combat. Each agent is equipped with unique skills and weapons not only integral for survival, but that also allows for unexpected and extraordinary results. Experimental Fuse weapons give players unique capabilities that expand their strategic options in and out of combat. Players can play either online or offline and level up along unique character paths, allowing players to unlock more powerful Fuse-driven abilities as the game progresses. In addition, the game's progression system is Unified Between different play modes, Allowing players to Continue Improving Their Agents regardless of how They play. ","torrent":{"xt":"urn:btih:beee91c698826bded4787127d898234a4ad72a35","amp;dn":"FUSE.XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beee91c698826bded4787127d898234a4ad72a35","infoHashBuffer":{"type":"Buffer","data":[190,238,145,198,152,130,107,222,212,120,113,39,216,152,35,74,74,215,42,53]},"announce":[],"urlList":[]}}