{"title":"Reality Kings - Money Talks - Off Season.mp4","uid":8418705,"size":370024299,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c05e6e82a9a58747ebbb409b8d6b0f304553ee11&amp;dn=Reality+Kings+-+Money+Talks+-+Off+Season.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Q88.","files":1,"time":1367119074,"description":"Release date: 31/03/2009\n\nRating: 9.4\n\n&quot;Welcome once again to Money Talks annual spring break coverage. This week we travel down to wild and crazy Mexico in search of some hot spring break action. First up we convince a hot little blond with a perfect little rack to get licked up and down and become our very own human body shot. Then we do the unthinkable... We actually found a spring breaker crazy enough to stick a smoking hot chile habanero in his butt and then eat it. Too bad he didnt know that Havoc bit the tip off before she shoved it in there. After that we have a no holds barred full contact game of topless football. For our last stunt we actually ran into a loyal Money Talks viewer who was willing to do basically anything for money, and who are we to disappoint a true fan. So we had him get on all fours and Havoc kicked him in his huevos. We love running hilarious bits here on the show but a spring break update wouldnt be complete if we didnt find at least one smoking hot college coed willing to take things to the next level. Her name is Scarlett and she made our entire trip worth while. Everything you are about to watch is completely real. Enjoy.&quot;","torrent":{"xt":"urn:btih:c05e6e82a9a58747ebbb409b8d6b0f304553ee11","amp;dn":"Reality+Kings+-+Money+Talks+-+Off+Season.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c05e6e82a9a58747ebbb409b8d6b0f304553ee11","infoHashBuffer":{"type":"Buffer","data":[192,94,110,130,169,165,135,71,235,187,64,155,141,107,15,48,69,83,238,17]},"announce":[],"urlList":[]}}