{"title":"(Full stream) Coast to Coast AM 05-02-2013  Honeymoon Effect","uid":8434848,"size":53109497,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c2d046d879e1143d3cbfa6dc2b46ae375427b1d3&amp;dn=%28Full+stream%29+Coast+to+Coast+AM+05-02-2013++Honeymoon+Effect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pyramid91","files":5,"time":1367596806,"description":"Coast to Coast AM for May 02, 2013. The Honeymoon effect\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nThis is  a full rip of the stream (WMA) that Coast to Coast AM provides to such loyal members to their shows. It has been converted and merged together into mp3 files, however, to give you the experience you should be getting through the show mp3 archives. Instead, originally you get all bumper music erased, and a quality which takes out all bass (making George Noory sound as though he's coming through a crappy radio speaker)\nThis is what the Coast experience should be. And you can get it... absolutely free. Enjoy!\n\nShow for: May 02, 2013\nShow description:\nHost:\nGeorge Noory\nGuests:\nBruce Lipton, Dr. Roger Leir\nBruce H. Lipton, Ph.D, is an authority in bridging science and spirit, and a leading voice in new biology. He shared his belief that if we use the 50 trillion cells that live harmoniously in the human body as a model, we can create not just honeymoon relationships for couples but also a &quot;super organism&quot; called humanity that can heal our planet. This evolution is not a physical one that will alter our bodies, but one in consciousness and expanded awareness, bringing changes beyond what we can imagine, he envisions. \nHe described the 'honeymoon effect' as a state of bliss and energy resulting from love, which is part of our biological imperative. Being in love actually produces certain chemicals in the body like oxytocin and vasopressin which contribute to feelings of pleasure and well being, he noted. While for most, the 'honeymoon effect' is short-lived, he argues that we can, through conscious choice, sustain this wonderful state throughout our lives. \nThe main thing that holds people back, he suggested, is they are often operating from the subconscious programming of their mind, imprinted from the first seven years of their life. This &quot;default&quot; state is based on other people's thoughts such as parents rather than oneself, he said. People can be encoded with negative belief structures in their subconscious such as they are not worthy, which can lead to sabotaging behaviors, he continued. Lipton also reviewed his groundbreaking work in epigenetics, and his contention that genes can be rewritten or revised to reflect health and well-being. \nCitizen Hearing on Disclosure\nFirst hour guest, ufologist Dr. Roger Leir reported on the Citizen Hearing on Disclosure being held this week in Washington DC, with a wide array of witnesses and experts giving testimony in front of a committee of former US congressional members. Attendance has been good, and live streaming on the web is also available, he said. There's been discussion at the Hearing to push for a draft to be presented at the United Nations, he announced. On Thursday, there were presentations from countries outside the US, and Leir said he was particularly impressed by the openness of South American countries such as Uruguay, which sends military personnel out to schools to teach students about UFOs and ET life. \nNews segment guests: Robert Felix, Neil Slade \nWebsite(s):\nbrucelipton.com\nalienscalpel.com\nBook(s):\nThe Honeymoon Effect\nThe Biology of Belief\nSpontaneous Evolution: Our Positive Future (and a Way to Get There from Here) \nUFO Crash in Brazil","torrent":{"xt":"urn:btih:c2d046d879e1143d3cbfa6dc2b46ae375427b1d3","amp;dn":"%28Full+stream%29+Coast+to+Coast+AM+05-02-2013++Honeymoon+Effect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d046d879e1143d3cbfa6dc2b46ae375427b1d3","infoHashBuffer":{"type":"Buffer","data":[194,208,70,216,121,225,20,61,60,191,166,220,43,70,174,55,84,39,177,211]},"announce":[],"urlList":[]}}