{"title":"Masetti - In the Pirate's Den - My Life as Secret Agent for Cast","uid":8432462,"size":2687462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3701781e84afaa9867d1e525a9833d7742a9b55&amp;dn=Masetti+-+In+the+Pirate%27s+Den+-+My+Life+as+Secret+Agent+for+Cast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"red_gonzo","files":1,"time":1367534050,"description":"This is Jorge Masetti's shocking book In the Pirate's Den - My Life as a Secret Agent for Castro (1993) which provides an unique window into the illegal world of Cuban's communist secret service. The author joined the notorious Americas Department, entering what he calls &quot;the pirate's den&quot; as a secret agent for Fidel Castro. In this riveting book, the reader is taken inside the war room of the Cuban revolution. Masetti served in Angola and other war zones in the 1980s. He was also an adviser with groups such as the M-19 guerrillas in Columbia and the Sandinistas. In addition to shedding light on the machinations of the Castro government, it is also a compelling story of a crisis in a revolutionary faith. In the Pirate's Den is the result of that painful introspection, a page turning chronicle of a remarkable journey into and out of the Cuban revolution. It's filled with accounts of international intrigue, drug smuggling, counterfeiting U.S. dollars and international missions for Cuban Intelligence that often extended into war zones. 165 pages, few pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:c3701781e84afaa9867d1e525a9833d7742a9b55","amp;dn":"Masetti+-+In+the+Pirate%27s+Den+-+My+Life+as+Secret+Agent+for+Cast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3701781e84afaa9867d1e525a9833d7742a9b55","infoHashBuffer":{"type":"Buffer","data":[195,112,23,129,232,74,250,169,134,125,30,82,90,152,51,215,116,42,155,85]},"announce":[],"urlList":[]}}