{"title":"Hardtied--Pampered Penny Part 1  Penny Barber Low iPod","uid":9795123,"size":1268897197,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c376ecf86b13b3786198876e43e4815fae532234&amp;dn=Hardtied--Pampered+Penny+Part+1++Penny+Barber+Low+iPod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1395304778,"description":"\nPampered Penny Part 1 | Penny Barber\n\nMarch 19, 2014\n\n\niPod and Low MP4 + Pics.\n\n\nHow many times have we seen this act from Penny Barber? We've got a few questions and before the bondage and discipline have even started she has gone into full sassy bitch mode. It's obvious why she does it. In her daily life she is so hot it is intimidating. Her tits, her ass, her smile, they're all the kind that have men falling all over themselves to please her. Add in her attitude and they'll give her whatever she wants.\n\nIn the bondage world that attitude and banging body get her exactly what she needs, which is to be put in her place. OT doesn't even bother talking to her while she talks and taunts. The rope will say everything he wants to. \n\nWhen she is standing a rope around her neck keeps Penny in place for the whip. This mouthy little slut shuts up pretty quickly when she starts to feel that sting. It's a one way ticket to subspace for her. At least the rush of endorphins keeps her quiet for a few minutes. She tries to stay stoic but the tears welling up in her eyes and running down her cheeks tell the full story.\n\nOnce she is bound on her back Penny opens up again. She has all kinds of things to say to OT, trying to taunt him into giving her the cock she craves so much. She's earned some time with the celebrator and a dildo, but not without the pain of a cane across her ass and feet. Of course she wants to be sassy throughout the experience, but OT just ignores her and keeps working on her body.\n\nAnd then comes the part Penny has been dreading all day. Hoods and boxes give her anxiety. They have the tears flowing down her face again and they don't even hurt. But OT has no sympathy. It's important to him that he put away his toys when he's done and Penny is just about all used up. He'll be unpacking her again over at InfernalRestraints.com soon. \n \nScreens &lt;a href=&quot;\nhttp://hardtied.com/hogtied/bondage/2014/03_19pbarber/Hardtied-Penny-Barber-Pampered-Penny-Part-1.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hardtied.com/hogtied/bondage/2014/03_19pbarber/Hardtied-Penny-Barber-Pampered-Penny-Part-1.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:c376ecf86b13b3786198876e43e4815fae532234","amp;dn":"Hardtied--Pampered+Penny+Part+1++Penny+Barber+Low+iPod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c376ecf86b13b3786198876e43e4815fae532234","infoHashBuffer":{"type":"Buffer","data":[195,118,236,248,107,19,179,120,97,152,135,110,67,228,129,95,174,83,34,52]},"announce":[],"urlList":[]}}