{"title":"Sexually BrokenCute 20yr sex destroyed. deep throating,Kristine","uid":8425892,"size":2246131890,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c501ed4c5afd2db501329b6babd04a93c9193f00&amp;dn=Sexually+Broken%5CCute+20yr+sex+destroyed.+deep+throating%2CKristine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1367345613,"description":"Cute 20yr old girl next door gets completely sex destroyed. Brutal deep throating, hard fucking! | Kristine Kahill | Matt Williams\nApril 29, 2013\n\n\nLower bitrate MP4 and High bitrat MP4 + Lowres iPod + Pics.\n\n\nWe are excited to welcome Kristine Kahill to Sexually Broken. This 20yr girl next door is as cute and innocent looking as they come. The best part about this entire situation is she twitter stalked us for the work. When cute, little, innocent girls seek you out, then you know they love the subject matter. \n\nKristine wanted to be challenged. Cock challenged, and roughly challenged at that. At only 20 years old, this tiny girl wanted us to destroy her with cock and orgasms. What you see before you is the result of that innocent desire.\n\n The phrase &quot;Careful what you wish for&quot; has never been more accurate in this case. As our &quot;Meet &amp; Greet&quot; will clearly demonstrate. We start Kristine in the chair with what she actually wore to the studio. Her hands are bound tightly to her thighs, she has on a sexy neck rope, and her legs are bound spread to the chair. The first thing you notice is this girl wore no panties today. \n\nWe blindfold her, gag her and play with her neck a bit. We never cut off her air supply but we apply some nice, scary pressure for our warm up. Looking at this helpless 20 year old piques our interest so we slam our interest down her throat repeatedly. \n\nKristine is going to find out what a rough blow job is. Completely helpless, we throat fuck Kristine into subspace. Nonstop skull fucking. Kristine struggles, the cock is ruthless, deep throat spit soon coats our cute girl next door. \n\nWe get her out of the chair and on to her knees before the cock. We make her worship the cock with her mouth, never letting up. This is most intense throat fucking Kristine has ever received, and there is no sign of it letting up. \n\nWith her eyes glazed over, dazed, we yank her to her feet, bend her over and with one hard stroke the cock is balls deep into her pussy. We fuck her to her first orgasm, then put her over a stool and continue the throat fucking while her head is upside down, a first for our cutie. \n\nKristine is overwhelmed with cock. We fuck her throat balls deep over and over. Soon Kristine's mouth just hangs opens, her eyes glazed, as the cock fucks at will. We flip her over and bind her with her ass up and out. We can still deep throat her mouth and fuck her silly. Back and forth the cock punishes the pussy and the throat. Kristine experiences being used and used hard. We make her cum with the vibrator and that is all she wrote for our cute 20 year old. With liquid oozing out of both her holes, helpless and severely cum drunk, we leave her bound, waiting and dripping... \n\n \nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/04_29kkahill/SexuallyBroken-Kristine-Kahill-Matt-Williams-Cute-20yr-old-girl-next-door-gets-completely-sex-destroyed-Brutal-deep-throating-hard-fucking.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/04_29kkahill/SexuallyBroken-Kristine-Kahill-Matt-Williams-Cute-20yr-old-girl-next-door-gets-completely-sex-destroyed-Brutal-deep-throating-hard-fucking.php&lt;/a&gt;\n\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  ","torrent":{"xt":"urn:btih:c501ed4c5afd2db501329b6babd04a93c9193f00","amp;dn":"Sexually+Broken%5CCute+20yr+sex+destroyed.+deep+throating%2CKristine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c501ed4c5afd2db501329b6babd04a93c9193f00","infoHashBuffer":{"type":"Buffer","data":[197,1,237,76,90,253,45,181,1,50,155,107,171,208,74,147,201,25,63,0]},"announce":[],"urlList":[]}}