{"title":"Hydroman by Bill Everett  COMPLETE Eastman Golden Age","uid":8422902,"size":1450059015,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c9d7a40e232303a769fc216f6f3de30edc0406ae&amp;dn=Hydroman+by+Bill+Everett++COMPLETE+Eastman+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367255639,"description":"A very cool creation by Bill Everett.  If you don't know who that is, he created Marvel's Sub Mariner.\n\nThis Character Lapsed into Public Domain till Alex Ross Scooped him up and did his project Superpowers thang!\n\nHarry Thurston, a young chemical engineer, accidentally compounded a formula to convert human flesh and blood into water. A huge container of this remarkable solution was spilled and splashed over Bob Blake, Harry's friend, causing him to disintegrate and become a pool of water on the laboratory floor! Promptly, an antidote was concocted, and with the aid of this, Bob regained his natural form. He then discovered that he could control this phenomenal change merely by the power of thought.\n\nDonning aviator goggles and tights left over from a costume party, he took on the identity of Hydroman to battle an army of &quot;Oriental&quot; invaders. He discovered that it was in fact run by Nazi fifth columnists.\n\nIn Heroic Comics #2, his pal Harry had invented a fabric &quot;made of translite - it's transparent, like cellophane, but tough - nothing can penetrate it - not even bullets&quot;. Hydroman had a suit made of this material.\n\nHydroman had a sidekick named Rainbow Boy until he went on to be a solo hero. \n\n     Reg'lar Fellers Heroic Comics #1-15\n    Heroic Comics #16-29 \n\nPlease seed for all to enjoy","torrent":{"xt":"urn:btih:c9d7a40e232303a769fc216f6f3de30edc0406ae","amp;dn":"Hydroman+by+Bill+Everett++COMPLETE+Eastman+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9d7a40e232303a769fc216f6f3de30edc0406ae","infoHashBuffer":{"type":"Buffer","data":[201,215,164,14,35,35,3,167,105,252,33,111,111,61,227,14,220,4,6,174]},"announce":[],"urlList":[]}}