{"title":"Bitwig Studio 1.0.4","uid":9862226,"size":129699840,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ca82f594577d2538ea9c8d7877170ee5c5f04ff9&amp;dn=Bitwig+Studio+1.0.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cabolombo","files":1,"time":1396311955,"description":"Bitwig Studio is a dynamic software solution for music creation and performance to realize all of your musical ideas in every stage of production.\nFrom sound design to music creation, discover the new standard in customized workflow. Bitwig Studio inspires you to take greater control of your productions, giving you access to every aspect of your workflow as needed. Streamline your creative process and quickly take your music from ideas to complete songs, tracks and compositions. With Bitwig Studio, youÎ“Ã‡Ã–re in command of a workflow that works best for you.\n\nRecord and arrange, improvise and perform, or do it all at once. Choose between several display profiles. Design your own sounds with dedicated container devices. Combine built-in instruments, effects, and VST plug-ins. Bitwig StudioÎ“Ã‡Ã–s unified mapping system allows you to modulate any device or VST parameter using macro controls and modulator devices.\n\nExplore a new world of creative possibilities, including audio and note expressions, histogram-based value editing, layered editing, extensive bounce-in-place functions, automatic slicing, smart controller integration, and the Open Controller Scripting API. Every feature in Bitwig Studio was developed by musicians, for musicians. Welcome to the next generation of music creation and performance software for Windows, Mac OS X, and Linux.\n\n\nChanges in Bitwig Studio 1.0.4\n\n\nIMPROVED Show automated button in plug-in parameter list now also include modulated parameters \nIMPROVED Keyboard input from VST-windows on windows is now redirected to the main application window \nIMPROVED Automatically close and remember which VST-windows were open when switching tracks, and re-open then when switching back. \nIMPROVED Improved the VST plugin parameter list, including a joker entry which follows the selection in the plug-in GUI \nFIXED Engine crash when bouncing/rendering/exporting with buffersizes smaller than 256 \nFIXED When modulation mapping mode is active pressing the mouse-wheel on a knob acts as a click \nFIXED Automation and time-info PDC doesn't work as expected \nFIXED Camel Audio Alchemy doesn't remember its data directory \nFIXED Saving an existing project to a new directory doesn't copy over the plugin-states \nFIXED Convert pitch-bend setting doesn't update when adding/replacing the first instrument on a track \nFIXED AHDSR envelope threshold of instant attack was lower than the minimum attack setting on the sampler \nFIXED Crash when starting note drag and drop with an invalid selection. \nFIXED Crash when editing onset time in inspector. \nFIXED GUI glitches on Mac OS X.\n\n\n\nSometimes their servers are down, so here it is.","torrent":{"xt":"urn:btih:ca82f594577d2538ea9c8d7877170ee5c5f04ff9","amp;dn":"Bitwig+Studio+1.0.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca82f594577d2538ea9c8d7877170ee5c5f04ff9","infoHashBuffer":{"type":"Buffer","data":[202,130,245,148,87,125,37,56,234,156,141,120,119,23,14,229,197,240,79,249]},"announce":[],"urlList":[]}}