{"title":"RiffTrax - Psycho 2","uid":8491152,"size":1331187586,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb93295b80af9f13945332055bf12376900bce93&amp;dn=RiffTrax+-+Psycho+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"saybis","files":1,"time":1369005342,"description":"Turns out hilarious re-imaginings of classic Hitchcock movies aren't just for James Nguyen! They even dug up the original Norman Bates (aka, Anthony Perkins, you may know him from his other work in just kidding, obviously, just kidding) and his momma (quite literally) for this one! Not to mention the Motel and roadside homestead, and even the iconic shower scene! Because, when you see a timeless thriller beloved by millions, the thing you want most is to follow it with a sequel 22 years later that pays homage by just whizzing all over it in every way possible.\n\nNorman gets released home to his family crime scene with some help from psychiatrist Robert Loggia, who's tough and cool as always, but utterly inept as a psychiatrist. Despite the fact that Norman's killing spree would've made national news, with college kids wearing ironic t-shirts of him in his mother's dress by now, very few folks in his sleepy hometown seem to remember him at all. And those that do are eager to give him a job, or, in the case of Meg Tilly, go back to his home and spend the night, just for funsies. Only Dennis Franz (and, presumably, his bare bottom) is suspicious of the man who IS STILL OBVIOUSLY INSANE. But hey, who knows, maybe Norman's fine now? JUST KIDDING, OBVIOUSLY, JUST KIDDING, HE'S STILL NUTS AND TELLS THEM SO HIMSELF MULTIPLE TIMES.\n\nJoin Mike, Bill, and Kevin for Psycho II, and turn the crank on Hitchcock's grave one more time!","torrent":{"xt":"urn:btih:cb93295b80af9f13945332055bf12376900bce93","amp;dn":"RiffTrax+-+Psycho+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb93295b80af9f13945332055bf12376900bce93","infoHashBuffer":{"type":"Buffer","data":[203,147,41,91,128,175,159,19,148,83,50,5,91,241,35,118,144,11,206,147]},"announce":[],"urlList":[]}}