{"title":"5-DVD Meru Lecture Video Set","uid":10014872,"size":1829652480,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cd0cccf091564ce3e55576f5d2cf11bac5e2d57c&amp;dn=5-DVD+Meru+Lecture+Video+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1398137369,"description":"Meru Foundation\n-------------------------\nIn 1968 Stan Tenen discovered a pattern in the arrangement of letters in the first verse of the Hebrew text of Genesis.  He has spent the next 45 years investigating the meaning of that pattern and what it implies. This incredible journey of scientific, religious and mathematical discovery was first released to the public in San Francisco in 1989. This groundbreaking lecture is available on our best selling DVD, Geometric Metaphors of Life. The development of Meru Foundation  research through the following decades is presented in our DVD lecture series and printed materials.\n\n----------------------\nUsing the objective tools of science, the Meru Project has discovered that the sequence of letters in the Hebrew text of Genesis reveals a simple yet extraordinary and unexpected series of geometric models whose meaning describes processes inherent in fields as diverse as embryology, modern physics, and consciousness studies.\n\nMeru Foundation findings demonstrate that the Hebrew letter text of Genesis preserves models and provides tools intended for our spiritual, intellectual, and emotional growth. When studied, they lead to a deep understanding of the framework of our own existence and ways to access our potential to improve ourselves and the world around us.\n\nMeru research also demonstrates that the Hebrew alphabet, in its early rabbinic form, is at its core a universal language of gestures. People from all cultures, even those who are blind from birth, and children before they speak, make spontaneous use of this natural language. The gestures of the Hebrew alphabet express universal needs and choices.\n----------------------\n\nA MATRIX OF MEANING FOR SACRED ALPHABETS\n\nGEOMETRIC METAPHORS OF LIFE\n\nSQUARING THE CIRCLE: The One and the Many; Mind and World\n\nTHE ALPHABET IN OUR HANDS, PART 1\n\nTHE ALPHABET IN OUR HANDS, PART 2","torrent":{"xt":"urn:btih:cd0cccf091564ce3e55576f5d2cf11bac5e2d57c","amp;dn":"5-DVD+Meru+Lecture+Video+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd0cccf091564ce3e55576f5d2cf11bac5e2d57c","infoHashBuffer":{"type":"Buffer","data":[205,12,204,240,145,86,76,227,229,85,118,245,210,207,17,186,197,226,213,124]},"announce":[],"urlList":[]}}