{"title":"When Special Forces Colonel Zachary Garrett leads a team of comm","uid":9857069,"size":1605646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce3cf4450a81b760917b94717e9f40433122f26e&amp;dn=When+Special+Forces+Colonel+Zachary+Garrett+leads+a+team+of+comm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mindcrasher","files":-1,"time":1396228230,"description":"When Special Forces Colonel Zachary Garrett leads a team of commandos into an enemy base-camp inside forbidden Pakistan territory, the ensuing combat destroys his helicopter and all its occupants. After military officers notify his estranged daughter, 17-year-old Amanda Garrett, of her father's death, she is apathetic until they mention a $500,000 life insurance payout. But there's a catch: before she can collect her cash, Amanda must visit revered psychiatrist Riley Dwyer for counseling.\n\nWith his eyes on Amanda's coming bonanza, Spartanburg, SC bad-boy Del Dangurs keeps close tabs on Amanda and the long hoped-for windfall.\n\nMeanwhile, Matt Garrett, Amanda's uncle, leaves his CIA post and arrives in Afghanistan to recover Zachary's remains. But first he leads a daring vengeance raid into Pakistan that results in a clue to Zachary's fate. With hopeful evidence in hand, Matt continues the search for his brother as physical reminders of him are being destroyed or attacked back home, including Riley, who holds her own secrets close.\n\nThe story alternates between thrilling combat scenes in Afghanistan and Pakistan as Matt pursues his brother's fate and attempts to complete a politically sensitive mission while Amanda races to uncover the truth about her father.\n\n\n\nAnthony J. Tata graduated from the United States Military Academy in 1981 and retired after 28 years of service in 2009 as a Brigadier General in the U.S. Army. Tony commanded a paratrooper battalion in the 82nd Airborne Division and an air assault brigade in the 101st Airborne Division. In 2006-07 he served as the Deputy Commanding General of the 10th Mountain Division and Combined/Joint Task Force-76 in Afghanistan. BG Tata has deployed on combat missions and operations in Afghanistan, Kosovo, Macedonia, Bosnia, Panama and the Philippines. He has been awarded the Combat Action Badge and Bronze Star, is a Master Parachutist and a graduate of the U.S. Army's Ranger School.\n\n\n\nTony served as a National Security Fellow at Harvard University's JFK School of Government, earned an M.A. in International Relations from the Catholic University of America, and has a Master of Military Art and Science from the Army's School of Advanced Military Studies. He is listed as a distinguished member of the 502nd, 504th, and 505th Parachute Infantry Regiments.\n\nThe author of the critically acclaimed Threat Series fiction novels (Sudden Threat, Rogue Threat and Hidden Threat), Tony has donated 100% of his book proceeds to the USO Metro DC Hospital Services fund for Wounded Warriors at Walter Reed Army Medical Center and Bethesda National Naval Medical Center.\n\nGeneral Tata has reliably commented on foreign policy, with an emphasis on Afghanistan, on Fox News, CBS, NBC, and a variety of other television and radio shows.\n\n&quot;Vince Flynn and Brad Thor better watch out.&quot;\n-- Author Magazine\n\n&quot;An explosive, seat-of-your-pants thriller! ...terrifying and timely - Read it!&quot;\n--W.E.B Griffin and W.E. Butterworth IV, #1 NY Times bestselling authors\n\n&quot;Topical, frightening, possible, and riveting.&quot;\n--James Rollins, NY Times bestselling author of THE DOOMSDAY KEY\n\n&quot;Powerful and timely book. Great stuff!&quot;\n--John Lescroart, NY Times bestselling author of A PLAGUE OF SECRETS\n\n&quot;Riveting entertainment at its best!&quot;\n--The Military Writers Society of America\n\n&quot;Every military thriller writer wants to be compared to Tom Clancy, but to be called better? That's what A.J. Tata is hearing ... very realistic.&quot;\n--Paul Bedard, U.S. News &amp; World Report&quot;\n\nAJ Tata is the new Tom Clancy. ... Electrifying.&quot;\n--Brad Thor, #1 NY Times bestselling author of FOREIGN INFLUENCE","torrent":{"xt":"urn:btih:ce3cf4450a81b760917b94717e9f40433122f26e","amp;dn":"When+Special+Forces+Colonel+Zachary+Garrett+leads+a+team+of+comm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce3cf4450a81b760917b94717e9f40433122f26e","infoHashBuffer":{"type":"Buffer","data":[206,60,244,69,10,129,183,96,145,123,148,113,126,159,64,67,49,34,242,110]},"announce":[],"urlList":[]}}