{"title":"EXPLOITED COLLEGE GIRLS - Madison - 18 Years Old 720p **NEW**","uid":10034462,"size":1462601037,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d0e1d0b19d77bbbfe0bf0f9c73cefef2a24ab2af&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Madison+-+18+Years+Old+720p+%2A%2ANEW%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"beta2008x","files":1,"time":1398381129,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=7c7sv_mds.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=7c7sv_mds.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=8sbuu_ecg_14_04_24_madison.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=8sbuu_ecg_14_04_24_madison.jpg&lt;/a&gt;\n\n\n\nMadison is a truly innocent first timer in the best sense of the word. Despite her stories she's practically a virgin when our man Jay gets his filthy hands on her and this update turns out to be a great chronicle of this curvy babe's sexual awakening.\n\nAt the tender, but completely legal age of 18 Madison has recently started exploring her sexuality by branching out to new things (including shooting porn for ECG, go fig). Although she makes it very clear that one of those new things was giving blowjobs and having tried it she's not a fan. So, that's a real negative as far as making Madison marriage material. I would say that her fun, giggly personality makes up for it, but that would clearly be a lie.\n\nJay eventually runs out of questions and applies the Rabbit to Madison's fresh, bare pussy to great effect. She's quickly putty in his hands as he brings her to a lasting orgasm. You can actually see her horizons expanding minute by minute as Jay guides her through the shoot. After her O, he gets her to her knees for the BJ and despite her previous comments she gives it the Exploited College try. Watching her reactions you can tell she's in a little over her head with Jay, but she doesn't quit. After oral, he gets her on the bed to fuck. Moving from doggy to her side, to her back, he fucks her like a life-size Fleshlight. Well, life-sized and with a nice set of 18 year old tits that bounce and jiggle with each thrust.\n\nAfter some serious cock in pussy education, Jay's ready to issue Madison her final exam: the facial. She gets to her knees and despite averting her face like she's about to weld without a mask, she gets a gooey face full of Jay jizz. Grade? Definitely A for amateur.\t","torrent":{"xt":"urn:btih:d0e1d0b19d77bbbfe0bf0f9c73cefef2a24ab2af","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Madison+-+18+Years+Old+720p+%2A%2ANEW%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e1d0b19d77bbbfe0bf0f9c73cefef2a24ab2af","infoHashBuffer":{"type":"Buffer","data":[208,225,208,177,157,119,187,191,224,191,15,156,115,206,254,242,162,74,178,175]},"announce":[],"urlList":[]}}