{"title":"Vikings S01E09 Xvid [JKS]","uid":8430558,"size":367045470,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d2d9683035948fef12572b8ed8d22d21a2c3d004&amp;dn=Vikings+S01E09+Xvid+%5BJKS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jksADIDAS","files":32,"time":1367475972,"description":"Once Upon a Time S02E20 XviD [JKS]\n.\nXviD \nEncode Information\nResolution....: 720x404\nVideo : XviD (.avi)\nAudio : MP3 2ch 128kbps\nAudio sample rate 48kHz\nFrame Rate : 23 fps\n.\nIMDb: http://www.imdb.com/title/tt1843230/?ref_=sr_1\nWiki: http://en.wikipedia.org/wiki/Once_Upon_a_Time_(TV_series)\nOfficial Site: http://beta.abc.go.com/shows/once-upon-a-time\nOfficial Fan site: http://once-storybrooke.net/\nOfficialsite:\n.\nThe series takes place in the fictional seaside town of Storybrooke, Maine, in which the residents are actually characters from various fairy tales that were transported to the &quot;real world&quot; town and robbed of their real memories by the Evil Queen, Regina (Lana Parrilla), using a powerful curse obtained from Rumplestiltskin (Robert Carlyle). The residents of Storybrooke have lived an unchanging existence for 28 years, unaware of their own lack of aging. The town's only hope lies with a bail bondswoman, Emma Swan (Jennifer Morrison), the daughter of Snow White (Ginnifer Goodwin) and Prince Charming (Josh Dallas), who was transported from the fairy tale world before she could be cursed. As such, she is the only person who can break the curse and restore the characters' lost memories, aided by her son, Henry (Jared S. Gilmore), with whom she has recently reunited (after giving him up for adoption upon his birth), and his book of fairy tales that holds the key to ending the curse. Henry is also the adopted son of Regina (who is the mayor of Storybrooke), providing a source of conflict between the two women.\nEach episode focuses on a character backstory. One segment details the character's past life that, when serialized, adds a piece to the puzzle about the primary and/or secondary characters and their connection to the events that preceded the curse and its consequences. The other, set in the present day, follows a similar pattern with a different outcome but also offers similar insights. In addition, another storyline follows the results of what had happened after the curse took place and after it was broken by Emma.\n.\nOnce Upon a Time Season 2 Episode 20\nTitle: The Evil Queen  Directed by:  Written by: Jane Espenson &amp; Christine Boylan Original air date: April 28, 2013\n...\nWith the aid of Hook, Regina attempts to put a plan in motion that will help transport herself and Henry back to Fairytale land. But her plan revolves around a fail-safe that was planted within the curse, which if triggered could wipe Storybrooke off the map - and kill all of its inhabitants; and Emma's suspicions about Tamara grow. Meanwhile, in the fairytale land that was, the Evil Queen asks Rumplestiltskin to transform her into an unrecognizable peasant in order to kill an unsuspecting Snow White, with the twisted aim of earning the love and respect of her subjects\n","torrent":{"xt":"urn:btih:d2d9683035948fef12572b8ed8d22d21a2c3d004","amp;dn":"Vikings+S01E09+Xvid+%5BJKS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d9683035948fef12572b8ed8d22d21a2c3d004","infoHashBuffer":{"type":"Buffer","data":[210,217,104,48,53,148,143,239,18,87,43,142,216,210,45,33,162,195,208,4]},"announce":[],"urlList":[]}}