{"title":"Society SM----SSM - Mar 30, 2014 - Selma Sins","uid":9895888,"size":1443042473,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d318b9ff8d75db2f9927b4de0bf89639421b8495&amp;dn=Society+SM%5C----SSM+-+Mar+30%2C+2014+-+Selma+Sins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1396711730,"description":"Society SM  SSM - Mar 30, 2014 - Selma Sins\n\n\n\n\nMp4  540 and 720 + Pics\n\n\nIt's been a while since Selma has been in our dungeon, and we missed toturing the cute latin beauty. Feenix walks in on a fully-bound struggling Selma who is laying in a pool of her own drool. he warms her up with some spanking and flogging.Since she is not bound to anything but herself, he directs her into various positions, caning her when her abilities to move bound fail to meet his standards. When he tires of her pathetic struggle, Feenix pulls her to her feet and anchors her to the ceiling. He adds heavily weighted nipple clams and makes her deep throat a dildo until she gags, drool streaming down her face and neck. Finally, he gives her a massive flogging, hitting the clamps off her tender breasts violently. Selma's humiliation continues when we rigs her in a doggystyle position with her hips secured to a metal bar. Feenix notices she has drool in her hair and adds to it by rubbing her face and head in her own drool puddle. In this position her ass and feet are perfectly exposed for a sound flogging and some wax play on the toes, which he then canes off. He finally allows her some pleasure with her pain using the magic wand to bring her to orgasm, but only if she keeps her mouth pumping ferociously up and down on a very large dildo. Next Selma is bound on her knees with her pussy and breasts exposed for Feenix to enjoy. And he does, using the TENS unit on her soft thighs and clothespins and clamps all over her waist and already sensitive breasts. He give her multiple orgasms with the wand before painfully removing them. Selma is worn out and exhausted from her day in the dungeon, but we have one last intense rig for her to try. She is bound with rope and straps lying on her back with her legs spread and her toes tied to clamped nipples. Feenix mercilessly flogs her plump pussy, and does a little bastinado before bringing in the dick-stick combo. She begs him not to, but this is for his pleasure, not hers. But poor Selma can't help but submit to the pleasure as she cums, screaming\n\n\n\nScreens \n         &lt;a href=&quot;\nhttp://www.societysm.com/updates14/SEL_030414/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.societysm.com/updates14/SEL_030414/index.html&lt;/a&gt;\n\n\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice \n\ncomment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n          &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-) ","torrent":{"xt":"urn:btih:d318b9ff8d75db2f9927b4de0bf89639421b8495","amp;dn":"Society+SM%5C----SSM+-+Mar+30%2C+2014+-+Selma+Sins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d318b9ff8d75db2f9927b4de0bf89639421b8495","infoHashBuffer":{"type":"Buffer","data":[211,24,185,255,141,117,219,47,153,39,180,222,11,248,150,57,66,27,132,149]},"announce":[],"urlList":[]}}