{"title":"Encyclopedia Of New Jersey","uid":8424086,"size":56208792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5d1833596ad99c87a30b4ef6550b98c8a2b9f77&amp;dn=Encyclopedia+Of+New+Jersey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1367290131,"description":"\nEncyclopedia of New Jersey [Hardcover]\n\nMaxine N. Lurie (Editor)\nMarc Mappen (Editor)\nMichael Siegel (Cartographer) \n\nHardcover: 958 pages\nPublisher: Rutgers University Press; 1 edition (March 25, 2004)\nFormat-PDF\n\nThe Encyclopedia of New Jersey is the most extensive reference work ever published on the Garden State. The Encyclopedia contains nearly 3,000 original articles, along with 585 illustrations and 130 maps, collecting a wealth of information about the state in one volume. The Encyclopedia is filled with fascinating and interesting entries ranging from New Jersey's earliest history to the present. For example-Did you know that New Jersey was once divided into two parts-East Jersey and West Jersey? That streptomycin was first isolated at Rutgers University? Or that the first vote cast by an African American under the Fifteenth Amendment was in Perth Amboy? How about that New Jersey was the site of the first intercollegiate football game? These facts, and thousands more, can be found in the pages of the Encyclopedia of New Jersey. This volume will provide the answers to questions about New Jersey that you never even knew you had!\n\nWhether you are merely perusing the pages or are researching a particular subject, the Encyclopedia of New Jersey is your definitive source for information on the Garden State, covering a broad range of subject areas, including:\n\n* Architecture, decorative arts, painting, and sculpture\n* Biographies\n* Business and economics\n* Communications and media\n* Education\n* Ethnicity\n* Folklore, museums, and theater\n* Geography\n* History\n* Government, law, politics, and public policy\n* Literature\n* Medicine and health\n* Municipalities and counties\n* Recreation and sports\n* Religion\n* Science and technology\n* Transportation\n* and many more subjects\n\n__________________________________\n\nFew entities have endured a negative reputation to the extent that the state of New Jersey has. Because of its association with toxic waste and organized crime, many neglect to give the state the regard that its early and recent history and accomplishments would warrant. Mappen, a former vice chairman of the Task Force on New Jersey History and executive director of the New Jersey Historical Commission, was inspired by the Encyclopedia of New York City (Yale Univ., 1995) to produce a similar work that would define and illuminate what New Jersey is. His coeditor, Lurie, is chair of the history department of Seton Hall University.\n\nIn size and appearance, this volume closely resembles the Encyclopedia of New York City. According to the preface, it contains 2,900 entries written by more than 600 authors. Biographies of the contributors are given at the end of the volume. Among the areas covered are architecture, folklore, geography, literature, and transportation. The length and depth of the entries varies from a short paragraph to two-plus pages. All are signed, and many contain bibliographies, though much of the cited material would be difficult to obtain outside of the area. Although some of this information is likely to be duplicated in sources specific to single disciplines, there is nothing else that offers the expansive coverage of this state. Information on small geographic areas and minor political and historical figures might not easily be found anywhere else. The black-and-white illustrations enhance the text, as does the midvolume section of colored plates.\n\nThe front matter begins with a list of donors who helped defray the cost of production and development, leaving this sizable volume with a bargain price. Certainly all New Jersey libraries would need to buy this work, as should most libraries in the Northeast. Academic and large public libraries everywhere should find it useful. Danise Hoover","torrent":{"xt":"urn:btih:d5d1833596ad99c87a30b4ef6550b98c8a2b9f77","amp;dn":"Encyclopedia+Of+New+Jersey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5d1833596ad99c87a30b4ef6550b98c8a2b9f77","infoHashBuffer":{"type":"Buffer","data":[213,209,131,53,150,173,153,200,122,48,180,239,101,80,185,140,138,43,159,119]},"announce":[],"urlList":[]}}