{"title":"Heather Graham - The Flynn Brothers Trilogy (Retail)","uid":10059147,"size":2029664,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d62255d66fc92795bc6e3ff6e90a1d2ae92b0624&amp;dn=Heather+Graham+-+The+Flynn+Brothers+Trilogy+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheRose88","files":3,"time":1398705497,"description":"Heather Graham - The Flynn Brothers Trilogy - Retail (epub)\n\n01 Deadly Night \n02 Deadly Harvest\n03 Deadly Gift\n\nDeadly Night\nThe Flynn brothers have inherited more than a New Orleans plantation. They've inherited a ghostly presence...and a long-kept secret.\n\nAidan Flynn, a private investigator and eldest of the Flynn brothers, scoffs at the haunted-house rumors--especially since Kendall Montgomery, a tarot card reader who has been living in the mansion, is the one to tell him the tale of a woman in white. But when he finds a human bone on the grounds and another by the river, Aidan delves into the dark history of the Flynn plantation.\n\nForced together to uncover the truth, Aidan and Kendall realize that a serial killer whose victims seem to vanish into thin air has long been at work...and that their own fates are about to be sealed forever unless they believe in the unbelievable.\n\nDeadly Harvest\nA dark legend comes to life\n\nWhen a young woman is found dead in a field, dressed up as a scarecrow with a slashed grin and a broken neck, the residents of Salem, Massachusetts, begin to fear that the infamous Harvest Man is more than just a rumor. But out-of-town cop Jeremy Flynn doesn't have time for ghost stories. He's in town on another investigation, looking for a friend's wife, who mysteriously vanished in a cemetery.\n\nComplicating his efforts is local occult expert Rowenna Cavanaugh, who launches her own investigation, convinced that a horror from the past has crept into the present and is seducing women to their deaths. Jeremy uses logic and solid police work. Rowenna depends on intuition. But they both have the same goal: to stop the abductions and locate the missing women before Rowenna herself falls prey to the Harvest Man's dark seduction.\n\nDeadly Gift\nAn outsider in a world of extraordinary wealth, Caer Donahue must learn who can be trusted...and who should be feared.\n\nCaer is spending this Christmas among strangers. Brought to Newport, Rhode Island, from her native Ireland to nurse ailing millionaire Sean O'Riley, she's living a life few can imagine. But money can't hide the tension between O'Riley's trophy wife, his paranoid daughter, the eccentric aunt in the attic and the staff members who run the house.\n\nWhen O'Riley's business partner goes missing, family friend Zach Flynn arrives. Determined to help him solve the case, Caer becomes enmeshed in a mystery that weaves together the sins of the past with one family's destiny...and a spirit that watches the mansion, possessing a deadly gift.","torrent":{"xt":"urn:btih:d62255d66fc92795bc6e3ff6e90a1d2ae92b0624","amp;dn":"Heather+Graham+-+The+Flynn+Brothers+Trilogy+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d62255d66fc92795bc6e3ff6e90a1d2ae92b0624","infoHashBuffer":{"type":"Buffer","data":[214,34,85,214,111,201,39,149,188,110,63,246,233,10,29,42,233,43,6,36]},"announce":[],"urlList":[]}}