{"title":"Lisa Kleypas - Sugar Daddy (Travises Series 1)","uid":9702432,"size":148111043,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d627d5c232602a4063b8bc594c7b411221fbed84&amp;dn=Lisa+Kleypas+-+Sugar+Daddy+%28Travises+Series+1%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"taylorman","files":11,"time":1394025634,"description":"Lisa Kleypas has enthralled millions of readers with her powerfully seductive novels. Now she delivers a story featuring her most unforgettable characters yet....\n\nSHE'S FROM THE WRONG SIDE OF THE TRACKS\nLiberty Jones has dreams and determination that will take her far away from Welcome, Texas---if she can keep her wild heart from ruling her mind. Hardy Cates sees Liberty as completely off-limits. His own ambitions are bigger than Welcome, and Liberty Jones is a complication he doesn't need. But something magical and potent draws them to each other, in a dangerous attraction that is stronger than both of them. \n\nHE'S THE ONE MAN SHE CAN'T HAVE\nWhen Hardy leaves town to pursue his plans, Liberty finds herself alone with a young sister to raise. Soon Liberty finds herself under the spell of a billionaire tycoon---a Sugar Daddy, one might say. But the relationship goes deeper than people think, and Liberty begins to discover secrets about her own family's past. \n\nWILL THEY FIND THEIR HEARTS' DESIRES OR WILL HEARTBREAK TEAR THEM APART?\nTwo men. One woman. A choice that can make her or break her. A woman you'll root for every step of the way. A love story you'll never forget.","torrent":{"xt":"urn:btih:d627d5c232602a4063b8bc594c7b411221fbed84","amp;dn":"Lisa+Kleypas+-+Sugar+Daddy+%28Travises+Series+1%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d627d5c232602a4063b8bc594c7b411221fbed84","infoHashBuffer":{"type":"Buffer","data":[214,39,213,194,50,96,42,64,99,184,188,89,76,123,65,18,33,251,237,132]},"announce":[],"urlList":[]}}