{"title":"Commander in Chief COMPLETE","uid":9746803,"size":2121913830,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8001d3b374fd9a6a314e0e62d55ce99bc0bd149&amp;dn=Commander+in+Chief+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"navrasjueventa","files":18,"time":1394593646,"description":"Commander in Chief is an American drama television series that focused on the fictional administration and family of Mackenzie Allen (portrayed by Geena Davis), the first female President of the United States, who ascends to the post from the Vice Presidency after the death of the sitting President from a sudden cerebral aneurysm.\n\nThe series began broadcasting on ABC on Tuesday, September 27, 2005, at 9 p.m. Eastern Time, although most countries outside North America began screening the series in mid-2006.\n\nThe show was #1 on Tuesday nights until FOX's American Idol started in January. The show was also the #1 new show of the season until CBS' Criminal Minds surpassed it. Its major competitor in the 9:00 p.m. timeslot was FOX's House, which aired after American Idol.\n\nThe series was created by American director Rod Lurie, director of the films The Contender and Deterrence and may have been inspired by The West Wing, a popular political drama on rival NBC.\n\nThe network replaced Lurie with Steven Bochco as show runner,[1] but declining ratings brought about a hiatus, a timeslot change and ultimately cancellation.\t\t","torrent":{"xt":"urn:btih:d8001d3b374fd9a6a314e0e62d55ce99bc0bd149","amp;dn":"Commander+in+Chief+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8001d3b374fd9a6a314e0e62d55ce99bc0bd149","infoHashBuffer":{"type":"Buffer","data":[216,0,29,59,55,79,217,166,163,20,224,230,45,85,206,153,188,11,209,73]},"announce":[],"urlList":[]}}