{"title":"Darkness Falls (2003) DVD5 PAL Multisubs","uid":9847007,"size":4630546432,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d91dc65f30d99b6e1519dc4203ee3198b537f0d9&amp;dn=Darkness+Falls+%282003%29+DVD5+PAL+Multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"NoWayNo","files":-1,"time":1396053123,"description":"audio: english,spanish,russian,hungarian\n\n\nsubs: english,spanish,dutch,arabic,croatian,czech,greek,hindi,hungarian,icelandic,\n\n      polish,russian,serbian,slovenian,turkish\n\n\n\n\nThe events of the film take place in the town of Darkness Falls, which is based on the town of Fall River, Massachusetts. It begins with the legend of a widow, Matilda Dixon, who was adored by all the town's children. Matilda gave them gifts and gold coins when they lost a tooth, thus earning her the name &quot;Tooth Fairy&quot;.\n\nAfter a fire in her home left her horribly disfigured with an extreme sensitivity to light, she wore a porcelain mask, and only went out at night.\n\nAlthough the children adored Matilda, the adults were suspicious of her and one day, when two children went missing, the townspeople quickly blamed Matilda. In their anger and paranoia, they hanged her, ripping off her porcelain mask and exposing her face to the light. Out of despair and betrayal, Matilda, with her dying breath, swore vengeance upon the town. Soon afterward, the two missing children returned home unharmed. The town, realizing their mistake, quickly buried Matilda's body along with their shameful secret.\n\nThe story of Matilda Dixon, the Tooth Fairy, is told for many generations after her violent murder. Legend has it that her spirit visits children on the night they lose their last baby tooth, as they slumber in bed. However, should any person see her when she visits, they become cursed and marked for her deadly vengeance for the rest of their life-- assuming they even survive their first encounter.","torrent":{"xt":"urn:btih:d91dc65f30d99b6e1519dc4203ee3198b537f0d9","amp;dn":"Darkness+Falls+%282003%29+DVD5+PAL+Multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d91dc65f30d99b6e1519dc4203ee3198b537f0d9","infoHashBuffer":{"type":"Buffer","data":[217,29,198,95,48,217,155,110,21,25,220,66,3,238,49,152,181,55,240,217]},"announce":[],"urlList":[]}}