{"title":"Death Defying Devil 1940 AKA Daredevil  COMPLETE!!","uid":8430750,"size":3237926955,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:db58840b45d472d16512de4c683d79c66ad3aceb&amp;dn=Death+Defying+Devil+1940+AKA+Daredevil++COMPLETE%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367481600,"description":"Another Major Player from project Super Powers:\n\n\nFirst Origin (Silver Streak #6)\nAs a child, Bart Hill was witness to his parents' brutal murder. The murderer also branded Bart with a hot iron, leaving a boomerang-shaped scar on the left side of his chest. This traumatic experience left the boy mute. He trained his entire life in the art of the boomerang, eventually becoming a master boomerang marksman. He then developed a costume and took to the streets as the vigilante crime-fighter Daredevil.\n\nSecond Origin (Daredevil Comics #18)Edit\n\nWith Bart Hill/Daredevil speaking in his second appearance (Silver Streak Comics #7), his origin story needed to be ret-conned. In the new origin, Bart Hill's parents were killed while in Australia. Bart was then raised by a tribe of aborigines who taught him the art of using boomerangs. As an adult, he returned to the U.S. and fought crime as Daredevil.\n\nDaredevil fought an epic war against the Claw in the 1940s. Prior to the U.S. being involved in World War II, the Claw allied himself with Adolf Hitler. This prompted Daredevil to team up with the Silver Streak, Lance Hale, Cloud Curtis, Dickie Dean and the Pirate Prince. Later on, Daredevil found himself a group of sidekicks called the Little Wise Guys. In addition to the Claw, Daredevil also battled The Bolt, The Deadly Dozen, The Scarlet Skull and Wolf Carson, among others.\n\nSeed so all may enjoy, Sharing is caring!","torrent":{"xt":"urn:btih:db58840b45d472d16512de4c683d79c66ad3aceb","amp;dn":"Death+Defying+Devil+1940+AKA+Daredevil++COMPLETE%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db58840b45d472d16512de4c683d79c66ad3aceb","infoHashBuffer":{"type":"Buffer","data":[219,88,132,11,69,212,114,209,101,18,222,76,104,61,121,198,106,211,172,235]},"announce":[],"urlList":[]}}