{"title":"The Big Bang Theory Season 2 - BladeMaster670","uid":10019214,"size":4041845494,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:dc3d1e975308f9475faa2ad354949ef478697c20&amp;dn=The+Big+Bang+Theory+Season+2+-+BladeMaster670&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Blademaster670","files":92,"time":1398186085,"description":"The Big Bang Theory is an American sitcom created by Chuck Lorre and Bill Prady, both of whom serve as executive producers on the show along with Steven Molaro. All three also serve as head writers. It premiered on CBS on September 24, 2007. The seventh season premiered on September 26, 2013.\n\nThe show is primarily centered on five characters living in Pasadena, California: roommates Leonard Hofstadter and Sheldon Cooper, both physicists; Penny, a waitress and aspiring actress who lives across the hall; and Leonard and Sheldon's equally geeky and socially awkward friends and co-workers, mechanical engineer Howard Wolowitz and astrophysicist Raj Koothrappali. The geekiness and intellect of the four guys is contrasted for comic effect with Penny's social skills and common sense.\n\nOver time, supporting characters have been promoted to starring roles: Leslie Winkle, a physicist colleague at Caltech and, at different times, a lover of both Leonard and Howard; Bernadette Rostenkowski, Howard's girlfriend (later his wife), a microbiologist and former part-time waitress alongside Penny; neuroscientist Amy Farrah Fowler, who joins the group after being matched to Sheldon on a dating website (and later becomes Sheldon's girlfriend), and Stuart Bloom, the cash-strapped owner of the comic book store the characters often visit.","torrent":{"xt":"urn:btih:dc3d1e975308f9475faa2ad354949ef478697c20","amp;dn":"The+Big+Bang+Theory+Season+2+-+BladeMaster670","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc3d1e975308f9475faa2ad354949ef478697c20","infoHashBuffer":{"type":"Buffer","data":[220,61,30,151,83,8,249,71,95,170,42,211,84,148,158,244,120,105,124,32]},"announce":[],"urlList":[]}}