{"title":"Pervirella.1997..DVDrip.avi","uid":8423820,"size":734083072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd3fd486b6acb6c3c006a793f7233333dd5e0c69&amp;dn=Pervirella.1997..DVDrip.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"9poclaB","files":1,"time":1367279928,"description":"This is the story of the beautiful young Pervirella. Set in the mythical English land of Condon, the grotesque, power-mad Queen Victoria builds a wall around the country and establishes a &quot;Monarchy of Terror.&quot; Intellectuals and &quot;pervs&quot; are prosecuted and killed, or driven underground to form the &quot;Cult of Perv.&quot; Their leader, the Demon Nanny gives birth to a possible savior, then dies. The infant Pervirella grows to maturity with supernatural speed and shows amazing abilities, including raging nymphomania whenever her magical necklace is removed. Pervirella is sought by various rebels, agents of Victoria, the Cult of Perv, and a trio of witches. Eventually she teams up with Amicus Reilly, a James Bond spoof played to stiff, campy perfection by the late David Warbeck. Wild adventures ensue! Written by Clint Weiler\n\nThe beautiful young Pervirella, nurtures a sex demon of incredible lethal powers within her bountiful bosom. Powers only contained by a mystical amulet with a rather loose clasp. Powers that can send her into a lethal mating frenzy from which no mortal man can survive... though many try. To regain her humanity she must travel the globe in search of the infamous elixir of life. An incredible adventure that takes her to every continent and exposes her to incredible dangers, her only weapon - uncontrollable deadly lust. Written by Anonymous","torrent":{"xt":"urn:btih:dd3fd486b6acb6c3c006a793f7233333dd5e0c69","amp;dn":"Pervirella.1997..DVDrip.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd3fd486b6acb6c3c006a793f7233333dd5e0c69","infoHashBuffer":{"type":"Buffer","data":[221,63,212,134,182,172,182,195,192,6,167,147,247,35,51,51,221,94,12,105]},"announce":[],"urlList":[]}}