{"title":"Martin - Keys of This Blood (John Paul II vs Russia &amp; West)(","uid":8431521,"size":2769603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de493ef80da679083b8da5acf7481f5dc636df02&amp;dn=Martin+-+Keys+of+This+Blood+%28John+Paul+II+vs+Russia+%26amp%3B+West%29%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"red_gonzo","files":1,"time":1367511946,"description":"This is Malachi Martin's revealing book The Keys of This Blood - Pope John Paul II versus Russia and the West for Control of the New World Order (1990) which is a compelling array of daring blueprints for global power - and one of them may be the portrait of the future. Martin, consummate Vatican insider and intelligence expert, reveals the untold story behind the Vatican's role in today's winner-take-all race against time to establish, maintain, and control the first one-world government. In his apocalyptic scenario, Pope John Paul II was a geopolitican whose aim - a new world order, the Grand Design of God on earth, a global government rooted in a recognition of universal interdependence. The other chief players in the &quot;millennium end-game&quot; are said to be &quot;hardcore Leninist&quot; Gorbachev, bent on world domination, and the West's rulers, said to be eager to maintain the status quo as they condone &quot;sinful structures&quot; such as Third World exploitation. The author contends that the Pope has allowed the Church to split into politicized factions and willfully ignores &quot;rampant decadence and unfaith&quot; among churchmen. Imagine Pope John Paul II, Mikhail Gorbachev and international business leaders - all in competition to establish one world government. The Keys of This Blood claims to be an inside account of what Pope John Paul II was doing to win this geopolitical struggle and how he played an instrumental role in the collapse of the Iron Curtain. 680 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:de493ef80da679083b8da5acf7481f5dc636df02","amp;dn":"Martin+-+Keys+of+This+Blood+%28John+Paul+II+vs+Russia+%26amp%3B+West%29%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de493ef80da679083b8da5acf7481f5dc636df02","infoHashBuffer":{"type":"Buffer","data":[222,73,62,248,13,166,121,8,59,141,165,172,247,72,31,93,198,54,223,2]},"announce":[],"urlList":[]}}