{"title":"Ordinary.Miracles.2005.DVDRip.XviD-NoGrp","uid":9673097,"size":730761216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:deeba11a55abdc967cb2a3d4e79443fadf21779b&amp;dn=Ordinary.Miracles.2005.DVDRip.XviD-NoGrp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":-1,"time":1393462115,"description":"Ordinary Miracles\n\n\nMovie Details\n\nYear: 2005\nGenres: Drama\nCountry: USA\nLanguage: English\nDirector: Michael Switzer\nWriter: Bud Schaetzle\nStars: Jaclyn Smith, Lyndsy Fonseca, C. Thomas Howell\n\nPlot: Kay Woodbury is a powerful and tough judge who has not spoken to her father since he tried to involve her in a scam. At her latest case, she deals with Sally Powell, a troubled and rebellious teenager who has been in several foster homes in her life. Feeling abandoned by her biological parents, she expresses her anger to anyone who tries to grow close to her. She is given up by her latest foster parents and, because there are not any replacements available, she is put in juvenile prison.\n\nSympathizing with her, Kay decides to take Sally into her home. Sally is initially reluctant to trust Kay and steals some of Kay's jewelry. She pawns it off in the hopes of getting enough money to move to San Francisco with her boyfriend, who is a typical bad boy. However, it only earns them $200. Kay and Sally soon grow to like each other, and Kay is especially impressed with Sally's intelligence. Sally especially seems to enjoy chess. Sally tries to help Kay impress her ex-husband Davis, who is about to marry a much younger woman.\n\nMeanwhile, Kay is going through Sally's files and finds out her biological father, James, lives near her home. She contacts him for landscaping work and they soon befriend each other. Kay does not tell him about Sally. Later, when Kay tells him, he argues with her and refuses to talk to his daughter, claiming that she would not accept him. Sally, meanwhile, has found her files and feels betrayed by Kay, as she always made clear that she has no interest in meeting her biological parents.\n\nShe steals more of Kay's jewelry and runs away with her boyfriend. Her boyfriend, instead of simply selling the jewelry, robs the pawn shop and involves Sally without a warning. Upset, she demands that he drop her off, and he leaves without her. Sally returns home and is welcomed back by Kay. In the end, she decides to give her father a second chance.\n\nIMDb Rate: 6.6/10\nIMDb Link: http://www.imdb.com/title/tt0184799/\n\nMedia Information\n\nSize: 696 MB\nFormat: AVI\nVideo: XviD | 576x320 | 943 Kbps | 23.976 FPS\nAudio: English | 192 Kbps | 2 ch | AC3\nRuntime: 85 min","torrent":{"xt":"urn:btih:deeba11a55abdc967cb2a3d4e79443fadf21779b","amp;dn":"Ordinary.Miracles.2005.DVDRip.XviD-NoGrp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deeba11a55abdc967cb2a3d4e79443fadf21779b","infoHashBuffer":{"type":"Buffer","data":[222,235,161,26,85,171,220,150,124,178,163,212,231,148,67,250,223,33,119,155]},"announce":[],"urlList":[]}}