{"title":"Voracious.2.XXX.DVDRip.x264-SWE6RUS","uid":9654593,"size":1198357511,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:df7c0f62e02927d87a9348f0bad3fc1c391cac05&amp;dn=Voracious.2.XXX.DVDRip.x264-SWE6RUS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":4,"time":1393162434,"description":"Category\tFeature, Horror, Vampire\n\nDirector\tJohn Stagliano\nStarring\tSkin Diamond, Anikka Albrite, Sandra Romain, Lea Lexis, Stoya, James Deen, Rocco Siffredi, Wolf Hudson, Samantha Bentley, Thomas Stone, Keni Styles, Deviant Kade, Clarke Kent\n\nPorn pioneer John Stagliano's groundbreaking &quot;Voracious&quot; series delivered undead lust, vampire intrigue and kinky, hard-core sex. In the new second season's dark narrative, the fetish porn worlds top talents clash as perverse cravings create an eternal battlefield, with many casualties. The three episodes presented on &quot;Voracious Season Two Volume 1&quot; are tales from the nighttime world of a modern San Francisco ruled by a clan of supernatural sex fiends. Luscious blonde Anikka Albrite seduces handsome stud James Deen, who buries his tongue in her plump, round butt. After aggressively fucking Anikka and splattering her with hot cum, James reveals a secret, murderous agenda. Sultry vampiress Lea Lexis finds nocturnal, submissive Deviant Kade on a downtown street. She follows him home, where Kade's dominant African-American girlfriend (Skin Diamond) awaits. The ladies abuse Kade with massive strap-on dildos, ramming his tight asshole and brutally face-fucking the helpless guy. Lea meets demonically pale Stoya; they practically devour one another in a ravenous session of lesbian lust while acrobatically hanging from the ceiling! Lea battles studly bloodsucker Rocco Siffredi for control of their vampire clan. Policeman Keni Styles arrives on a scene of carnage and winds up in a moonlight encounter with insatiable Sandra Romain. When Lea joins in, the evil harlots decide it's time to really feast. Fans of Gothic porn and devotees of Stagliano's fetish-laden, sexually intense cinema will see that legends both horrific and pornographic - can take on new life. The hunger continues!\n\n\nscreens\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=37186716290429700061.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=37186716290429700061.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=92416216542915931666.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=92416216542915931666.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=36595769273717078519.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=36595769273717078519.jpeg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:df7c0f62e02927d87a9348f0bad3fc1c391cac05","amp;dn":"Voracious.2.XXX.DVDRip.x264-SWE6RUS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df7c0f62e02927d87a9348f0bad3fc1c391cac05","infoHashBuffer":{"type":"Buffer","data":[223,124,15,98,224,41,39,216,122,147,72,240,186,211,252,28,57,28,172,5]},"announce":[],"urlList":[]}}