{"title":"Dan Penn - Nobody's Fool (1973) MP3@320","uid":9676714,"size":73278856,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dfaa0d9070fe88a711db60f3fe59c0b7f4676ed6&amp;dn=Dan+Penn+-+Nobody%27s+Fool+%281973%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AaronVincent","files":13,"time":1393577065,"description":"Dan Penn (born Wallace Daniel Pennington, 16 November 1941) is an American singer, musician, songwriter, and record producer who co-wrote many soul hits of the 1960s including &quot;The Dark End Of The Street&quot; and &quot;Do Right Woman, Do Right Man&quot; with Chips Moman as well as &quot;Cry Like a Baby&quot; with Spooner Oldham. Penn also produced many hits including &quot;The Letter&quot; by The Box Tops. Though considered to be one of the great white soul singers of his generation, Penn has released relatively few records featuring his own vocals and musicianship preferring the relative anonymity of songwriting and producing.\n\n\n/Wikipedia\n\nDan Penn has written many great soul songs -- the problem is, he didn't keep any for this album. It's fine, as far as it goes, but it just doesn't go far enough, as you can tell when a cover of John Fogerty's &quot;Lodi&quot; becomes the most soulful thing here. To be fair, soul and country are cousins under the skin, and Penn does have his country touches, but the countrypolitan &quot;I Hate You&quot; -- which sounds like Charlie Rich with a bad case of middle-of-the-roaditis -- is just over the top, maudlin sentimentality. &quot;Prayer For Peace&quot; fares a little better, but in comparison to his classic compositions, it's hippie-dippy drivel that never gets to the core of emotions, the way Penn can at his very best (and the overblown backing vocals don't help either). And the spoken-word closer, &quot;Skin,&quot; with its string accompaniment, is the kind of thing to make any soul fan cringe in sheer embarrassment. Even at its best, on the Philly-style &quot;Raining In Memphis,&quot; this sounds geared more for the nightclub (or a Paul McCartney album outtake) than the gritty dancefloor. Not the man at the peak of his form.\n\n\n/Allmusic","torrent":{"xt":"urn:btih:dfaa0d9070fe88a711db60f3fe59c0b7f4676ed6","amp;dn":"Dan+Penn+-+Nobody%27s+Fool+%281973%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfaa0d9070fe88a711db60f3fe59c0b7f4676ed6","infoHashBuffer":{"type":"Buffer","data":[223,170,13,144,112,254,136,167,17,219,96,243,254,89,192,183,244,103,110,214]},"announce":[],"urlList":[]}}