{"title":"Slut.Wife.Training.4.XXX.DVDRip.XviD-SLiEZE","uid":9940450,"size":739458867,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e21796cff0b336e7f907206b710435f6029b749f&amp;dn=Slut.Wife.Training.4.XXX.DVDRip.XviD-SLiEZE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":4,"time":1397231614,"description":"Jenna's cuckold husband Vinnie brought her to Dirty D because he wanted to see her have group sex slut training with another girl. Dirty D always has sluts around, so he introduces Jenna to Sharon kicking off a Fuck Fest for Vinnie's viewing pleasure. As the training progresses Dirty D returns his full focus to Jenna's training. While Dirty D is fucking Jenna's shaved pussy, Vinnie's true agenda comes to light. Vinnie states how much he loves to get sloppy seconds. Dirty D gladly gives Vinnie what he wants. Dirty D finishes fucking Jenna depositing his load deep inside her wet pussy. Vinnie eagerly dives right in between Jenna's legs eating her fresh Cream Pie devouring every last drop of cum!\nRoy's wife Mackenzie always failed to give up ass. Roy knew it was time to send her to Dirty D for an Anal Intervention course! Dirty D tests all of Mackenzie's Slut Wife Skills before he works on her ass. Her ass is spread, pounded, creamed, and plugged full before she is sent home to Roy.\nTony and his wife Judy just moved into town and they are looking to spice up their sex life. Tony is a big time voyeur and wants to watch Judy while she gets fucked by another man. Tony contacted the King of the sexual underground Dirty D for a Wife Sharing Session. Judy arrived at Dirty D's door alone though, because Tony was too shy to get naked on camera. Dirty D Takes Judy through all her paces. Dirty D fully assesses her oral skills before pounding her shaved pussy. For the final exam Dirty D test's Judy's reaction to cum by shooting a big load all over her!\nKenny sends his wife Kim to the infamous Slut Wife Trainer Dirty D to have her sexual horizon's broadened. Kenny really wants to see his wife being fucked by another man. Dirty D begins his lesson by testing Kim's orals skills. Dirty D has Kim mount his cock for her husband to see what a good slut she is turning out to be. Dirty D fuck's Kim's tight wet snatch while teaching her some new sex positions to try at home. Dirty D finishes off his lesson by giving Kim a messy cream pie!\n\nMackenzie, Kim, Sharon, Judy, Carmen, Jenna, Dirty D\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=25023442397625784630.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=25023442397625784630.jpeg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=37024548243404069648.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=37024548243404069648.jpeg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e21796cff0b336e7f907206b710435f6029b749f","amp;dn":"Slut.Wife.Training.4.XXX.DVDRip.XviD-SLiEZE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e21796cff0b336e7f907206b710435f6029b749f","infoHashBuffer":{"type":"Buffer","data":[226,23,150,207,240,179,54,231,249,7,32,107,113,4,53,246,2,155,116,159]},"announce":[],"urlList":[]}}