{"title":"[Coursera] Property and Liability - An Introduction to Law and E","uid":10032678,"size":1270754332,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e224983400a9e6ba2d5b39a628c37c2efcd66dee&amp;dn=%5BCoursera%5D+Property+and+Liability+-+An+Introduction+to+Law+and+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rndNbr","files":121,"time":1398355744,"description":"PROPERTY AND LIABILITY: AN INTRODUCTION TO LAW AND ECONOMICS\n******************************************************\nTaught by Richard Adelstein\nPublished by Wesleyan University and Coursera\nCompiled by the Free Library and Uploaded by rndNbr in March 2014\n\n======================================================\n\nThank you for downloading this educational resource. If you are satisfied with it, I only ask you to seed its torrent or pass it on in some way for someone else's use.\n\nIf you have any comments, questions, or suggestions, if you would like information on other free educational resources, or if you would like to contribute, please contact us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1573677070797c776774676c557078747c793b767a783b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIf you would like to donate, support free education by donating to Khan Academy:\n &lt;a href=&quot;\nhttp://khanacademy.org/donate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://khanacademy.org/donate&lt;/a&gt;\n\nThank you.\n\nThe Free Library\n\n======================================================\n\nThis course includes the video lectures (MP4), their subtitles (SRT), transcripts (TXT), and any lecture resources that were provided by the professor(s).\n\n======================================================\n\nThis is version 002 of this course. It ended in February/March 2014.\n\nThink about the oldest and most familiar principles of American law, property and proportional liability, in a new and surprising way, and learn to apply economic reasoning to an especially important and interesting aspect of life. \n\nOne of the most interesting and important developments in social science since 1970 has been the &quot;discovery&quot; of a consistent economic logic underlying the great common law subjects of property, contract, tort and crime, the thousand-year-old bedrock of the English and American legal systems. Property and contract provide the institutional scaffolding that makes free exchange in markets possible, while the liability systems of tort and crime appear to mimic market exchange in areas of human activity where free exchange itself, for well-defined reasons, is not possible. This course seeks to expose this underlying economic logic through the close investigation of a series of paradigmatic problems and examples in light of some simple but very powerful economic ideas. The course assumes no prior background in economics or law, and begins with an introduction to the basic concepts of property, exchange, efficiency and externality. On this foundation, specific topics in the law, including property, tort and crime, eminent domain, intellectual property and criminal procedure, are considered. Each group of lectures will elaborate on a different concrete problem or example to suggest the range of legal issues and questions to which economic reasoning can be productively applied. The ideas and modes of analysis developed in the course are not difficult or mysterious, but the questions of interpretation and policy that they raise about a subject that affects everyone are challenging and provocative. \n\nMore information about this course is available at https://coursera.org/course/lawandecon\n","torrent":{"xt":"urn:btih:e224983400a9e6ba2d5b39a628c37c2efcd66dee","amp;dn":"%5BCoursera%5D+Property+and+Liability+-+An+Introduction+to+Law+and+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e224983400a9e6ba2d5b39a628c37c2efcd66dee","infoHashBuffer":{"type":"Buffer","data":[226,36,152,52,0,169,230,186,45,91,57,166,40,195,124,46,252,214,109,238]},"announce":[],"urlList":[]}}