{"title":"[Coursera] Human Evolution - Past and Future","uid":9988479,"size":3142044019,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e2b83c51fa91a7243a32c820ebc8424b58c14e27&amp;dn=%5BCoursera%5D+Human+Evolution+-+Past+and+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"rndNbr","files":217,"time":1397817348,"description":"HUMAN EVOLUTION: PAST AND FUTURE\n******************************************************\nTaught by John Hawks\nPublished by the University of Wisconsin-Madison and Coursera\nCompiled by the Free Library and Uploaded by rndNbr in March 2014\n\n======================================================\n\nThank you for downloading this educational resource. If you are satisfied with it, I only ask you to seed its torrent or pass it on in some way for someone else's use.\n\nIf you have any comments, questions, or suggestions, if you would like information on other free educational resources, or if you would like to contribute, please contact us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0462766161686d667665767d446169656d682a676b692a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIf you would like to donate, support free education by donating to Khan Academy:\n &lt;a href=&quot;\nhttp://khanacademy.org/donate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://khanacademy.org/donate&lt;/a&gt;\n\nThank you.\n\nThe Free Library\n\n======================================================\n\nThis course includes the video lectures (MP4), their subtitles (SRT), transcripts (TXT), and any lecture resources that were provided by the professor(s).\n\n======================================================\n\nThis is version 001 of this course. It ended in February/March 2014.\n\nIntroduction to the science of human origins, the fossil and archaeological record, and genetic ancestry of living and ancient human populations. The course emphasizes the ways our evolution touches our lives, including health and diet, and explores how deep history may shape the future of our species.\n\nThis course covers our evolutionary history across more than seven million years, from our origins among the apes up to the biological changes that are still unfolding today. If you enroll, you'll encounter the evidence for the earliest members of our lineage, as they begin the long pathway to humanity. You'll see how scientists are learning about the diets of ancient people, using microscopic evidence and chemical signatures in ancient teeth. We will explore together the exciting fossil discoveries of the last ten years, which have shaken up our notions of the origin of human culture and our own genus. \n\nGenomics has fundamentally transformed the way we understand our evolution, in many ways opening the direct evidence of our history to anyone. The course will teach you how to look inside the genomes of humans, Neandertals and other ancient people.  If you have used personal genomics to get your own genotypes, the course will guide you in connecting genetics to your ancestry among ancient humans.\n\nThe course brings a special focus on the rapid evolutionary changes of the last 10,000 years. You'll learn about the consequences of our shift to agriculture, and the ways that people of industrialized nations are still changing today. At the end, we trek forward to anticipate what evolutionary changes may be in store for humanity in the future, using our knowledge of history and scientific understanding to inform our speculations.\n\nMore information about this course is available at https://coursera.org/course/humanevolution","torrent":{"xt":"urn:btih:e2b83c51fa91a7243a32c820ebc8424b58c14e27","amp;dn":"%5BCoursera%5D+Human+Evolution+-+Past+and+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b83c51fa91a7243a32c820ebc8424b58c14e27","infoHashBuffer":{"type":"Buffer","data":[226,184,60,81,250,145,167,36,58,50,200,32,235,200,66,75,88,193,78,39]},"announce":[],"urlList":[]}}