{"title":"EXPLOITED COLLEGE GIRLS - Mila - 23 Years Old Hottie 720p *NEW*","uid":9882735,"size":1994926633,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e2e37744c6386df2c1be26a9fb4125806b231bd6&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Mila+-+23+Years+Old+Hottie+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"beta2008x","files":1,"time":1396567368,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=wpiz9_mla.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=wpiz9_mla.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=aldha_ecg_14_04_03_mila_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=aldha_ecg_14_04_03_mila_s.jpg&lt;/a&gt;\n\n\nThis week we spice things up with a lovely, slightly sex starved latina. While she hasn't got the supermodel looks some of the ECG girls possess, she's got sexuality and enthusiasm to spare. Not to mention a round, tan bubble butt that Jay can't help slapping. Ass men, rejoice.\n\nWhile this is Mila's first shoot, it isn't her first bad decision, which you'll realize when you see the strange old English style tattoo she's gotten across her stomach. If you aren't up on your urban tags, we believe it means her belly is the turf of a local gang. Questionable body modifications aside, Mila is pretty damn sexy. She's relaxed and genuinely loves sex, so much so that our man Jay can't even keep his cock holstered during the introductory interview. Before he even gets her settled for the main shoot, she's sucked him off and he's fucked her over a table.\n\nJay finally gets things on track and gets Mila settled for the interview where we learn all about her. For example, you can tell Mila is a very clever girl, she's only 23 but has already figured out that if she dresses like a slut guys will buy her drinks. It's hard to fault her for flaunting her sexuality though, she just really likes to fuck and we're very okay with that. So is Jay, who manages to fuck to orgasm in every position he can think of. She gets off in cowgirl, she gets off when he pins her to the bed and hits it from behind, and she most certainly gets off when he fucks her in missionary off the edge of the bed. She doesn't really get off when he climbs on top of her and blows his load on her face, but she doesn't move out of the way either and that's almost as good.\n","torrent":{"xt":"urn:btih:e2e37744c6386df2c1be26a9fb4125806b231bd6","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Mila+-+23+Years+Old+Hottie+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2e37744c6386df2c1be26a9fb4125806b231bd6","infoHashBuffer":{"type":"Buffer","data":[226,227,119,68,198,56,109,242,193,190,38,169,251,65,37,128,107,35,27,214]},"announce":[],"urlList":[]}}