{"title":"Bobby Vee - Bobby Vee [Legendary Masters Series] (1990)","uid":8425875,"size":339158145,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e43fa704c4dadceff9f033ca4d755903ce34319e&amp;dn=Bobby+Vee+-+Bobby+Vee+%5BLegendary+Masters+Series%5D+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":34,"time":1367344892,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nBobby Vee - Bobby Vee [Legendary Masters Series] (1990)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41FZ3VBBTWL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41FZ3VBBTWL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nHas cover art only.\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by John Bush):\n\nHe launched his career as a fill-in for the recently deceased Buddy Holly, Bobby Vee scored several pop hits during the early '60s, that notorious period of popular music sandwiched between the birth of rock &amp; roll and the rise of the British Invasion. Though a few of his singles -- &quot;Rubber Ball,&quot; for one -- were as innocuous as anything else from the era, Vee had a knack for infectious Brill Building pop, thanks to his ebullient voice as well as the cadre of songwriters standing behind him.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/bobby-vee-p5750/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/bobby-vee-p5750/biography&lt;/a&gt;\n\nAll Music Album Review (by Bruce Eder):\n\nThis 26-song compilation has a lot more going for it than &quot;Take Good Care of My Baby&quot; or &quot;The Night Has a Thousand Eyes&quot; -- indeed, some of Bobby Vee's less-well-known singles are more interesting than certain of the hits, with &quot;Suzie Baby&quot; and &quot;What Do You Want&quot; leading the pack, the latter especially, for emulating the sound of Buddy Holly's final single, &quot;It Doesn't Matter Anymore.&quot; And &quot;One Last Kiss&quot; is an unexpectedly strong rendition of the song from Bye Bye Birdie. Beyond that point, the disc goes into the familiar territory of his hits (&quot;Devil or Angel,&quot; &quot;Rubber Ball,&quot; etc.), most of them mastered in their stereo versions, which, given the polish of Snuff Garrett's production, isn't a bad thing. Some of the teen pop, such as &quot;Stayin' In&quot; -- a song about after-school detention and affairs of the heart -- and &quot;How Many Tears,&quot; don't hold up except as artifacts of their era, but they're not too obtrusive in the overall scheme of this CD, which covers a lot of territory, occasionally in unexpected ways. &quot;The Night Has a Thousand Eyes,&quot; for instances, is mastered from a source that includes the four-second count-off before the song actually begins and has a sound so close and loud that it actually ends up rocking quite a bit harder than it ever did as a single on the radio. Even his plunge into pop around 1964-1965 gets its best possible face, with the opulently produced and beautifully sung &quot;Be True to Yourself.&quot; And the songs extend to Vee's post-1966 reshaping of his sound with &quot;Look at Me Girl,&quot; &quot;Come Back When You Grow Up&quot; (which was, in fact, his biggest selling if not his highest charting single), and so on. Among the non-single tracks included, incidentally, is Vee's excellent version of Buddy Holly's &quot;Everyday,&quot; but among the pieces promised but not present is the supposed 26th track, a Bobby Vee radio spot that's listed but is nowhere to be found on the disc. The sound is generally of a very high standard, though one suspects that a new compilation done by a competent producer and engineer could get better results today. And the annotation is very thorough, providing a good introduction and overview of this underrated artist -- anyone seeking more should go to Beat Goes On's reissues of Vee's individual albums, two-on-one to a CD.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/legendary-masters-r21073/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/legendary-masters-r21073/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B00000DRAD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B00000DRAD&lt;/a&gt;\n\nTrack List:\n\n01. Suzie Baby\n02. What Do You Want?\n03. One Last Kiss\n04. Devil or Angel\n05. Rubber ball\n06. Everyday\n07. Stayin' In\n08. More Then I Can Say\n09. How Many Tears\n10. Take Good Care Of My Baby\n11. Run To Him\n12. Walkin' With My Angel\n13. Please Don't Ask About Barbara\n14. Sharing You\n15. Punish Her\n16. The Night Has A Thousand Eyes\n17. Charms\n18. Be True To Yourself\n19. Yesterday And You\n20. I'll Make You Mine\n21. Look At Me Girl\n22. Come Back When You Grow Up\n23. Beautiful People\n24. Maybe Just Today\n25. Medley, My Girl-Hey Girl\n26. Bobby Vee Radio Spot\n","torrent":{"xt":"urn:btih:e43fa704c4dadceff9f033ca4d755903ce34319e","amp;dn":"Bobby+Vee+-+Bobby+Vee+%5BLegendary+Masters+Series%5D+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e43fa704c4dadceff9f033ca4d755903ce34319e","infoHashBuffer":{"type":"Buffer","data":[228,63,167,4,196,218,220,239,249,240,51,202,77,117,89,3,206,52,49,158]},"announce":[],"urlList":[]}}