{"title":"Manfred Mann's Earth Band - Blindin' [2000][320 KBPS]","uid":9744730,"size":156317169,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e569636a5efdc7a4977fab72fd7c3c2fc38c5df8&amp;dn=Manfred+Mann%27s+Earth+Band+-+Blindin%27+%5B2000%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LameDuck69","files":14,"time":1394567534,"description":"Manfred Mann's Earth Band - Blindin' [2000]\n\n\n\n\n\n01. Blinded By The Light  \n02. You Angel You  \n03. Spirit In The Night  \n04. Solar Fire  \n05. Circles  \n06. Demolition Man  \n07. Redemption Song (No Kwazulu)  \n08. Brothers And Sisters Of Africa  \n09. Nightingales And Bombers  \n10. Martha's Madman  \n11. Father Of Day, Father Of Night  \n\n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nManfred Mann's Earth Band is a British progressive rock group formed by South African musician Manfred Mann. The band's hits include covers of Bruce Springsteen's &quot;Blinded By The Light&quot; and &quot;Spirit In The Night&quot;, &quot;Davy's on the Road Again&quot;, and &quot;Runner&quot;. After forming in 1971 and despite a short hiatus in the late 80s/early 90s, the Earth Band has continued to perform and tour through the present.\n\nMann started in the 1960s with the self-titled British invasion band that had such hits as &quot;Do Wah Diddy Diddy&quot; and &quot;The Mighty Quinn&quot; and then moved on to jazz fusion-inspired Manfred Mann Chapter Three before forming the Earth Band in 1971. In his 2003 biography, Klaus Voormann, former member of original Manfred Mann group and Beatles-associate, is alleged to have inspired the Earth Band's name by having suggested several times throughout the 1960s that Mann's soft pop style of those days had to become &quot;earthier&quot; and rockier, not least of all because of the seemingly effeminate image of Mann's earlier band which had led to a number of close encounters with violence, particularly in Ireland.\n\nThe original line-up consisted of Mick Rogers (guitar and vocals), Manfred Mann (organ, synthesizer and vocals), Colin Pattenden (bass guitar) and Chris Slade (drums and vocals). In its very earliest stages, the band was simply billed as &quot;Manfred Mann&quot; and thus a continuation of the 1960s group. The quartet released their first single, &quot;Please Mrs. Henry&quot;, in 1971. Their second single, Randy Newman's &quot;Living Without You,&quot; was also released by &quot;Manfred Mann&quot; in Europe, but by &quot;Manfred Mann's Earth Band&quot; in the USA, where the track became a minor chart hit. Thereafter, &quot;Manfred Mann's Earth Band&quot; was the band name used on all releases. The membership of the Earth Band was stable between 1971 and 1976, during which time they released their first six albums.\n\n","torrent":{"xt":"urn:btih:e569636a5efdc7a4977fab72fd7c3c2fc38c5df8","amp;dn":"Manfred+Mann%27s+Earth+Band+-+Blindin%27+%5B2000%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e569636a5efdc7a4977fab72fd7c3c2fc38c5df8","infoHashBuffer":{"type":"Buffer","data":[229,105,99,106,94,253,199,164,151,127,171,114,253,124,60,47,195,140,93,248]},"announce":[],"urlList":[]}}