{"title":"Opsada - The Siege (1956)","uid":8491122,"size":782745600,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5c4d739cd20972c7469d3a02b8c688fa2ff55b1&amp;dn=Opsada+-+The+Siege+%281956%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SilentStorm666","files":1,"time":1369004358,"description":"Grupa ranjenika, u polusrusenoj kuci koja se nalazi pod unakrsnom vatrom neprijatelja, ocekuje najgore, i u tom iscekivanju neki od njih se prisjecaju dogadjaja koji su prethodili ovakoj situaciji.\n\nPrica prva:\nNakon ucesca u spanskom gradjanskom ratu, Marko se vraca u Hrvatsku kako bi se pridruzio ustanku protiv okupatora. U vozu na putu prema Zagrebu prepoznaje ga stari prijatelj i poznanik, zeleznicar, a Marko mu govori da se vraca sa rada u Nemackoj. Stigavsi u Zagreb, dok trazi vezu, Marku je za petama ustaski agent. Marko uspeva da ga se oslobodi, ali je tom prilikom ranjen. Ne znajuci sta mu se dogodilo, zeleznicar ga prima u svoj stan, dovodeci u opasnost vlastitu porodicu.\n\nPrica druga:\nPartizani Mico i Perica traze patrolu koja se izgubila, i ukoliko je ne pronadju, Mico obecava da ce dovesti zarobljenog nemackog generala. Posle uspesnog skrivanja od nemacke patrole, preoblace se u dimnicare i tako ulaze u nemacki glavni stab grada i ne sluteci da je jedan od zapovednika u stabu partizanski obavjestajac.\n\nPrica treca:\nNevenka, student violine je veoma suzdrzana prema udvaranju kolege iz orkestra, trubaca Krese. Ona misli da ima vremena samo muziku, a ne za ljubav i politiku. Kad Nevenka otkrije da je Kreso ilegalac, ona mu pomaze i zaljubiljuje se u njega. Ostaje trudna, a Kreso pokusava da je izvuce iz nemackog okruzenja.","torrent":{"xt":"urn:btih:e5c4d739cd20972c7469d3a02b8c688fa2ff55b1","amp;dn":"Opsada+-+The+Siege+%281956%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5c4d739cd20972c7469d3a02b8c688fa2ff55b1","infoHashBuffer":{"type":"Buffer","data":[229,196,215,57,205,32,151,44,116,105,211,160,43,140,104,143,162,255,85,177]},"announce":[],"urlList":[]}}