{"title":"Sexually Broken--Sexy Skin Diamond stretched out stuffed full of","uid":10028082,"size":1811345052,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e73a0ec52932bea72e8a4275f2e18d2f3ae61f4f&amp;dn=Sexually+Broken--Sexy+Skin+Diamond+stretched+out+stuffed+full+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1398295608,"description":"\nSexy Skin Diamond gets stretched out, stuffed full of cock from both ends epic deepthroating on BBC! | Skin Diamond | Matt Williams\n\nApril 23, 2014\n\n\niPod, Low and High bitrate MP4.\n\n\nThey do not come much more eager then Skin Diamond. While she might one of the biggest names in porn at the moment, her true passion lies in what Sexuallybroken can deliver. Skin can fuck, and fuck extremely well, but being restrained and pushed and challenged is what really makes this slut wet. Today she is in for the ride of her life. We are bringing 2 cocks to the table to properly work her over in the manner she craves.\n\nSkin is a tiny compact thing, so we start her off with some good stretching to limber her up. Cranked up to her tip toes and then hoisted up off the ground, Skin dangles helplessly. We do not want this fuck slut to forget her place. Her wide grin as she dangles from her wrists shows that Skin is in her happy place. Lowering her down to her knees, we tie her arms around our legs so that she can not get off the cock. She is roped down, dick in mouth hole all the way to the base. It is the perfect tie for face training. \n\nWhile still tied, we stand her up to her feet so that we can have access to that flawless ass. Once that perfect bubble butt is up in the air, we make full use of her pussy. All the while, the cock is still buried in her mouth. Skin is tag teamed and worked over, rag doll fucked while in tight restraining bondage. Her eyes glaze over as the rough handling unlocks the sexual beast lurking behind those glamour looks. Skin's flawless model looks barely contain the raging fuck animal that lies underneath. Here at Sexuallybroken we know the key to peeling the veneer back-lots and lots of bondage and dick.\n\nShe gets so into it she is growling and lunging at the dick, lost in sexual abandon. This is a beast that needs feeding. It is a good thing for us she is bound and we outweigh her. Skin's eyes glow as she takes the dick to the base, deepthroating every inch. We have fucked her from every which side, and Skin is lost in sexual subspace. This animal needs corralling, and we yank her back into the arm suspension, leaving her dangling there like a sexy slab of top shelf meat. Her feet tread the air, unable to find purchase. It is a fitting fate for this sex addict. We leave her dangling, well fucked and well stretched.  \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_23sdiamond7/SexuallyBroken-Skin-Diamond-Matt-Williams-Sexy-Skin-Diamond-gets-stretched-out-stuffed-full-of-cock-from-both-ends-epic-deepthroating-on-BBC.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_23sdiamond7/SexuallyBroken-Skin-Diamond-Matt-Williams-Sexy-Skin-Diamond-gets-stretched-out-stuffed-full-of-cock-from-both-ends-epic-deepthroating-on-BBC.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:e73a0ec52932bea72e8a4275f2e18d2f3ae61f4f","amp;dn":"Sexually+Broken--Sexy+Skin+Diamond+stretched+out+stuffed+full+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73a0ec52932bea72e8a4275f2e18d2f3ae61f4f","infoHashBuffer":{"type":"Buffer","data":[231,58,14,197,41,50,190,167,46,138,66,117,242,225,141,47,58,230,31,79]},"announce":[],"urlList":[]}}