{"title":"ReORIENT by Andre Gunder Frank","uid":9688710,"size":3440991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7b9f4ce3a4a7219f409f6de86d6011e3a083565&amp;dn=ReORIENT+by+Andre+Gunder+Frank&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PirateBook","files":2,"time":1393825890,"description":"\nAndre Gunder Frank asks us to ReOrient our views away from Eurocentrismto see the rise of the West as a mere blip in what was, and is again becoming, an Asia-centered world. In a bold challenge to received historiography and social theory he turns on its head the world according to Marx, Weber, and other theorists, including Polanyi, Rostow, Braudel, and Wallerstein. \n\nFrank explains the Rise of the West in world economic and demographic terms that relate it in a single historical sweep to the decline of the East around 1800. European states, he says, used the silver extracted from the American colonies to buy entry into an expanding Asian market that already flourished in the global economy. \n\nResorting to import substitution and export promotion in the world market, they became Newly Industrializing Economies and tipped the global economic balance to the West. That is precisely what East Asia is doing today, Frank points out, to recover its traditional dominance. As a result, the &quot;center&quot; of the world economy is once again moving to the &quot;Middle Kingdom&quot; of China. \n\nAnyone interested in Asia, in world systems and world economic and social history, in international relations, and in comparative area studies, will have to take into account Frank's exciting reassessment of our global economic past and future.\n\nGenre: History / Military","torrent":{"xt":"urn:btih:e7b9f4ce3a4a7219f409f6de86d6011e3a083565","amp;dn":"ReORIENT+by+Andre+Gunder+Frank","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7b9f4ce3a4a7219f409f6de86d6011e3a083565","infoHashBuffer":{"type":"Buffer","data":[231,185,244,206,58,74,114,25,244,9,246,222,134,214,1,30,58,8,53,101]},"announce":[],"urlList":[]}}