{"title":"Captain America - Sentinel Of Liberty 01-12 + Ex (1998|Beast+)","uid":10079476,"size":175047538,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e8dbb37d8d57e08117c29afceec6f1c682bf08de&amp;dn=Captain+America+-+Sentinel+Of+Liberty+01-12+%2B+Ex+%281998%7CBeast%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1398974489,"description":"A cavalcade of celebrated writers and artists worked on this Captain America miniseries - including work by Mark Waid  (Author), James Felder (Author), Brian K. Vaughan (Author), Roger Stern  (Author), Ron Garney (Illustrator), Doug Braithwaite (Illustrator), Steve Mannon (Illustrator), Cully Hammer (Illustrator), Walter McDaniel (Illustrator), Anthony Williams (Illustrator). Promotional info for the collected edition - &quot;Aliens, Atlantean, and Axis; super-criminals and super-terrorists--it's all in a day's work for Captain America in these stunning stories of wartime missions and adventures from his earliest Avengers days!  Guest-starring Bucky, the Falcon, two Human Torches, Iron Man, the Invaders, S.H.I.E.L.D., Cap's original inspiration, and more! &quot;\n\nThis torrents includes the original scans of the first twelve issues, as well as the Rough Cut version of issue 01. I also found the first six issues in copies by The Beast's Library, which are higher quality and serve as a good comparison to the older copies. Instead of having half of one and the other, I just added those in the folder as well - YOU DO NOT NEED TO GRAB BOTH SETS of those issues if you don't want. Thanks to the scanners for their efforts, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:e8dbb37d8d57e08117c29afceec6f1c682bf08de","amp;dn":"Captain+America+-+Sentinel+Of+Liberty+01-12+%2B+Ex+%281998%7CBeast%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8dbb37d8d57e08117c29afceec6f1c682bf08de","infoHashBuffer":{"type":"Buffer","data":[232,219,179,125,141,87,224,129,23,194,154,252,238,198,241,198,130,191,8,222]},"announce":[],"urlList":[]}}