{"title":"ODDS_AND_EVENS EMBEDDED GREEK SUBS!!!!","uid":10018283,"size":1457712846,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e9e6eac50debfb9d65ff1616d7218a59134317e8&amp;dn=ODDS_AND_EVENS+EMBEDDED+GREEK+SUBS%21%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sofodrift","files":1,"time":1398177534,"description":"Actors:Bud Spencer and Trence Hill Luciano Catenacci Marisa Laurito Salvatore Borgese\nRiccardo Pizzuti Claudio Ruffini Sergio Smacchi Vincenzo Maggio Woody Woodbury                                                    \n\nJohnny is a very good driver motorboat with which it is competing in many competitions in Miami, Charlie instead is a truck driver making deliveries in various places and ultimately must carry a tank full of dolphins. The two characters meet when some miscreants sabotage speedboat Johnny. He thinks that it was Charlie who was eating a plate of beans, but in the end they discover that the real culprits are a gang of illegal bookmakers are putting their hands boobies next races to be held in Miami. Johnny to discover the intentions of the band Charlie proposes to work with him, but these early disagrees because his acquaintance seems too clever, witty trickster and for his rough taste. However, at the end, the two combine to sabotage plans by gangsters fighting and fisticuffs fun. In the midst of this climate Charlie, in despair, he will find also be the illegitimate brother of Johnny for an escapade of his father, still alive, who pretends to be blind in order to collect a pension. After Johnny was passed off as a runner with the horses and Charlie took part in a second meeting, the two brothers find out which houses the boss of the gang of bookmakers and Johnny will have to play with him and his henchmen in a poker game. Johnny wins but the boss does not intend to make it go away, so Charlie and Johnny greet the members of the band with a new and more powerful punch and brawl.\n-------------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:e9e6eac50debfb9d65ff1616d7218a59134317e8","amp;dn":"ODDS_AND_EVENS+EMBEDDED+GREEK+SUBS%21%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e6eac50debfb9d65ff1616d7218a59134317e8","infoHashBuffer":{"type":"Buffer","data":[233,230,234,197,13,235,251,157,101,255,22,22,215,33,138,89,19,67,23,232]},"announce":[],"urlList":[]}}