{"title":"Puppy_Linux_ThinSlacko_archive_03-Apr-2014","uid":9900734,"size":2040585983,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:eba83d6691e85f82ae0db8090a8c7db2f98558b5&amp;dn=Puppy_Linux_ThinSlacko_archive_03-Apr-2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aarf12","files":-1,"time":1396760983,"description":"Thin Slacko\n\nReleased 03-Apr-2014\n\nby rufwoof\n\n\ninfo http://www.murga-linux.com/puppy/viewtopic.php?p=766808#766808\n\n\nUPDATE (April 2014) : Later revised ISO (V2.04)  \n\n92.9MB ISO \n\n Changes in revised edition : \n\n Wallpaper - whilst previous was posted as being 'free' I couldn't verify such and a bit iffy whether that's right or not, so changed to be sure. \n\n Made windows opaque, so filled in whilst moving rather than rectangular box (making them opaque seems to let mplayer run better whilst moving/resizing). \n\n Removed display of screen coordinates whilst moving windows. \n\n More distinguished startup, shutdown and trash sounds \n\n Moved drive icons to be slightly higher up - because previously when tray was set to tallest the drive titles were partially hidden. \n\n JWM and GTK themes changed to be more aligned with each other. \n\n Tray set to max size and added xvkbd, magnifier and calculator to the tray (by default its a UK keyboard layout, and has to be manually configured at present for other layouts (a simple matter of overwriting the XVkbd file in /etc/X11/apps_with that of the Xvkbd-country file for whatever country keyboard is desired)). \n\n Extended download directory to also include a range of SFS's and PET's, such as Skype, TeamView, Audacity, Blender, OpenShot, xvidcap, Virtual Machine, Wine, Samba, JRE, GIMP, Geany, Flash, NVIDIA driver, Messa, Libre Office, Kernel Sources and DevX - for the purpose of assisting those who might like to use it as a more general distro (rather than just as a online banking type distro). \n\n Direct to GUI on both the Radeon and Nvidia PC's that I have access to. (remastering using a nvidia PC seems to help to reduce/avoid blackscreen boots). \n\n With a relatively fast internet link, with just a blank DVD and Windows, I had a ISO downloaded and burnt (using the windows DVD burner that's included in the ISO (I used 7-Zip to extract the burner from the ISO)) within around 5 minutes. 5 minutes later I'd booted to the desktop, downloaded latest firefox, visited my download web page and downloaded OpenShot and was editing a video). \n\n ROX has been changed to use double-clicks (right click on empty ROX space, select options and change settings in Filer-Window and Pinboard to use single clicks as you prefer). \n\n ISO includes a windows ISO burner program for the convenience of those who might otherwise struggle. \n\n Get (download) and run script in the home directory can be double clicked in which case you have to wait (no prompts yet) for it to complete (download 30MB of Firefox) and form the firefox sub directory, etc. \n\n From ram boot using puppy pfix=ram,nocopy at the initial desktop I'm seeing 220MB RAM used. With gui, firewall, sound set up, firefox and flash SFS's loaded, watching a SneekyLinux YouTube RAM usage rises to around 550MB\n\n\n","torrent":{"xt":"urn:btih:eba83d6691e85f82ae0db8090a8c7db2f98558b5","amp;dn":"Puppy_Linux_ThinSlacko_archive_03-Apr-2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eba83d6691e85f82ae0db8090a8c7db2f98558b5","infoHashBuffer":{"type":"Buffer","data":[235,168,61,102,145,232,95,130,174,13,184,9,10,140,125,178,249,133,88,181]},"announce":[],"urlList":[]}}