{"title":"I serve: A Novel of the Black Prince by Rosanne E. Lortz","uid":9693477,"size":345296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebce512d9ba82b9b9de653dce3a5dfa606d252bd&amp;dn=I+serve%3A+A+Novel+of+the+Black+Prince+by+Rosanne+E.+Lortz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PirateBook","files":1,"time":1393900237,"description":"\nA Tale of Arms, of Death, of Love, and of Honor.\n\nSet against the turbulent backdrop of the Hundred Years' War, I Serve chronicles the story of Sir John Potenhale. A young Englishman of lowly birth, Potenhale wins his way to knighthood on the fields of France. He enters the service of Edward, the Black Prince of Wales, and immerses himself in a stormy world of war, politics, and romantic intrigue.\n\nWhile campaigning in France, Potenhale develops an interest in Margery, a spirited lady-in-waiting with a close-kept secret. He soon learns that Sir Thomas Holland, a crass and calculating baron, holds the key to unlock Margery's mystery and possesses the power to overturn all of his hopes.\n\nWhen the Black Death strikes Europe, however, Potenhale realizes that the fiercest enemy does not always appear in human form. Seeing the pestilence as a punishment for the sins of his generation, he questions his calling as a knight and considers entering the cloister. Margery or the monastery? Torn between losing his soul and losing the love of his life, he finds friendship with a French knight who might--just possibly--help him save both\n\nGenre: Fiction","torrent":{"xt":"urn:btih:ebce512d9ba82b9b9de653dce3a5dfa606d252bd","amp;dn":"I+serve%3A+A+Novel+of+the+Black+Prince+by+Rosanne+E.+Lortz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebce512d9ba82b9b9de653dce3a5dfa606d252bd","infoHashBuffer":{"type":"Buffer","data":[235,206,81,45,155,168,43,155,157,230,83,220,227,165,223,166,6,210,82,189]},"announce":[],"urlList":[]}}