{"title":"Demolition.Inc.incl.Update.and.DLC-ALiAS","uid":8419546,"size":107138671,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ec24d0eda12ea8de5db2eb98a59bc687e3e40c81&amp;dn=Demolition.Inc.incl.Update.and.DLC-ALiAS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gh0stNet","files":4,"time":1367147165,"description":"    nerv\n    /sac\n     \n    RELEASE\n    iNFOS\n     \n    Demolition Inc. incl. Update and DLC\n    (c) Zeroscale\n     \n    Release date: 28/04/2013          Protection: Steam\n    Files: 11x10.00MB                Language: Multilangual\n     \n    RELEASE\n    NOTES\n     \n    Demolition, Inc. is a new action strategy game: Assume the role of\n    the daring demolition worker Mike and start a devastating chain\n    reaction on earth. Use cool tools and weapons and expand your\n    destructive powers\n     \n    Navigate Mike's UFO over cities of earth and unfold complete chaos\n    with your tools and weapons: Cars which drive into tower blocks and\n    let them collapse, high-rises which fall onto other high-rises, and\n    exploding cows which let whole streets of houses come tumbling down\n     \n    Demolition, Inc. is 100% physics technology: nothing is\n    predetermined, and nothing is pre-animated. Only you make a\n    determination what you do and what you see Every time you play\n    will have a unique experience.\n     \n    Features:\n     \n    - Ground-breaking technology - Car and building physics are fully\n    simulated. Everything is destructible and nothing is pre-animated.\n    No game round is like the other.\n    - Combining action and strategy - Use the endless possibilities of\n    combining your tools and weapons to make devastating chain\n    reactions. Only this way you can manage to tear down whole cities\n    before the army arrives\n    - Tools and Weapons - Use you tractor beam to take control of cars,\n    place anti-gravity ramps to maximize damage, use the huge wrecking\n    ball to make way. Improve your skills on the way and unlock\n    breathtaking and crazy new tools and weapons\n    - Exciting levels - Three cities and 15 districts are awaiting to be\n    demolished by you and lead to their true destination\n    - Campaign mode - Fulfill your mission and destroy on city after the\n    other. By cunning use of your tools and weapons you will turn\n    district after district to rubble\n    - Rampage mode - Limitless destruction. Go mayhem with all your\n    tools and weapons you have unlocked. The level is your playground\n    and you experience new breathtaking scenes of destruction anew over\n    and over again.\n    - Online high scores - Compare your skills with those of your\n    friends and the world-wide steam community. Play against the clock\n    or try to make as many points as possible by demolishing districts\n    in a creative way\n     \n    About the DLC\n     \n    Play the brand new Back to Work campaign with 21 new levels.\n    Unleash the chaos with 3 new special destruction tools. Make cars\n    fly, control swarms of cars and start asteroid hails. Unlock 10 new\n    achievements. Do all this with the freshly updated Demolition Inc.\n    engine with the new Workshop compatible editor, new tutorial\n    levels, better physics and more realistic vehicle simulation. And\n    dont forget to visit the new Black Cow Market to get helpful tools\n    and enhancements for your UFO.\n     \n    -  New campaign with 21 levels\n    -  3 new special weapons (usable in editor)\n    -  5 new building types (usable in editor)\n    -  10 new achievements\n    -  Play all this with the freshly updated engine\n     \n    Just Updated:\n     \n    - Gamepad support: play the game on your TV with Big Picture Mode\n    and a controller\n    - New tutorial levels: improved learning curve for new players\n    - Black Cow Market: get help when you are stuck and buy enhancements\n    for your UFO\n    - New vehicles: vehicle AI improved and new vehicle types with\n    different behaviours\n    - Improved physics simulation: better performance and accuracy\n     \n   &lt;a href=&quot; http://store.steampowered.com/news/?feed=steamupdates&amp;appids=98600&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://store.steampowered.com/news/?feed=steamupdates&amp;appids=98600&lt;/a&gt;\n     \n    1. Unzip &amp; Unrar\n    2. Run Setup.exe (at the end select &quot;Run setup.bat&quot;)\n    3. Have Fun\n     \n    NOTES\n     \n    Ripped: -\n     \n    Languages: English, French, German, Italian, Spanish, Polish, Russian\n     \n    can be changed into Game Menu\n     \n    Support the software developers. If you like this game, BUY IT\n     \n    ALiAS GREETS\n     \n    DiViNE  -  RELOADED  -  0x0007\n    RESTORE -  LZ0 - 0x0815 - PROFiT\n    PROPHET -  CYGNUS  -  HI2U\n     \n    .. ASCii DOPE BY ..\n     \n    NERV/SAC ","torrent":{"xt":"urn:btih:ec24d0eda12ea8de5db2eb98a59bc687e3e40c81","amp;dn":"Demolition.Inc.incl.Update.and.DLC-ALiAS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec24d0eda12ea8de5db2eb98a59bc687e3e40c81","infoHashBuffer":{"type":"Buffer","data":[236,36,208,237,161,46,168,222,93,178,235,152,165,155,198,135,227,228,12,129]},"announce":[],"urlList":[]}}