{"title":"Adam Curtis Definitive Collection 1992-2011","uid":9919646,"size":15086071410,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ec483a06422aab672356ddafa418083d11f04eec&amp;dn=Adam+Curtis+Definitive+Collection+1992-2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"d1lemma","files":31,"time":1396989725,"description":"&quot;For over 20 years, Adam Curtis has concentrated on a cultural history behind the politics of the 20th century and beyond. In 1992, he made Pandora's Box, six &quot;fables&quot; on the consequences (often dangerous) of political and technocratic rationality, especially when used to crush common sense and a clear reporting of the facts. Nothing concerns Curtis more than the way public relations and spin doctoring have become ways of masking the true nature of modern history - and nothing is so vital to the new forms of modern bureaucratic totalitarianism, the dulcet &quot;order&quot; that has come to fill the ground left by fascism and communism.&quot;\n\nVideos in this collection are mostly in the 480p range. Audio anywhere from 60kbps to maybe 128k if you get lucky. This is low quality archive footage. I do not know of any Adam Curtis programs in DVD quality exist on the web at this time. Check the file properties for more detailed codec info.\n\nThe Description file is cobbled together from various other sources strewn across the web. \n\nThe features of this Collection over others are a the thorough plot and theme synopsis included (cobbled together from various sources); File names are stripped of all that pseudo-branding baggage and presents all of Curtis' landmark films within a single folder. ","torrent":{"xt":"urn:btih:ec483a06422aab672356ddafa418083d11f04eec","amp;dn":"Adam+Curtis+Definitive+Collection+1992-2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec483a06422aab672356ddafa418083d11f04eec","infoHashBuffer":{"type":"Buffer","data":[236,72,58,6,66,42,171,103,35,86,221,175,164,24,8,61,17,240,78,236]},"announce":[],"urlList":[]}}