{"title":"Miss America Archive Complete Golden Age","uid":8420559,"size":25458441,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ef867fe19f1b0cbe459115a6da5ea7846e6ff39c&amp;dn=Miss+America+Archive+Complete+Golden+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mothra67","files":-1,"time":1367176565,"description":" Golden Age Appearances \n\n    Military Comics #1-7 \n\nJoan Dale, a reporter for the Daily Star, took a ferry to visit the Statue of Liberty and fell asleep on a bench. Before she dozed off, Joan thought about the good a person could do if only &quot;they had the powers that the Statue of Liberty must possess&quot;. She then had a dream where the statue came to life. It told Joan that it would give her magic powers to help America because it heard her wish. After she awoke, Joan discovered it was more than just a dream and that she truly had magic powers. She decided to use those powers to stop criminals and Axis saboteurs as Miss America. She eventually quit the Daily Star due to her sexist editor refusing to give her any credit for a job well done, and accepted an invitation from agent Tim Healy to join the FBI. Around this time, she began wearing costumes while\nMiss-America-dovesJoan Dale transforms some villains into doves\n\nfighting crime (the costume changed from issue to issue, probably due to the fact that she could create any kind of costume instantly).\nPowers and Abilities Edit\nMA-soldiersMiss America magically shrinks some soldiers and then turns them into steam.\n\nMiss America's powers included the ability to control, create, and change matter. She usually used these abilities to instantly change her clothing or appearance, to turn enemies and their weapons into harmless objects, or to animate objects (such as chairs or statues) to help her with a task. She could even turn two dimensional art into something real. She could fly, shrink herself and others, and move objects telekinetically. \n\nPlease seed for all to enjoy","torrent":{"xt":"urn:btih:ef867fe19f1b0cbe459115a6da5ea7846e6ff39c","amp;dn":"Miss+America+Archive+Complete+Golden+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef867fe19f1b0cbe459115a6da5ea7846e6ff39c","infoHashBuffer":{"type":"Buffer","data":[239,134,127,225,159,27,12,190,69,145,21,166,218,94,167,132,110,111,243,156]},"announce":[],"urlList":[]}}