{"title":"Lethal But Legal Corporation Consumption and Protecting Public H","uid":9680164,"size":10658811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f14cfc489c848db1bb3f50965ebd2ad66dae33bb&amp;dn=Lethal+But+Legal+Corporation+Consumption+and+Protecting+Public+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"K-Slender","files":4,"time":1393653357,"description":"Page Numbers Source ISBN: 0199937192\nPublisher: Oxford University Press, USA; 1 edition (January 7, 2014)\nLanguage: English\nASIN: B00HQFO66Q\n\nDecisions made by the food, tobacco, alcohol, pharmaceutical, gun, and automobile industries have a greater impact on today's health than the decisions of scientists and policymakers. As the collective influence of corporations has grown, governments around the world have stepped back from their responsibility to protect public health by privatizing key services, weakening regulations, and cutting funding for consumer and environmental protection. Today's corporations are increasingly free to make decisions that benefit their bottom line at the expense of public health.\nLethal but Legal examines how corporations have impacted -- and plagued -- public health over the last century, first in industrialized countries and now in developing regions. It is both a current history of corporations' antagonism towards health and an analysis of the emerging movements that are challenging these industries' dangerous practices. The reforms outlined here aim to strike a healthier balance between large companies' right to make a profit and governments' responsibility to protect their populations.\nWhile other books have addressed parts of this story, Lethal but Legal is the first to connect the dots between unhealthy products, business-dominated politics, and the growing burdens of disease and health care costs. By identifying the common causes of all these problems, then situating them in the context of other health challenges that societies have overcome in the past, this book provides readers with the insights they need to take practical and effective action to restore consumers' right to health. ","torrent":{"xt":"urn:btih:f14cfc489c848db1bb3f50965ebd2ad66dae33bb","amp;dn":"Lethal+But+Legal+Corporation+Consumption+and+Protecting+Public+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f14cfc489c848db1bb3f50965ebd2ad66dae33bb","infoHashBuffer":{"type":"Buffer","data":[241,76,252,72,156,132,141,177,187,63,80,150,94,189,42,214,109,174,51,187]},"announce":[],"urlList":[]}}