{"title":"[ExploitedCollegeGirls] Bridget (02.27.2014)","uid":9679996,"size":819318005,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f1e2889cd24ccac7b25a77b89fb82c5c8f47ed0d&amp;dn=%5BExploitedCollegeGirls%5D+Bridget+%2802.27.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1393649276,"description":"[ExploitedCollegeGirls] Bridget (02.27.2014)\n\nIf you like girls who are slim, athletic and happen to cuss like a sailor when sexually aroused Bridget is for you. She's a 22 year old California girl with 102 pounds of tanned beach body topped by a big smile and a bigger mane of sun kissed brown hair that she tosses around like a scarf.\nBridget is teeny, fit and oozes sexuality. Even during the behind the scenes conversation all I can focus on is her tight little package and how girl next door sexy she is. I get her naked and start getting her off and she just gets sexier. When she drops to her knees and deep throats my cock, though, I just about fall in love. Her oral skills are beyond compare, from her hand action to the way she deep throats until she gags, it's some of the best head I've ever gotten. You'll get to see every bit of it, from several angles, I got POV shots as well as a third camera replay.\nDuring the shoot I found Bridget incredibly sexy, from the way she ground her hips into me when we were fucking to the way her little booty bounced as I pounded her. With her combination of looks and enthusiasm this girl definitely has a future in porn (she even mentioned that she'd picked out a pornstar name: Bridget Blonde). Initially I thought the sexiest part was when she licked her fingers and diddled her clit as I fucked her from behind, but after reviewing the shoot I changed my mind. If you watch carefully you can see her look directly into the camera and give some a look that clearly says, &quot;Look what you are missing.&quot; So, whoever the dumbass is who dropped the ball and let Bridget get away, thanks bro!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=olx3qpqhpe9bzpl7n3ua.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=olx3qpqhpe9bzpl7n3ua.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=bwtemwohg7nfbj5ckhhw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=bwtemwohg7nfbj5ckhhw.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f1e2889cd24ccac7b25a77b89fb82c5c8f47ed0d","amp;dn":"%5BExploitedCollegeGirls%5D+Bridget+%2802.27.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1e2889cd24ccac7b25a77b89fb82c5c8f47ed0d","infoHashBuffer":{"type":"Buffer","data":[241,226,136,156,210,76,202,199,178,90,119,184,159,184,44,92,143,71,237,13]},"announce":[],"urlList":[]}}