{"title":"Man Against Crime - 1949-56 Private Eye Drama {3 Episodes - DVD","uid":9652630,"size":549656576,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f20018fff5a606b82725060d205dfb1b5b94084b&amp;dn=Man+Against+Crime+-+1949-56+Private+Eye+Drama+%7B3+Episodes+-+DVD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nasty_llama","files":3,"time":1393121670,"description":"Man Against Crime (also known as Follow That Man), one of the first television programs about private eyes, ran on CBS, the DuMont Television Network and NBC from October 7, 1949 to August 26, 1956. The show was created by Lawrence Klee and was broadcast live until 1952.[1] The series was one of the few television programs ever to have been simulcast on more than one network: the program aired on both NBC and DuMont during the 1953-1954 television season.\n\nMan Against Crime starred Ralph Bellamy as Mike Barnett, a New York freelance private eye. In the 1951 season, Robert Preston co-starred as Mike Barnett's brother, Pat (who also assumed the lead while Bellamy was on vacation that summer). In the summer of 1956, Frank Lovejoy took over the role of Mike Barnett until the series' end that same year.\n\nAccompanied by a frantic theme song by Fred Steiner, the film noir-style introduction features an unknown man running down a deserted New York City street while being chased by a black car, all of which is viewed from above. As he knocks on Barnett's door, there is a spray of sub-machine gun fire, and the man is killed. Barnett opens the door, hears the click of the bolt on the gun, ducks and is missed by a second, shorter burst of slugs. Barnett then takes off after the killer while Follow That Man appears in bold letters and the title of the episode is shown on a file folder that is propped up against a telephone. The filmed episodes were syndicated as Follow That Man because the sponsor owned the original title [see below].\n\nThe show's first prime-time episode aired on CBS on 7 October 1949, and the final prime-time episode was broadcast, on NBC, on 26 August 1956.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Man_Against_Crime&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Man_Against_Crime&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tv.com/shows/man-against-crime/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tv.com/shows/man-against-crime/&lt;/a&gt;","torrent":{"xt":"urn:btih:f20018fff5a606b82725060d205dfb1b5b94084b","amp;dn":"Man+Against+Crime+-+1949-56+Private+Eye+Drama+%7B3+Episodes+-+DVD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20018fff5a606b82725060d205dfb1b5b94084b","infoHashBuffer":{"type":"Buffer","data":[242,0,24,255,245,166,6,184,39,37,6,13,32,93,251,27,91,148,8,75]},"announce":[],"urlList":[]}}