{"title":"Consciousness Beyond Life - Pim Van Lommel.pdf","uid":9788508,"size":160356514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f359dbd20e622ff5c43556c93e3f73a243e66cbd&amp;dn=Consciousness+Beyond+Life+-+Pim+Van+Lommel.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"joshua13","files":1,"time":1395208468,"description":"Title:\nConsciousness beyond life : the science of the near-death experience / Pim van Lommel.\n\nAuthor:\nLommel, Pim van, 1943-\nPublication Information:\n2011, c2010\n\n\n\n\n\nAbstract:\nDr. Pim van Lommel, a renowned cardiologist, was so inspired by the stories his patients told of their Near Death Experiences (NDEs) that he became the first medical practitioner to risk his reputation with a full, systematic trial into the phenomenon. He interviewed 344 heart patients at his hospital who had all clinically died, some for five minutes or longer, before being resuscitated. Of these, 62 -- or 18 per cent -- reported some ongoing experience after the medical monitors had pronounced them to be dead. Half were aware they were 'dead,' and 15 had out-of-body experiences where they were aware of the actions of the hospital staff around their body. In 2001, Van Lommel published the results of his study in the esteemed British medical journal, The Lancet. Van Lommel's article was a worldwide sensation and serves as the basis for this book. Van Lommel claims these are authentic experiences which cannot be reduced to the imagination, psychosis or an oxygen deficiency; people are permanently changed by an NDE. In After Life, Van Lommel explains how people who are clinically dead can have such a transformative experience. He illustrates his argument with stories of people who have gone through an NDE. In Van Lommel's opinion, the current materialistic view of the relationship between the brain and consciousness held by most physicians, philosophers and psychologists is too restricted for a proper understanding of this phenomenon. Our consciousness does not always coincide with the functioning of our brain.\nContents:\n1.A Near-Death Experience and Its Impact on Life -- 2.What Is a Near-Death Experience? -- 3.Changed by a Near-Death Experience -- 4.Near-Death Experiences in Childhood -- 5.There Is Nothing New Under the Sun -- 6.Research into Near-Death Experiences -- 7.The Dutch Study of Near-Death Experience -- 8.What Happens in the Brain When the Heart Suddenly Stops? -- 9.What Do We Know About Brain Function? -- 10.Quantum Physics and Consciousness -- 11.The Brain and Consciousness -- 12.The Continuity of the Changing Body -- 13.Endless Consciousness -- 14.Some Implications of NDE Studies -- 15.Epilogue.","torrent":{"xt":"urn:btih:f359dbd20e622ff5c43556c93e3f73a243e66cbd","amp;dn":"Consciousness+Beyond+Life+-+Pim+Van+Lommel.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f359dbd20e622ff5c43556c93e3f73a243e66cbd","infoHashBuffer":{"type":"Buffer","data":[243,89,219,210,14,98,47,245,196,53,86,201,62,63,115,162,67,230,108,189]},"announce":[],"urlList":[]}}