{"title":"Jon Sable, Freelance (First Comics)","uid":8427597,"size":2075891639,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f3cc8be63d333dae8572499ac5926ec6451eb8bb&amp;dn=Jon+Sable%2C+Freelance+%28First+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ichthypod_Crane","files":99,"time":1367391602,"description":"Next up, our FCUP series is 'Jon Sable, Freelance'. From the crowd-sourced geniuses at Wikipedia:\n\nJon Sable Freelance is an American comic book series, one of the first series created for the fledging publisher First Comics in 1983. It was written and drawn by Mike Grell and was a fully creator-owned title.\n\nJonathan Sable was a bounty hunter and mercenary who previously had been an athlete in the 1972 Munich Olympic Games. After witnessing the terrorist outrages at those games, he married a fellow athlete and they relocated to Rhodesia, where Sable became an organizer of safaris for tourists, and later a game warden. It was during this time his family was murdered by poachers. After avenging his slain family, Sable returned to the USA and became a free-lance mercenary.\n\nHe also has a double identity as a successful children's book writer under the name of &quot;B.B. Flemm.&quot; Unlike many such characters, his literary agent is aware of his other identity's activities, but is most persuasive in enforcing his writing contract obligations as well.\n\nJon Sable Freelance lasted 56 issues from June 1983 to February 1988 before being cancelled. While Grell wrote and did all the covers, he stopped drawing the stories after #44. Late in this run Grell announced in the comic's own text pages that Tony DeZuniga would soon join him as the new artist. Just what happened to these plans is unclear, but soon the series was suspended, and after a few months, Marv Wolfman was writing and Bill Jaaska was drawing a new series called Sable, with Grell having no part. This lasted 27 issues before cancellation. Marv Wolfman abruptly left the series after issue #23 and comic book fan Steve Kaye took over the writing chores for the final four issues. Fan favorite artist Tim Vigil provided covers for the remaining issues.\n\nIn March 2005, IDW Publishing released the first of a new six-issue mini-series titled Jon Sable Freelance: Bloodtrail (originally announced as Jon Sable, Freelance: Conspiracy) written and drawn by Grell. IDW have also been reprinting the entire original run in a series of trade paperbacks. A new series, Jon Sable: Ashes of Eden, began publication as an online series in November 2007, and was published as a 5-issue mini-series beginning in 2009 and ending in 2010. This torrent contains all of the above, as well as all the IDW collected editions I could find and a bonus or two.\n\n\nEach of my First Comics uploads contains a .txt file called 'First Missing'. If you have ANY of the scans listed, please contact me at the listed email. I want to make these uploads as complete as possible. Thanks!\n\nCheers to the creators for creatin' and the scanners for scannin'! Keep it alive, please!\n","torrent":{"xt":"urn:btih:f3cc8be63d333dae8572499ac5926ec6451eb8bb","amp;dn":"Jon+Sable%2C+Freelance+%28First+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3cc8be63d333dae8572499ac5926ec6451eb8bb","infoHashBuffer":{"type":"Buffer","data":[243,204,139,230,61,51,61,174,133,114,73,154,197,146,110,198,69,30,184,187]},"announce":[],"urlList":[]}}