{"title":"Waiting for the Galactic Bus series by Parke Godwin","uid":9675873,"size":3799823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f72c9667ba8fe4f50a1fb1602aff730cc6ef5ae0&amp;dn=Waiting+for+the+Galactic+Bus+series+by+Parke+Godwin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PirateBook","files":4,"time":1393560773,"description":"\nGodwin is known for his novels of legendary figures placed in realistic historical settings, written in a lyrical yet precise prose style and sardonic humor. His retelling of the Arthur legend, Firelord in 1980, Beloved Exile in 1984 and The Last Rainbow in 1985, is set in the 5th century during the collapse of the Roman empire, and his reinterpretation of Robin Hood (Sherwood, 1991, and Robin and the King, 1993) takes place during the Norman conquest and features kings William the Conqueror and William Rufus as major characters. His other well-known works include Waiting for the Galactic Bus (1988) and its two sequels: The Snake Oil Wars, and The Snake Oil Variations, both in 1989. These were humorous critiques of American pop culture and religion.\n\nGenre: Fantasy, Comedy\n\n\nBook 1: Waiting for the Galactic Bus\n\nImagine two brothers off on an intergalatic Spring Break. When their friends leave them behind on Earth, they've got a few millenia to kill before they'll manage to get back to school. So, as an experiment, mind you, they decide to give evolution a bit of a nudge... And that's when all hell breaks loose... a little more literally than either of them planned...\n\nBook 2: The Snake Oil Wars\n\nThis book continues the tale of mankind's alien creators, Barion and Coyul, two near-immortal extraterrestrials who genetically tampered with the prehistoric apes of Earth 5 million years ago, thus giving rise to the human race. That bit of character enhancement, however, was against the law among their people, and Barion is removed from his post as ruler of the heavenly realm Topside to stand trial on their home world. His brother Coyul is left behind to explain to all the souls in Topside, as well as in his own quite hellish Below Stairs, certain ... realities about the universe.","torrent":{"xt":"urn:btih:f72c9667ba8fe4f50a1fb1602aff730cc6ef5ae0","amp;dn":"Waiting+for+the+Galactic+Bus+series+by+Parke+Godwin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f72c9667ba8fe4f50a1fb1602aff730cc6ef5ae0","infoHashBuffer":{"type":"Buffer","data":[247,44,150,103,186,143,228,245,10,31,177,96,42,255,115,12,198,239,90,224]},"announce":[],"urlList":[]}}