{"title":"InterracialPickups - Britney Young big black cock slut","uid":9879523,"size":646804391,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f8a5cd14ec69f9f5107d44641867340b44108b9b&amp;dn=InterracialPickups+-+Britney+Young+big+black+cock+slut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HardFuck","files":1,"time":1396522967,"description":"InterracialPickups - Britney Young - HD\n\nScene Pictures:\n &lt;a href=&quot;\nhttp://www.urpichost.com/?v=interrama.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.urpichost.com/?v=interrama.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.urpichost.com/?v=interrklk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.urpichost.com/?v=interrklk.jpg&lt;/a&gt;\n\nBritney Young found an ad and was looking for some cash to get her by the next few weeks. I had some money to spare but only if she'd be willing to play ball.....or with my black balls. I've always known that cash equals ass and Britney had plenty of it. I told Britney that I could get her all kinds of work as I started flirting with her. Britney slowly came to the dark side and the promise of fame and fortune was too great for her to pass up. Britney knew her way around a cock as she unzipped my pants and teased my big, black cock. Britney told me she never had Interracial Sex and was nervous to deep throat my entire black cock. Britney's beautiful eyes looked up at me while my meat was sliding down her wind pipe. I nearly came early from the bomb ass head she was dishing out. I held back long enough to slide my black pork deep in her pussy. I felt those grea tits as I nailed her from behind. I kept telling her that this would enhance her career and she bought it hook,line and sinker. That tight pussy slowly spread apart as my black anaconda slithered its way towards her rib cage. Those beautiful ass cheeks got palmed by my hands as I went to town on that white slut. The next best thing was being on my back and letting her ride me until my balls massaged her throbbing clit. Britney kept riding my massive black cock until my balls exploded on her cute, white face. I told Britney I'd have more work for her but I really just changed my phone number. I also promised her that the scene would never wind up on the Internet. One lie lead to another. ","torrent":{"xt":"urn:btih:f8a5cd14ec69f9f5107d44641867340b44108b9b","amp;dn":"InterracialPickups+-+Britney+Young+big+black+cock+slut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8a5cd14ec69f9f5107d44641867340b44108b9b","infoHashBuffer":{"type":"Buffer","data":[248,165,205,20,236,105,249,245,16,125,68,100,24,103,52,11,68,16,139,155]},"announce":[],"urlList":[]}}