{"title":"Transfer Boy: Perspectives on Asperger Syndrome ~ariane_c","uid":8429239,"size":1979393,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8dc01fea0127d1c405292c6f0f6fd3492594d72&amp;dn=Transfer+Boy%3A+Perspectives+on+Asperger+Syndrome+%7Eariane_c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ariane_c","files":1,"time":1367441269,"description":" \tPublisher: Jessica Kingsley Pub; 1 edition (March 15, 2005) PDF 208 Pages\n\nTransfer Boy: Perspectives on Asperger Syndrome explores what it is like to be an adolescent with Asperger Syndrome, through interviews with Teodor, a 'psychologically unusual' thirteen-year-old. In this detailed case study, Vuletic and Ferrari combine an autobiographical account with perspectives from other family members and people who know Teodor well, while simultaneously integrating psychiatric and psychological research on autism. The authors evaluate the merits and pitfalls of different interpretations of autism and address the broad psychological issues related to Asperger Syndrome - intelligence, social skills, memory, the transitional period from childhood to adolescence. The study includes results and interpretations of standard measures of self-concept, an IQ test and a psychiatric exam, contributing to the hitherto under-researched area of autistic self-knowledge.\n\nAbout the Author\nLjiljana Vuletic has been involved in the field of autism as a therapist and consultant for twenty years and is currently completing her doctorate at the University of Toronto. Michel Ferrari is Associate Professor and Head of the Centre for Applied Cognitive Science at the University of Toronto. Teodor Mihail is a teenager diagnosed with Asperger syndrome who is currently attending high school, has friends, and is successful in his school programs. His dream is to have a job involving travel to all five continents or working at VIA Rail or Greyhound. ","torrent":{"xt":"urn:btih:f8dc01fea0127d1c405292c6f0f6fd3492594d72","amp;dn":"Transfer+Boy%3A+Perspectives+on+Asperger+Syndrome+%7Eariane_c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8dc01fea0127d1c405292c6f0f6fd3492594d72","infoHashBuffer":{"type":"Buffer","data":[248,220,1,254,160,18,125,28,64,82,146,198,240,246,253,52,146,89,77,114]},"announce":[],"urlList":[]}}