{"title":"Hellina - Genesis 001 (Lightning - 1996) (Talon-Novus) [NVS-D]","uid":9825519,"size":70911779,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fa74a9524c12da83b32660b521e8dc0b33a92ceb&amp;dn=Hellina+-+Genesis+001+%28Lightning+-+1996%29+%28Talon-Novus%29+%5BNVS-D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"blackcanary","files":-1,"time":1395769061,"description":"English | CBR | 53 Pages\n\nHellina: Genesis #1\nPublisher:  Lightning Comics\nPublication Date:  April 1996\n\nWriter:  Joseph C. Zyskowski\nPencillers:  Karl Kerschl, Terral Lawrence, and Paul Abrams\nInkers:  Patricia Laskowski, David Mowry, and Frank Parr\nLetterer:  James Anderson\nCover Artist:  Ed Benes\n\nCollecting Hellina's origin story and her first appearance in the pages of Perg (#4, #6, and #7), this comic shows how Hellina came to be, and how she was redeemed by Perg to become a force for good in the world.\n\nUnlike most of the popular &quot;bad girls in today's comics, Hellina first appeared in a comic title other than her own.  In 1994, we created Hellina as a villain for our popular supernatural vigilante, Perg.  We didn't intend to give Hellina her own comic when we created her... things just sort of worked out that way!\n\n1994 was a bad year in comics, affectionately referred to as the year of &quot;the crash&quot;.  In the years before, comics were printed in record numbers.  Lightning Comics wasn't even a year old when the comic market began to fall apart.  We watched as orders for our three, full color, monthly titles (Bloodfire, Judgement Day, and Perg) decreased month after month.  We continued to print many color books, even though we were guaranteed to lose money on them, because we expected the market to turn around.  By March 1994, our orders for Perg #6 (a full color comic) dropped to around 12,000 copies (dropped to 22,000 copies of Perg #2 in November 1993).  In April 1994, orders for Perg #7 dropped to about 10,000 copies.  In May 1994, Perg #8 had orders for 8,000 copies.  Lightning Comics couldn't continue to publish comics and lose thousands of dollars every month, so we contemplated what many new publishers were doing at the time... going out of business!  Before having to make that difficult decision, however, Lightning Comics offered Hellina #1.\n\nAll we had was a cover for Hellina #1 and a description of the story, which wasn't yet written!  When we got orders for 15,000 copies of the black and white first issue, we swung into full gear and Hellina #1 was released on time!\n\nBecause most of today's Hellina readers never saw an issue of Perg and because there was such a low printing of Perg #6 and #7, we felt now as the time to retell Hellina's origin.  Hellina: Genesis #1 is your opportunity to read these hard to find Perg issues in which Hellina first appeared.\n\nThanks goes to Talon for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9226334&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9226334&lt;/a&gt;","torrent":{"xt":"urn:btih:fa74a9524c12da83b32660b521e8dc0b33a92ceb","amp;dn":"Hellina+-+Genesis+001+%28Lightning+-+1996%29+%28Talon-Novus%29+%5BNVS-D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa74a9524c12da83b32660b521e8dc0b33a92ceb","infoHashBuffer":{"type":"Buffer","data":[250,116,169,82,76,18,218,131,179,38,96,181,33,232,220,11,51,169,44,235]},"announce":[],"urlList":[]}}