{"title":"Bridge of Dreams - The Mary Griggs Burke Collection of Japanese ","uid":9815036,"size":115078721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb434e4eb520e32824bb3ef299360ced185d58bd&amp;dn=Bridge+of+Dreams+-+The+Mary+Griggs+Burke+Collection+of+Japanese+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":-1,"time":1395614676,"description":"English / pdf / 109 MB / 466 p\n\n&quot;The beauty of the Japanese aesthetic first struck me when I saw my mother's kimono, a padded winter garment of black silk with a bold design of twisted pine branches covered with snow.... I can remember putting it on and letting it trail behind me. It was then, I believe, that a future collector of Japanese art was born.&quot;\n\nThe woman who wrote these words, Mary Griggs Burke, did indeed go on to become a collector of Japanese art. Thirty years later she visited Japan at the suggestion of the architect Walter Gropius, and &quot;profoundly moved by the beauty of the paintings and sculpture that I saw...I fell in love with Japan.&quot; In the 1960s, she and her husband, Jackson, began to form their collection. The Mary Griggs Burke Collection, represented in this volume and in the exhibition it accompanies, is a testimony to the intensity and selectivity of Mrs. Burke's collecting, guided by a discerning eye, a deep affection for Japan, and an appreciation of the country's cultural heritage. In 1985, the Japanese government invited her to exhibit the collection at the Tokyo National Museum and two years later, in gratitude for her activities in support of Japanese art and all facets of Japanese culture, conferred on her the honorary medal of Sacred Treasure, Gold and Silver Star, Second Degree, a rare honor for a foreigner to receive.\n\nLong recognized as one of the finest collections of Japanese art in private hands, the Mary Griggs Burke Collection is the largest and most comprehensive outside Japan. The present selection, arranged chronologically, includes an astonishing ceramic vessel from the prehistoric Jomon period, rare examples of Shinto gods from the tenth century, and a recently acquired early depiction, dated 1278, of the Zen theme of the Ten Ox-Herding Songs, a metaphor for the quest for enlightenment. The Japanese genius for dramatic narrative is strongly represented by several seventeenth- and eighteenth-century works depicting scenes from The Tale of Genji, the classic by Lady Murasaki Shikibu that tells the story of Genji, the Shining Prince. Other highlights are Willows and Bridge, an extraordinary pair of folding screens that exemplify the taste of the Momoyama period (1573-1615), and Women Contemplating Floating Fans, an important example of genre painting in the late sixteenth and early seventeenth centuries.\n\nWhile it provides a historical overview of the development of Japanese art, the collection illustrates as well Japan's capacity to foster divergent artistic traditions both from other cultures and from those that reflect indigenous tastes. It also demonstrates the profound impact of Buddhism on Japanese culture, the tastes and values of the courtly and military elite, and the interests of patrons who range from Sinophile rulers and scholars to pleasure-seeking urbanites.","torrent":{"xt":"urn:btih:fb434e4eb520e32824bb3ef299360ced185d58bd","amp;dn":"Bridge+of+Dreams+-+The+Mary+Griggs+Burke+Collection+of+Japanese+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb434e4eb520e32824bb3ef299360ced185d58bd","infoHashBuffer":{"type":"Buffer","data":[251,67,78,78,181,32,227,40,36,187,62,242,153,54,12,237,24,93,88,189]},"announce":[],"urlList":[]}}