{"title":"Maynard Ferguson - 1982 - Hollywood (2004) FLAC","uid":8431555,"size":258105342,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd5a750ba07ef8cdeb58e73e891e553e8f4fdab3&amp;dn=Maynard+Ferguson+-+1982+-+Hollywood+%282004%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eika256","files":-1,"time":1367513526,"description":"Maynard Ferguson - 1982 - Hollywood (2004)\n\nBy the early '80s, trumpeter Maynard Ferguson's disco-heavy &quot;jazz&quot; albums, so commercially viable through the previous decade, had already begun losing their hip cachet. Disco itself was on the wane and Ferguson, with his jumpsuits, smoky sunglasses, and obscenely high trumpet playing, was quickly becoming a parody of himself. Thusly, jazz fans in 1982 were generously bequeathed Hollywood, easily one of the ex-Kenton-ite's worst career efforts. Produced by bassist extraordinaire Stanley Clarke (who also supplied the title track), the result is an airbrushed and extroverted pop pastiche of dancefloor-ready songs that have absolutely nothing to do with jazz. Basically, by this point the MF Band was churning out well-produced, if predictable, instrumental versions of pop tunes with little if any improvisation. To these ends, Michael Jackson's &quot;Don't Stop 'Til You Get Enough&quot; does little to improve on the original, and the tacky mix of banjo and synthesizer on Ferguson's then-latest attempt to squeeze blood from the proverbial soundtrack orange on &quot;Nine to Five'&quot; is simply nauseating. By the time you get to the bloated and over the top version of &quot;For Your Eyes Only,&quot; it's clear things have come to some kind of Waterloo. Not surprisingly, this was the last of Ferguson's bids for crossover success and he disbanded his large ensemble soon after, choosing to spend the better part of the '80s playing slightly more straight-ahead jazz. (AllMusic)\n\nTrack list:\n01 - Don't Stop 'Til You Get Enough\n02 - Deja Vu\n03 - Hollywood\n04 - Nine To Five\n05 - For Your Eyes Only\n06 - Here Today\n07 - Portuguese Love\n08 - Touch And Go\n\nSplit with Medieval. Sorry.\nEnjoy and share! ","torrent":{"xt":"urn:btih:fd5a750ba07ef8cdeb58e73e891e553e8f4fdab3","amp;dn":"Maynard+Ferguson+-+1982+-+Hollywood+%282004%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd5a750ba07ef8cdeb58e73e891e553e8f4fdab3","infoHashBuffer":{"type":"Buffer","data":[253,90,117,11,160,126,248,205,235,88,231,62,137,30,85,62,143,79,218,179]},"announce":[],"urlList":[]}}