{"title":"Reading Obama: Dreams, Hope, and the American Political Traditio","uid":8492598,"size":912209,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fde5b7839125ae03855cfde8f53281b8f0278382&amp;dn=Reading+Obama%3A+Dreams%2C+Hope%2C+and+the+American+Political+Traditio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tmPhoneix","files":1,"time":1369040345,"description":"Derided by the Right as dangerous and by the Left as spineless, Barack Obama puzzles observers. In Reading Obama, James T. Kloppenberg reveals the sources of Obama's ideas and explains why his principled aversion to absolutes does not fit contemporary partisan categories. Obama's commitments to deliberation and experimentation derive from sustained engagement with American democratic thought. In a new preface, Kloppenberg explains why Obama has stuck with his commitment to compromise in the first three years of his presidency, despite the criticism it has provoked.\n\nReading Obama traces the origins of his ideas and establishes him as the most penetrating political thinker elected to the presidency in the past century. Kloppenberg demonstrates the influences that have shaped Obama's distinctive worldview, including Nietzsche and Niebuhr, Ellison and Rawls, and recent theorists engaged in debates about feminism, critical race theory, and cultural norms. Examining Obama's views on the Constitution, slavery and the Civil War, the New Deal, and the civil rights movement, Kloppenberg shows Obama's sophisticated understanding of American history. Obama's interest in compromise, reasoned public debate, and the patient nurturing of civility is a sign of strength, not weakness, Kloppenberg argues. He locates its roots in Madison, Lincoln, and especially in the philosophical pragmatism of William James and John Dewey, which nourished generations of American progressives, black and white, female and male, through much of the twentieth century, albeit with mixed results.\n\nReading Obama reveals the sources of Obama's commitment to democratic deliberation: the books he has read, the visionaries who have inspired him, the social movements and personal struggles that have shaped his thinking. Kloppenberg shows that Obama's positions on social justice, religion, race, family, and America's role in the world do not stem from a desire to please everyone but from deeply rooted--although currently unfashionable--convictions about how a democracy must deal with difference and conflict.","torrent":{"xt":"urn:btih:fde5b7839125ae03855cfde8f53281b8f0278382","amp;dn":"Reading+Obama%3A+Dreams%2C+Hope%2C+and+the+American+Political+Traditio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde5b7839125ae03855cfde8f53281b8f0278382","infoHashBuffer":{"type":"Buffer","data":[253,229,183,131,145,37,174,3,133,92,253,232,245,50,129,184,240,39,131,130]},"announce":[],"urlList":[]}}