{"title":"A Sense of the Enemy: Reading Your Rival's Mind (2014) epub","uid":9698138,"size":1977901,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe4d949e24fc6a955cd4e85486ba759da6d4c60d&amp;dn=A+Sense+of+the+Enemy%3A+Reading+Your+Rival%27s+Mind+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookzilla","files":1,"time":1393962718,"description":"A Sense of the Enemy: The High Stakes History of Reading Your Rival's Mind\n\n\nMore than two thousand years ago the Chinese strategist Sun Tzu advised us to know our enemies. The question has always been how. In A Sense of the Enemy, the historian Zachary Shore demonstrates that leaders can best understand an opponent not simply from his pattern of past behavior, but from his behavior at pattern breaks. Meaningful pattern breaks occur during dramatic deviations from the routine, when the enemy imposes costs upon himself. It's at these unexpected moments, Shore explains, that successful leaders can learn what makes their rivals truly tick.\n\n Shore presents a uniquely revealing history of twentieth-century conflict. With vivid, suspenseful prose, he takes us into the minds of statesmen, to see how they in turn tried to enter the minds of others. In the process, he shows how this type of mind-reading, which he calls &quot;strategic empathy,&quot; shaped matters of war and peace. Mahatma Gandhi, for instance, was an excellent strategic empath. In the wake of a British massacre of unarmed Indian civilians, how did Gandhi know that nonviolence could ever be effective? And what of Gustav Stresemann, the 21-year-old Wunderkind Ph.D., who rose from lobbyist for chocolate makers to Chancellor of Germany. How did he manage to resurrect his nation to great power status after its humiliating loss in World War One? And then there is Le Duan, the shadowy Marxist manipulator who was actually running North Vietnam during the 1960s, as opposed to Ho Chi Minh. How did this rigid ideologue so skillfully discern America's underlying constraints? And, armed with this awareness, how did he construct a grand strategy to defeat the United States? One key to all these leaders' triumphs came from the enemy's behavior at pattern breaks.\n\n Drawing on research from the cognitive sciences, and tapping multilingual, multinational sources, Shore has crafted an innovative history of the last century's most pivotal moments, when lives and nations were on the line. Through this curious study of strategic empathy, we gain surprising insights into how great leaders think.\n","torrent":{"xt":"urn:btih:fe4d949e24fc6a955cd4e85486ba759da6d4c60d","amp;dn":"A+Sense+of+the+Enemy%3A+Reading+Your+Rival%27s+Mind+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4d949e24fc6a955cd4e85486ba759da6d4c60d","infoHashBuffer":{"type":"Buffer","data":[254,77,148,158,36,252,106,149,92,212,232,84,134,186,117,157,166,212,198,13]},"announce":[],"urlList":[]}}